GKU_g_1 = """ 
Книга первая - Общие положения Гражданского кодекса
Глава 1 - Гражданского кодекса
Гражданское законодательство Украины

Статья 1. Отношения, которые регулируются гражданским законодательством
1. Гражданским законодательством регулируются личные неимущественные и имущественные отношения (гражданские отношения), основанные на юридическом равенстве, свободном волеизъявлении, имущественной независимости их участников.
2. К имущественным отношениям, основанным на административном или другом властном подчинении одной стороны второй стороне, а также к налоговым, бюджетным отношениям гражданское законодательство не применяется, если другое не установлено законом.

Статья 2. Участники гражданских отношений
1. Участниками гражданских отношений являются физические лица и юридические лица (далее - лица).
2. Участниками гражданских отношений являются: государство Украина, Автономная Республика Крым, территориальные общины, иностранные государства и прочие субъекты публичного права.

Статья 3. Общие принципы гражданского законодательства
1. Общими принципами гражданского законодательства являются:
недопустимость своевольного вмешательства в сферу личной жизни человека;
недопустимость лишения права собственности, кроме случаев, установленных Конституцией Украины и законом;
свобода договора;
свобода предпринимательской деятельности, которая не запрещена законом;
судебная защита гражданских прав и интересов;
справедливость, добросовестность и разумность.

Статья 4. Акты гражданского законодательства Украины
1. Основу гражданского законодательства Украины составляет Конституция Украины.
2. Основным актом гражданского законодательства Украины является Гражданский кодекс Украины.
Актами гражданского законодательства являются также другие законы Украины, которые принимаются согласно Конституции Украины и этого Кодекса (далее - закон).
Если субъект права законодательной инициативы подал в Верховный Совет Украины проект закона, который регулирует гражданские отношения иначе, чем этот Кодекс, он обязан одновременно подать проект закона о внесении изменений в Гражданский кодекс Украины. Поданый законопроект рассматривается Верховным Советом Украины одновременно с соответствующим проектом закона о внесении изменений в Гражданский кодекс Украины.
3. Гражданские отношения могут регулироваться актами Президента Украины в случаях, установленных Конституцией Украины
4. Актами гражданского законодательства являются также постановления Кабинета Министров Украины.
Если постановление Кабинета Министров Украины противоречит положениям этого Кодекса или другому закону, применяются соответствующие положения этого Кодекса или другого закона.
5. Другие органы государственной власти Украины, органы власти Автономной Республики Крым могут выдавать нормативно-правовые акты, которые регулируют гражданские отношения, лишь в случаях и в границах, установленных Конституцией Украины  и законом.
6. Гражданские отношения регулируются одинаково на всей территории Украины.

Статья 5. Действие актов гражданского законодательства во времени
1. Акты гражданского законодательства регулируют отношения, которые возникли со дня вступления их в силу.
2. Акт гражданского законодательства не имеет обратного действия во времени, кроме случаев, когда он смягчает или отменяет гражданскую ответственность лица.
3. Если гражданские отношения возникли раньше и регулировались актом гражданского законодательства, утратившего силу, новый акт гражданского законодательства применяется к правам и обязанностям, которые возникли с момента вступления его в силу.

Статья 6. Акты гражданского законодательства и договор
1. Стороны имеют право заключить договор, который не предусмотрен актами гражданского законодательства, но отвечает общим основам гражданского законодательства.
2. Стороны имеют право урегулировать в договоре, который предусмотрен актами гражданского законодательства, свои отношения, которые не урегулированы этими актами.
3. Стороны в договоре могут отступить от положений актов гражданского законодательства и урегулировать свои отношения на собственное усмотрение.
Стороны в договоре не могут отступить от положений актов гражданского законодательства, если в этих актах прямо сказано об этом, а также в случае, если обязательность для сторон положений актов гражданского законодательства вытекает из их содержания или из сути отношений между сторонами.
4. Положение частей первой, второй и третьей этой статьи применяются и к односторонним сделкам.

Статья 7. Обычай
1. Гражданские отношения могут регулироваться обычаем, в частности обычаем делового оборота.
Обычаем является правило поведения, которое не установлено актами гражданского законодательства, но является устоявшимся в определенной сфере гражданских отношений.
Обычай может быть зафиксирован в соответствующем документе.
2. Обычай, который противоречит договору или актам гражданского законодательства, в гражданских отношениях не применяется.

Статья 8. Аналогия
1. Если гражданские отношения не урегулированы этим Кодексом, другими актами гражданского законодательства или договором, они регулируются теми правовыми нормами этого Кодекса, других актов гражданского законодательства, которые регулируют похожие по смыслу гражданские отношения (аналогия закона).
2. В случае невозможности использовать аналогию закона для регулирования гражданских отношений они регулируются согласно общим основам гражданского законодательства (аналогия права).

Статья 9. Применение Гражданского кодекса Украины к урегулированию отношений в сферах хозяйствования, использования природных ресурсов, охраны окружающей среды, а также к трудовым и семейным отношениям
1. Положения этого Кодекса применяются к урегулированию отношений, которые возникают в сферах использования естественных ресурсов и охраны окружающей среды, а также к трудовым и семейным отношениям, если они не урегулированы другими актами законодательства.
2. Законом могут быть предусмотрены особенности регулирования имущественных отношений в сфере хозяйствования.

Статья 10. Международные договора
1. Действующий международный договор, который регулирует гражданские отношения, согласие на обязательность которого дано Верховной Радой Украины, является частью национального гражданского законодательства Украины.
2. Если в действующем международном договоре Украины, составленном в установленном законом порядке, содержатся другие правила, чем установленные соответствующим актом гражданского законодательства, применяются правила соответствующего международного договора Украины."""

GKU_g_2 = """
Глава 2 - Гражданского кодекса
Основания возникновения гражданских прав и обязанностей. Осуществление гражданских прав и выполнение обязанностей

Статья 11. Основания возникновения гражданских прав и обязанностей
1. Гражданские права и обязанности возникают из действий лиц, предусмотренных актами гражданского законодательства, а также из действий лиц, не предусмотренных этими актами, но по аналогии порождают гражданские права и обязанности.
2. Основаниями возникновения гражданских прав и обязанностей, в частности, являются:
договоры и прочие сделки;
создание литературных, художественных произведений, изобретений и других результатов интеллектуальной, творческой деятельности;
нанесение имущественного (материального) и морального ущерба другому лицу;
другие юридические факты.
3. Гражданские права и обязанности могут возникать непосредственно из актов гражданского законодательства.
4. В случаях, установленных актами гражданского законодательства, гражданские права и обязанности возникают непосредственно из актов органов государственной власти, органов власти Автономной Республики Крым или органов местного самоуправления.
5. В случаях, установленных актами гражданского законодательства, гражданские права и обязанности могут возникать по решению суда.
6. В случаях, установленных актами гражданского законодательства или договором, основанием возникновения гражданских прав и обязанностей может быть наступление или ненаступление определенного события.

Статья 12. Осуществление гражданских прав
1. Лицо осуществляет свои гражданские права свободно, по собственному усмотрению.
2. Неосуществление лицом своих гражданских прав не является основанием для их прекращения, кроме случаев, установленных законом.
3. Лицо может отказаться от своего имущественного права.
Отказ от права собственности на транспортные средства, животных, недвижимое имущество осуществляется в порядке, установленном актами гражданского законодательства.
4. Лицо может по возмездному или безвозмездному договору передать свое имущественное право другому лицу, кроме случаев, установленных законом.
5. Если законом установлены правовые последствия недобросовестного или неразумного осуществления лицом своего права, считается, что поведение лица является добросовестным и разумным, если другое не установлено судом.

Статья 13. Границы осуществления гражданских прав
1. Гражданские права лицо осуществляет в границах, предоставленных ему договором или актами гражданского законодательства.
2. При осуществлении своих прав лицо обязанно воздержаться от действий, которые могли бы нарушить права других лиц, нанести ущерб окружающей среде или культурному наследию.
3. Не допускаются действия лица, совершаемые с намерением нанести ущерб другому лицу, а также злоупотребление правом в других формах.
4. При осуществлении гражданских прав лицо должно придерживаться моральных основ общества.
5. Не допускается использование гражданских прав с целью неправомерного ограничения конкуренции, злоупотребления монопольным положением на рынке, а также недобросовестная конкуренция.
6. В случае несоблюдения лицом при осуществлении своих прав требований, установленных частями второй - пятой этой статьи, суд может обязать его прекратить злоупотребление своими правами, а также применить другие последствия, установленные законом.

Статья 14. Выполнение гражданских обязанностей
1. Гражданские обязанности выполняются в границах, установленных договором или актом гражданского законодательства.
2. Лицо не может быть принуждено к действиям, совершение которых не является для него обязательным.
3. Выполнение гражданских обязанностей обеспечивается средствами поощрения и ответственностью, которые установлены договором или актом гражданского законодательства.
4. Лицо может быть освобождено от гражданской обязанности или ее выполнения в случаях, установленных договором или актами гражданского законодательства. 
"""

GKU_g_3 = """
Глава 3 - Гражданского кодекса
Защита гражданских прав и интересов

Статья 15. Право на защиту гражданских прав и интересов
1. Каждое лицо имеет право на защиту своего гражданского права в случае его нарушения, непризнания или оспаривания.
2. Каждое лицо имеет право на защиту своего интереса, который не противоречит общим основам гражданского законодательства.

Статья 16. Защита гражданских прав и интересов в суде
1. Каждое лицо имеет право обратиться в суд за защитой своего личного неимущественного или имущественного права и интереса.
2. Способами защиты гражданских прав и интересов могут быть:
признание права;
признание сделки недействительной;
прекращение действия, которое нарушает право;
восстановление положения, которое существовало до нарушения;
принудительное выполнение обязанности в натуре;
изменение правоотношения;
прекращение правоотношения;
возмещение убытков и прочие способы возмещения имущественного ущерба;
возмещение морального (неимущественного) ущерба;
признание незаконными решения, действий или бездеятельности органа государственной власти, органа власти Автономной Республики Крым или органа местного самоуправления, их должностных и служебных лиц.
Суд может защитить гражданское право или интерес другим способом, установленным договором или законом или судом в определенных законом случаях.
3. Суд может отказать в защите гражданского права и интереса лица в случае нарушения им положений частей второй - пятой статьи 13 этого Кодекса.

Статья 17. Защита гражданских прав и интересов Президентом Украины, органами государственной власти, органами власти Автономной Республики Крым или органами местного самоуправления
1. Президент Украины осуществляет защиту гражданских прав и интересов в пределах полномочий, определенных Конституцией Украины
2. В случаях, установленных Конституцией Украины и законом, лицо имеет право обратиться за защитой гражданского права и интереса в орган государственной власти, орган власти Автономной Республики Крым или орган местного самоуправления.
3. Орган государственной власти, орган власти Автономной Республики Крым или орган местного самоуправления осуществляют защиту гражданских прав и интересов в пределах, на основаниях и способом, которые установлены Конституцией Украины и законом.
Решение, принятое указанными органами относительно защиты гражданских прав и интересов, не является препятствием для обращения за их защитой в суд.

Статья 18. Защита гражданских прав нотариусом
1. Нотариус осуществляет защиту гражданских прав путем совершения исполнительной надписи на долговом документе в случаях и в порядке, установленных законом.

Статья 19. Самозащита гражданских прав
1. Лицо имеет право на самозащиту своего гражданского права и права другого лица от нарушений и противоправных посягательств.
Самозащитой является применение лицом способов противодействий, которые не запрещены законом и не противоречат моральным принципам общества.
2. Способы самозащиты должны соответствовать содержанию нарушенного права, характеру действий, которыми оно нарушено, а также последствиями, которые вызваны этим нарушением.
Способы самозащиты могут выбираться самим лицом или устанавливаться договором или актами гражданского законодательства.

Статья 20. Осуществление права на защиту
1. Право на защиту лицо осуществляет на свое усмотрение.
2. Неосуществление лицом права на защиту не является основанием для прекращения затронутого гражданского права, кроме случаев, установленных законом.

Статья 21. Признание незаконным правового акта органа государственной власти, органа власти Автономной Республики Крым или органа местного самоуправления
1. Суд признает незаконным и отменяет правовой акт индивидуального действия, выданный органом государственной власти, органом власти Автономной Республики Крым или органом местного самоуправления, если он противоречит актам гражданского законодательства и нарушает гражданские права или интересы.
2. Суд признает незаконным и отменяет нормативно-правовой акт органа государственной власти, органа власти Автономной Республики Крым или органа местного самоуправления, если он противоречит актам гражданского законодательства и нарушает гражданские права или интересы.

Статья 22. Возмещение убытков и прочие способы возмещения имущественного ущерба
1. Лицо, которому причинен ущерб в результате нарушения его гражданского права, имеет право на его возмещение.
2. Ущербом является:
потери, которые лицо понесло в связи с уничтожением или повреждением вещи, а также затраты, которые лицо понесло или должно понести для восстановления своего нарушенного права (реальные убытки);
доходы, которые лицо могло бы реально получить при обычных обстоятельствах, если бы его право не было нарушено (упущенная выгода).
3. Убытки возмещаются в полном объеме, если договором или законом не предусмотрено возмещение в меньшем или в большем размере.
Если лицо, которое нарушило право, получило в связи с этим доходы, то размер упущенной выгоды, которая может возмещаться лицу, право которого нарушено, не может быть меньше доходов, полученных лицом, которое нарушило право.
4. По требованию лица, которому причинен вред, и в соответствии с обстоятельствами дела имущественный вред может быть возмещен и другим способом, в частности, ущерб, нанесенный имуществу, может возмещаться в натуре (передача вещи того же рода и того же качества, исправление поврежденной вещи и т.п.), если иное не установлено законом.

Статья 23. Возмещение морального ущерба
1. Лицо имеет право на возмещение морального ущерба, причиненного вследствие нарушения его прав.
2. Моральный ущерб состоит:
в физической боли и страданиях, которые физическое лицо испытывает всвязи с увечьем или другим повреждением здоровья;
в душевных страданиях, которые физическое лицо испытывает в связи с противоправным поведением относительно его самого, членов его семьи или близких родственников;
в душевных страданиях, которые физическое лицо испытало в связи с уничтожением или повреждением его имущества;
в унижении чести и достоинства физического лица, а также деловой репутации физического или юридического лица.
3. Если иное не установлено законом, моральный вред возмещается денежными средствами, другим имуществом или другим способом.
Размер денежного возмещения морального ущерба определяется судом в зависимости от характера правонарушения, глубины физических и душевных страданий, ухудшения способностей потерпевшего или лишение его возможности их реализации, степени вины лица, которое нанесло моральный ущерб, если вина является основанием для возмещения, а также с учетом других обстоятельств, которые имеют существенное значение. При определении размера возмещения учитываются требования разумности и справедливости.
4. Моральный ущерб возмещается независимо от имущественного ущерба, который подлежит возмещению, и не связан с размером этого возмещения.
5. Моральный ущерб возмещается единоразово, если другое не установлено договором или законом. 
"""

GKU_g_4 = """
Глава 4 - Гражданского кодекса
Общие положения о физическом лице

Статья 24. Понятие физического лица
1. Человек как участник гражданских отношений считается физическим лицом.

Статья 25. Гражданская правоспособность физического лица
1. Способность иметь гражданские права и обязанности (гражданскую правоспособность) имеют все физические лица.
2. Гражданская правоспособность физического лица возникает в момент его рождения.
В случаях, установленных законом, охраняются интересы зачатого, но еще не родившегося ребенка.
3. В случаях, установленных законом, способность иметь отдельные гражданские права и обязанности может связываться с достижением физическим лицом соответствующего возраста
4. Гражданская правоспособность физического лица прекращается в момент его смерти.

Статья 26. Объем гражданской правоспособности физического лица
1. Все физические лица равны в способности иметь гражданские права и обязанности.
2. Физическое лицо имеет все личные неимущественные права, установленные Конституцией Украины и этим Кодексом.
3. Физическое лицо способно иметь все имущественные права, установленные этим Кодексом, другим законом.
4. Физическое лицо способно иметь другие гражданские права, не установленные Конституцией Украины, этим Кодексом, другим законом, если они не противоречат законам и моральным устоям общества.
5. Физическое лицо способно иметь обязанности как участник гражданских отношений.

Статья 27. Предотвращение ограничения способности физического лица иметь гражданские права и обязанности
1. Сделка, ограничивающая возможность физического лица иметь не запрещенные законом гражданские права и обязанности, являются ничтожной.
2. Правовой акт Президента Украины, органа государственной власти, органа власти Автономной Республики Крым, органа местного самоуправления, их должностных и служебных лиц не может ограничивать возможность физического лица иметь не запрещенные законом гражданские права и обязанности, кроме случаев, когда такое ограничение предусмотрено Конституцией Украины.

Статья 28. Имя физического лица
1. Физическое лицо приобретает права и обязанности и осуществляет их под своим именем.
Имя физического лица, которое является гражданином Украины, состоит из фамилии, собственного имени и отчества, если другое не вытекает из закона или обычая национального меньшинства, к которому оно принадлежит.
2. При осуществлении отдельных гражданских прав физическое лицо в соответствии с законом может использовать псевдоним (выдуманное имя) или действовать без указания имени.
3. Имя физическому лицу предоставляется в соответствии с законом.

Статья 29. Место проживания физического лица
1. Местом жительства физического лица является жилье, в котором он проживает постоянно или временно.
2. Физическое лицо, достигшее четырнадцати лет, свободно выбирает себе место проживания, за исключением ограничений, которые устанавливаются законом.
3. Местом проживания физического лица в возрасте от десяти до четырнадцати лет является место жительства его родителей (усыновителей) или одного из них, с кем оно проживает, опекуна или место нахождения учебного заведения или учреждения здравоохранения и т.п., в котором оно проживает, если другое место жительства не установлено по согласию между ребенком и родителями (усыновителями, опекуном) или организацией, которая выполняет относительно него функции опекуна.
В случае спора место проживания физического лица в возрасте от десяти до четырнадцати лет определяется органом опеки и попечительства или судом.
4. Местом проживания физического лица, которое не достигло десяти лет, является место проживания его родителей (усыновителей) или одного из них, с кем оно проживает, опекуна или местонахождение учебного заведения или учреждения здравоохранения, в котором оно проживает.
5. Местожительством недееспособного лица является местожительство его опекуна или местонахождение соответствующей организации, которая выполняет относительно него функции опекуна.
6. Физическое лицо может иметь несколько мест проживания.

Статья 30. Гражданская дееспособность физического лица
1. Гражданскую дееспособность имеет физическое лицо, которое сознает значение своих действий и может руководить ими.
Гражданской дееспособностью физического лица является его способность своими действиями приобретать для себя гражданские права и самостоятельно их осуществлять, а также способность своими действиями создавать для себя гражданские обязанности, самостоятельно их выполнять и нести ответственность в случае их невыполнения.
2. Объем гражданской дееспособности физического лица устанавливается этим Кодексом и может быть ограничен исключительно в случаях и в порядке, установленных законом.

Статья 31. Частичная гражданская дееспособность физического лица, не достигшего четырнадцати лет
1. Физическое лицо, которое не достигло четырнадцати лет (малолетнее лицо), имеет право:
1) самостоятельно совершать мелкие бытовые сделки.
Сделка считается мелкой бытовой, если она удовлетворяет бытовые потребности лица, отвечает его физическому, духовному или социальному развитию и касается предмета, который имеет невысокую стоимость;
2) осуществлять личные неимущественные права в результате интеллектуальной, творческой деятельности, которые охраняются законом.
2. Малолетнее лицо не несет ответственности за причиненный им вред.

Статья 32. Неполная гражданская дееспособность физического лица в возрасте от четырнадцати до восемнадцати лет
1. Кроме сделок, предусмотренных статьей 31 этого Кодекса, физическое лицо в возрасте от четырнадцати до восемнадцати лет (несовершеннолетнее лицо) имеет право:
самостоятельно распоряжаться своим заработком, стипендией или другими доходами;
самостоятельно осуществлять права на результаты интеллектуальной, творческой деятельности, которые охраняются законом;
быть участником (основателем) юридических лиц, если это не запрещено законом или учредительными документами юридического лица;
самостоятельно заключать договор банковского вклада (счета) и распоряжаться вкладом, внесенным им на свое имя (денежными средствами на счету).
2. Несовершеннолетнее лицо совершает другие сделки по согласию родителей (усыновителей) или попечителей.
На совершение несовершеннолетним лицом cделки относительно транспортных средств или недвижимого имущества должно быть письменное нотариально удостоверенное согласие родителей (усыновителей) или попечителя и разрешение органа опеки и попечительства.
3. Несовершеннолетнее лицо может распоряжаться денежными средствами, которые внесены полностью или частично другими лицами в финансовое учреждение на его имя, с согласия органа опеки и попечительства и родителей (усыновителей) или попечителя.
4. Согласие на совершение несовершеннолетним лицом сделки должно быть получено от родителей (усыновителей) или попечителя и органа опеки и попечительства в соответствии с законом.
5. При наличии достаточных оснований суд по заявлению родителей (усыновителей), попечителя, органа опеки и попечительства может ограничить право несовершеннолетнего лица самостоятельно распоряжаться своим заработком, стипендией или другими доходами или лишить его этого права.
Суд отменяет свое решение об ограничении или лишении этого права, если исчезли обстоятельства, которые были основанием для его принятия.
6. Порядок ограничения гражданской дееспособности несовершеннолетнего лица устанавливается Гражданским процессуальным кодексом Украины.

Статья 33. Гражданская ответственность несовершеннолетнего лица
1. Несовершеннолетнее лицо лично несет ответственность за нарушение договора, заключенного им самостоятельно согласно закону.
2. Несовершеннолетнее лицо лично несет ответственность за нарушение договора, заключенного по согласию родителей (усыновителей), попечителя. Если у несовершеннолетнего лица недостаточно имущества для возмещения убытков, дополнительную ответственность несут его родители (усыновители) или попечитель.
3. Несовершеннолетнее лицо несет ответственность за вред, причиненный им другому лицу, согласно статье 1179 этого Кодекса.

Статья 34. Полная гражданская дееспособность
1. Полную гражданскую дееспособность имеет физическое лицо, которое достигло восемнадцати лет (совершеннолетие).
2. В случае регистрации брака физического лица, которое не достигло совершеннолетия, оно приобретает полную гражданскую дееспособность из момента регистрации брака.
В случае прекращения брака до достижения физическим лицом совершеннолетия, приобретенная им полная гражданская дееспособность сохраняется.
В случае признания брака недействительным на основаниях, не связанных с противоправным поведением несовершеннолетнего лица, приобретенная им полная гражданская дееспособность сохраняется.

Статья 35. Предоставление полной гражданской дееспособности
1. Полная гражданская дееспособность может быть предоставлена физическому лицу, которое достигло шестнадцати лет и работает по трудовому договору, а также несовершеннолетнему лицу, которое записано матерью или отцом ребенка.
2. Предоставление полной гражданской дееспособности происходит по решению органа опеки и попечительства по заявлению заинтересованного лица при письменном согласии родителей (усыновителей) или попечителя, а в случае отсутствия такого согласия полная гражданская дееспособность может быть предоставлена по решению суда.
3. Полная гражданская дееспособность может быть предоставлена физическому лицу, которое достигло шестнадцати лет и которое желает заниматься предпринимательской деятельностью.
При наличии письменного согласия на это родителей (усыновителей), опекуна или органа опеки и попечительства такое лицо может быть зарегистрировано как предприниматель. В этом случае физическое лицо приобретает полную гражданскую дееспособность с момента государственной регистрации его как предпринимателя.
4. Полная гражданская дееспособность, предоставленная физическому лицу, распространяется на все гражданские права и обязанности.
5. В случае прекращения трудового договора, прекращения физическим лицом предпринимательской деятельности предоставленная ему полная гражданская дееспособность сохраняется.

Статья 36. Ограничение гражданской дееспособности физического лица
1. Суд может ограничить гражданскую дееспособность физического лица, если оно страдает психическим расстройством, которое существенным образом влияет на его способность сознавать значение своих действий и (или) руководить ими.
2. Суд может ограничить гражданскую дееспособность физического лица, если оно злоупотребляет спиртными напитками, наркотическими средствами, токсичными веществами, азартными играми и т.д. и тем ставит себя или свою семью, а также других лиц, которых оно по закону обязано содержать, в тяжелое материальное положение.
3. Порядок ограничения гражданской дееспособности физического лица устанавливается Гражданским процессуальным кодексом Украины
4. Гражданская дееспособность физического лица является ограниченной из момента вступления в законную силу решения суда об этом.

Статья 37. Правовые последствия ограничения гражданской дееспособности физического лица
1. Над физическим лицом, гражданская дееспособность которого ограничена, устанавливается попечительство.
2. Физическое лицо, гражданская дееспособность которого ограничена, может самостоятельно совершать лишь мелкие бытовые сделки.
3. Сделки относительно распоряжения имуществом и прочие сделки, которые выходят за пределы мелких бытовых, совершаются лицом, гражданская дееспособность которого ограничена, по согласию попечителя.
Отказ опекуна дать согласие на совершение сделок, выходящих за пределы мелких бытовых, может быть обжалован лицом, гражданская дееспособность которого ограничена, в органе опеки и попечительства или в суде.
4. Получение заработка, пенсии, стипендии, других доходов лица, с ограниченной гражданской дееспособностью, и распоряжение ими осуществляются попечителем. Попечитель может письменно разрешить физическому лицу с ограниченной гражданской дееспособностью, самостоятельно получать заработок, пенсию, стипендию, другие доходы и распоряжаться ими.
5. Лицо с ограниченной гражданской дееспособностью, самостоятельно несет ответственность за нарушение им договора, заключенного с согласия попечителя, и за вред, который причинен им другому лицу.

Статья 38. Возобновление гражданской дееспособности физического лица с ограниченной гражданской дееспособностью
1. В случае выздоровления физического лица с ограниченной гражданской дееспособностью, или такого улучшения его психического состояния, которое восстановило в полном объеме его способность осознавать значение своих действий и (или) руководить ими, суд возобновляет его гражданскую дееспособность.
2. В случае прекращения физическим лицом злоупотребления спиртными напитками, наркотическими средствами, токсичными веществами, азартными играми и т.п. суд возобновляет его гражданскую дееспособность.
3. Попечительство, установленное над физическим лицом, прекращается на основании решения суда о возобновлении гражданской дееспособности.
4. Порядок возобновления гражданской дееспособности физического лица с ограниченной гражданской дееспособностью, устанавливается Гражданским процессуальным кодексом Украины.

Статья 39. Признание физического лица недееспособным
1. Физическое лицо может быть признано судом недееспособным, если оно вследствие хронического, стойкого психического расстройства не способно осознавать значение своих действий и (или) руководить ими.
2. Порядок признания физического лица недееспособным устанавливается Гражданским процессуальным кодексом Украины
3. Если суд откажет в удовлетворении заявления о признании лица недееспособным и будет установлено, что требование было заявлено недобросовестно без достаточного для этого основания, физическое лицо, которому такими действиями был причинен моральный ущерб, имеет право требовать от заявителя его возмещения.

Статья 40. Момент признания физического лица недееспособным
1. Физическое лицо признается недееспособным с момента вступления в законную силу решения суда об этом.
2. Если от времени возникновения недееспособности зависит признание недействительным брака, договора или другой сделки, суд с учетом вывода судебно-психиатрической экспертизы и других доказательств относительно психического состояния лица может определить в своем решении день, с которого оно признается недееспособным.

Статья 41. Правовые последствия признания физического лица недееспособным
1. Над недееспособным физическим лицом устанавливается опека.
2. Недееспособное физическое лицо не имеет права совершать любые сделки
3. Сделки от имени недееспособного физического лица и в его интересах совершает его опекун.
4. Ответственность за вред, причиненный недееспособным физическим лицом, несет его опекун (статья 1184 этого Кодекса).

Статья 42. Возобновление гражданской дееспособности физического лица, признанного недееспособным
1. По заявлению опекуна или органа опеки и попечительства суд возобновляет гражданскую дееспособность физического лица, которое было признано недееспособным, и прекращает опеку, если будет установлено, что вследствие выздоровления или значительного улучшения его психического состояния у него возобновилась способность осознавать значение своих действий и управлять ими.
2. Порядок восстановления гражданской дееспособности физического лица, которое было признано недееспособным, устанавливается Гражданским процессуальным кодексом Украины.

Статья 43. Признание физического лица безвестно отсутствующим
1. Физическое лицо может быть признано судом безвестно отсутствующим, если на протяжении одного года в месте его постоянного проживания нет сведений о месте его пребывания.
2. В случае невозможности установить день получения последних сведений о месте пребывания лица, началом его безвестного отсутствия считается первое число месяца, который идет за тем, в котором были получены такие сведения, а в случае невозможности установить этот месяц - первое января следующего года.
3. Порядок признания физического лица безвестно отсутствующим устанавливается Гражданским процессуальным кодексом Украины

Статья 44. Опека над имуществом физического лица, признанного безвестно отсутствующим, а также лица, пропавшего без вести
1. На основании решения суда о признании физического лица безвестно отсутствующим нотариус по последнему месту его проживания описывает принадлежащее ему имущество и устанавливает над ним опеку.
2. По заявлению заинтересованного лица или органа опеки и попечительства над имуществом лица, пропавшего без вести, опека может быть установлена нотариусом до принятия судом решения о признании его безвестно отсутствующим.
3. Опекун над имуществом физического лица, признанного безвестно отсутствующим, или лица, пропавшего без вести, принимает исполнение гражданских обязанностей в его пользу, погашает за счет его имущества долги, управляет этим имуществом в ее интересах.
4. По заявлению заинтересованного лица опекун над имуществом физического лица, признанного безвестно отсутствующим, или лица, пропавшего без вести, предоставляет за счет этого имущества содержание лицам, которых они по закону обязаны содержать.
5. Опека над имуществом прекращается в случае отмены решения суда о признании физического лица безвестно отсутствующим, а также в случае появления лица, пропавшего без вести.

Статья 45. Отмена решения суда о признании физического лица безвестно отсутствующим
1. Если физическое лицо, признанное безвестно отсутствующим, объявилось или если получены сведения о месте его пребывания, суд по месту его пребывания или суд, который постановил решения о признании этого лица безвестно отсутствующим, по заявлению этого лица или другого заинтересованного лица отменяет решение о признании физического лица безвестно отсутствующим.

Статья 46. Объявление физического лица умершим
1. Физическое лицо может быть объявлено судом умершим, если на месте его постоянного проживания нет сведений о месте его пребывания в течение трех лет, а если оно пропало без вести при обстоятельствах, угрожавших ему смертью или дающих основание предполагать его гибель от определенного несчастного случая, - в течение шести месяцев, а при возможности считать физическое лицо погибшим от определенного несчастного случая или других обстоятельств вследствие чрезвычайных ситуаций техногенного и природного характера - втечение одного месяца после завершения работы специальной комиссии, созданной в результате чрезвычайных ситуаций техногенного и природного характера.
2. Физическое лицо, пропала без вести в связи с военными действиями, вооруженным конфликтом, может быть объявлен судом умершим по истечении двух лет со дня окончания военных действий. С учетом конкретных обстоятельств дела суд может объявить физическое лицо умершим и до истечения этого срока, но не ранее истечения шести месяцев.
3. Физическое лицо объявляется умершим со дня вступления в законную силу решения суда об этом. Физическое лицо, пропала без вести при обстоятельствах, угрожавших ему смертью или дающих основания предполагать его гибель от определенного несчастного случая или в связи с военными действиями, вооруженным конфликтом, может быть объявлено умершим со дня его возможной смерти.
4. Порядок объявления физического лица умершим устанавливается Гражданским процессуальным кодексом Украины.

Статья 47. Правовые последствия объявления физического лица умершим
1. Правовые последствия объявления физического лица умершим приравниваются к правовым последствиям, которые наступают в случае смерти.
2. Наследники физического лица, объявленного умершим, не имеют права отчуждать на протяжении пяти лет недвижимое имущество, которое перешло к ним в связи с открытием наследства.
Нотариус, который выдал наследнику свидетельство о праве на наследство на недвижимое имущество, накладывает на него запрет отчуждения.

Статья 48. Правовые последствия появления физического лица, которое было объявлено умершим
1. Если физическое лицо, объявленное умершим, объявилось или если получены сведения о месте его пребывания, суд по месту пребывания этого лица или суд, который постановил решение об объявлении его умершим, по заявлению этого лица или другого заинтересованного лица отменяет решение суда об объявлении физического лица умершим.
2. Независимо от времени своего появления физическое лицо, объявленное умершим, имеет право требовать от лица, которое владеет его имуществом, возвращения этого имущества, если оно сохранилось и безвозмездно перешло к нему после объявления физического лица умершим, за исключением имущества, приобретенного по исковой давности, а также денег и ценных бумаг на предъявителя.
3. Лицо, к которому имущество перешло по оплатному договору, обязано возвратить его, если будет установлено, что на момент приобретения этого имущества оно знало, что физическое лицо, которое было объявлено умершим, живо.
В случае невозможности возвратить имущество в натуре лицу, которое было объявлено умершим, возмещается стоимость этого имущества.
4. Если имущество физического лица, которое было объявлено умершим и появилось, перешло в собственность государства, Автономной Республики Крым или территориальной общины и было реализовано им, этому лицу возвращается сумма, полученная от реализации этого имущества

Статья 49. Акты гражданского состояния
1. Актами гражданского состояния являются события и действия, которые неразрывно связаны с физическим лицом и начинают, изменяют, дополняют или прекращают его возможность быть субъектом гражданских прав и обязанностей.
2. Актами гражданского состояния являются рождение физического лица, установление его происхождения, обретение гражданства, выход из гражданства и его утрата, достижение соответствующего возраста, предоставление полной гражданской дееспособности, ограничение гражданской дееспособности, признание лица недееспособным, брак, расторжение брака, усыновление, лишение и возобновление родительских прав, изменение имени, инвалидность, смерть и т.п..
3. Государственной регистрации подлежат рождение физического лица и его происхождение, гражданство, брак, расторжение брака в случаях, предусмотренных законом, изменение имени, смерть.
4. Регистрация актов гражданского состояния производится в соответствии с законом.
Рождение физического лица и его происхождение, усыновление, лишение и восстановление родительских прав, брак, расторжение брака, изменение имени, смерть подлежат обязательному внесению в Государственный реестр актов гражданского состояния граждан в органах юстиции в порядке, определенном Кабинетом Министров Украины.
"""

GKU_g_5 = """
Глава 5 - Гражданского кодекса
Физическое лицо - предприниматель

Статья 50. Право физического лица на осуществление предпринимательской деятельности
1. Право на осуществление предпринимательской деятельности, которая не запрещена законом, имеет физическое лицо с полной гражданской дееспособностью.
Ограничения права физического лица на осуществление предпринимательской деятельности устанавливаются Конституцией Украины и законом.
2. Физическое лицо осуществляет свое право на предпринимательскую деятельность при условии его государственной регистрации в порядке, установленном законом.
Информация о государственной регистрации физических лиц - предпринимателей является открытой.
3. Если лицо начало предпринимательскую деятельность без государственной регистрации, заключив соответствующие договора, оно не имеет права оспаривать эти договора на том основании, что оно не является предпринимателем.

Статья 50-1. Обязанности физического лица - предпринимателя по обязательствам, связанным с прекращением его предпринимательской деятельности
1. Физическое лицо - предприниматель письменно уведомляет государственного администратора, кредиторов о принятом решении о прекращении его предпринимательской деятельности, порядок и срок заявления кредиторами своих требований, который не может составлять менее двух и более трех
месяцев со дня опубликования сообщения о принятии физическим лицом - предпринимателем решения о прекращении предпринимательской деятельности.
2. После внесения записи о принятии решения о прекращении предпринимательской деятельности физического лица - предпринимателя в Единый государственный реестр юридических лиц и физических лиц - предпринимателей уведомление о внесении записи в Единый государственный реестр юридических лиц и физических лиц - предпринимателей относительно решения физического лица - предпринимателя о прекращении им предпринимательской деятельности публикуется в специализированном печатном средстве массовой информации.
3. Каждое требование кредитора, в частности по уплате налогов, сборов, единого взноса на общеобязательное государственное социальное страхование, страховых средств в Пенсионный фонд Украины, фонды социального страхования, рассматривается физическим лицом - предпринимателем, после чего принимается соответствующее решение, которое направляется кредитору не позднее пятнадцати дней со дня получения физическим лицом - предпринимателем соответствующего требования кредитора.
4. Требования кредиторов, не признанные физическим лицом - предпринимателем, деятельность которого прекращается, если кредитор в месячный срок со дня получения уведомления о полном или
частичном отказе в признании его требований не обращался в суд с иском, и требования, в удовлетворении которых по решению суда кредитору отказано, а также требования, не удовлетворенные из-за отсутствия имущества, считаются погашенными.
В случае прекращения предпринимательской деятельности физического лица - предпринимателя требования его кредиторов удовлетворяются в следующей очередности:
1) в первую очередь удовлетворяются требования по возмещению вреда, причиненного увечьем, другим повреждением здоровья или смертью, и требования кредиторов, обеспеченные залогом или иным способом;
2) во вторую очередь удовлетворяются требования наемных работников, связанные с трудовыми отношениями, требования автора о плате за использование результата его интеллектуальной, творческой деятельности;
3) в третью очередь удовлетворяются требования по налогам, сборам (обязательным платежам), единого взноса на общеобязательное государственное социальное страхование, страховых средств в Пенсионный фонд Украины, фондов социального страхования, других сумм, связанных с такими обязательствами;
4) в четвертую очередь удовлетворяются все остальные требования.
Требования одной очереди удовлетворяются пропорционально сумме требований каждого кредитора этой очереди.
5. Предпринимательская деятельность физического лица - предпринимателя является прекращенной с даты внесения в Единый государственный реестр юридических лиц и физических лиц - предпринимателей записи о государственной регистрации прекращения такой деятельности.

Статья 51. Применение к предпринимательской деятельности физического лица нормативно-правовых актов, которые регулируют предпринимательскую деятельность юридических лиц
1. К предпринимательской деятельности физических лиц применяются нормативно-правовые акты, которые регулируют предпринимательскую деятельность юридических лиц, если другое не установлено законом или не вытекает из сути отношений.

Статья 52. Гражданско-правовая ответственность физического лица- предпринимателя
1. Физическое лицо - предприниматель отвечает по обязательствам, связанными с предпринимательской деятельностью, всем своим имуществом, кроме имущества, на которое согласно закона не может быть обращено взыскание.
2. Физическое лицо - предприниматель, которое находится в браке, отвечает по обязательствам, связанными с предпринимательской деятельностью, всем своим личным имуществом и долей в праве общей совместной собственности супругов, которая будет принадлежать ему при разделе этого имущества

Статья 53. Банкротство физического лица - предпринимателя
1. Физическое лицо, которое не в состоянии удовлетворить требования кредиторов, связанные с осуществлением им предпринимательской деятельности, может быть признано банкротом в порядке, установленном законом.

Статья 54. Управление имуществом, которое используется в предпринимательской деятельности, органом опеки и попечительства
1. Если физическое лицо - предприниматель признано безвестно отсутствующим, недееспособным или его гражданская дееспособность ограничена или если владельцем имущества, которое использовалось в предпринимательской деятельности, является несовершеннолетнее или малолетнее лицо, орган опеки и попечительства может назначить управителя этим имуществом.
Орган опеки и попечительства заключает с управителем договор об управлении этим имуществом.
2. При осуществлении полномочий относительно управления имуществом управитель действует от своего имени в интересах лица, которое является владельцем имущества.
3. В договоре об управлении имуществом устанавливаются права и обязанности управителя.
Орган опеки и попечительства осуществляет контроль за деятельностью управителя имуществом согласно правилам о контроле за деятельностью опекуна и попечителя.
4. Договор об управлении имуществом прекращается, если исчезли обстоятельства, на основании которых он был заключен.
"""

GKU_g_6 = """ 
Глава 6 - Гражданского кодекса
Опека и попечительство

Статья 55. Задачи опеки и попечительства
1. Опека и попечительство устанавливаются с целью обеспечения личных неимущественных и имущественных прав и интересов малолетних, несовершеннолетних лиц, а также совершеннолетних лиц, которые по состоянию здоровья не могут самостоятельно осуществлять свои права и исполнять обязанности.

Статья 56. Орган опеки и попечительства
1. Органами опеки и попечительства являются районные, районные в городах Киеве и Севастополе государственные администрации, исполнительные органы городских, районных в городах, сельских, поселковых советов.
2. Права и обязанности органов, на которые возложено осуществление опеки и попечительства, относительно обеспечения прав и интересов физических лиц, нуждающихся в опеке и попечительстве, устанавливаются законом и иными нормативными правовыми актами

Статья 57. Обязанность сообщать о физических лицах, которые нуждаются в опеке или попечительстве
1. Лицо, которому стало известно о физическом лице, которое нуждается в опеке или попечительстве, обязано немедленно сообщить об этом орган опеки и попечительства.

Статья 58. Физические лица, над которыми устанавливается опека
1. Опека устанавливается над малолетними лицами, которые являются сиротами или лишены родительской опеки, и физическими лицами, которые признаны недееспособными.

Статья 59. Физические лица, над которыми устанавливается попечительство
1. Попечительство устанавливается над несовершеннолетними лицами, которые являются сиротами или лишены родительской опеки, и физическими лицами, гражданская дееспособность которых ограничена.

Статья 60. Установление опеки и попечительства судом
1. Суд устанавливает опеку над физическим лицом в случае признания его недееспособным и назначает опекуна по представлению органа опеки и попечительства.
2. Суд устанавливает попечительство над физическим лицом в случае ограничения его гражданской дееспособности и назначает попечителя по представлению органа опеки и попечительства.
3. Суд устанавливает опеку над несовершеннолетним лицом, если при рассмотрении дела будет установлено, что оно лишено родительской заботы, и назначает опекуна по представлению органа опеки и попечительства.
4. Суд устанавливает попечительства над несовершеннолетним лицом, если при рассмотрении дела будет установлено, что она лишена родительского попечения, и назначает опекуна по представлению органа опеки и попечительства.

Статья 61. Установление опеки и попечительства органом опеки и попечительства
1. Орган опеки и попечительства устанавливает опеку над малолетним лицом и попечительство над несовершеннолетним лицом, кроме случаев, установленных частями первой и второй статьи 60 Гражданского кодекса Украины.

Статья 62. Место установления опеки или попечительства
1. Опека или попечительство устанавливаются по месту проживания физического лица, которое нуждается в опеке или попечительстве, или по месту проживания опекуна или попечителя.

Статья 63. Назначение опекуна или попечителя
1. Опекуна или попечителя назначает орган опеки или попечительства , кроме случаев, установленных статьей 60 настоящего Кодекса.
2. Опекуном или попечителем может быть только физическое лицо с полной гражданской дееспособностью.
3. Физическое лицо может быть назначено опекуном или попечителем только по его письменному заявлению.
4. Опекун или попечитель назначаются преимущественно из лиц, которые находятся в семейных, родственных отношениях с подопечным, с учетом личных отношений между ними, возможности лица исполнять обязанности опекуна или попечителя.
При назначении опекуна для малолетнего лица и при назначении попечителя для несовершеннолетнего лица учитывается желание подопечного.
5. Физическому лицу может быть назначен один или несколько опекунов или попечителей.

Статья 64. Физическое лицо, которое не может быть опекуном или попечителем
1. Опекуном или попечителем не может быть физическое лицо:
которое лишено родительских прав, если эти права не были возобновлены;
поведение и интересы которого противоречат интересам физического лица, которое нуждается в опеке или попечительстве.

Статья 65. Опека или попечительство над физическим лицом, относительно которого не назначен опекун или попечитель
1. До установления опеки или попечительства и назначения опекуна или попечителя, опеку или попечительство над физическим лицом осуществляет соответствующий орган опеки и попечительства.

Статья 66. Опека или попечительство над физическим лицом, которое находится в специальном учреждении
1. Если над физическим лицом, которое находится в учебном заведении, учреждении здравоохранения или учреждении социальной защиты населения, не установлена опека или попечительство или не назначен опекун или попечитель, опеку или попечительство над ним осуществляет это учреждение.

Статья 67. Права и обязанности опекуна
1. Опекун обязан заботиться о подопечном, о создании ему необходимых бытовых условий, обеспечении его уходом и лечением.
Опекун малолетнего лица обязан заботиться о его воспитании, обучении и развитии.
2. Опекун имеет право требовать возвращения подопечного от лиц, которые удерживают его без законного основания.
3. Опекун совершает сделки от имени и в интересах подопечного.
4. Опекун обязан принимать меры относительно защиты гражданских прав и интересов подопечного.

Статья 68. Сделки, которые не может совершать опекун
1. Опекун, его жена, муж и близкие родственники (родители, дети, братья, сестры) не могут заключать с подопечным договоров, кроме передачи имущества подопечному в собственность по договору дарения или в безвозмездное пользование по договору займа.
2. Опекун не может осуществлять дарение от лица подопечного, а также обязываться от его имени поручительством.

Статья 69. Права и обязанности попечителя
1. Попечитель над несовершеннолетним лицом обязан заботиться о создании для него необходимых бытовых условий, о его воспитании, обучении и развитии.
Попечитель над физическим лицом, с ограниченной гражданской дееспособностью, обязан заботиться о его лечении, создании необходимых бытовых условий.
2. Попечитель дает согласие на совершение подопечным правовых действий согласно статьям 32 и 37 Гражданского кодекса Украины.
3. Попечитель обязан принимать меры относительно защиты гражданских прав и интересов подопечного.

Статья 70. Сделки, на совершение которых попечитель не может давать согласие
1. Попечитель не может давать согласие на заключение договоров между подопечным и своей женой (своим мужем) или своими близкими родственниками, кроме передачи имущества подопечному в собственность по договору дарения или в безвозмездное пользование на основании договора займа.

Статья 71. Сделки, которые совершаются с разрешения органа опеки и попечительства
1. Опекун не имеет права без разрешения органа опеки и попечительства: 
отказаться от имущественных прав подопечного;
выдавать письменные обязательства от лица подопечного;
заключать договора, которые подлежат нотариальному удостоверению и (или) государственной регистрации, в том числе договора относительно раздела или обмена жилого дома, квартиры;
заключать договора относительно другого ценного имущества.
2. Попечитель имеет право давать согласие на совершение сделок, предусмотренных частью первой этой статьи, только с разрешения органа опеки и попечительства.

Статья 72. Управление имуществом лица, над которым установлена опека
1. Опекун обязан заботиться о сохранении и использовании имущества подопечного в его интересах.
2. Если малолетнее лицо может самостоятельно определить свои нужды и интересы, опекун, осуществляя управление его имуществом, должен учитывать его желания.
3. Опекун самостоятельно осуществляет расходы, необходимые для удовлетворения потребностей подопечного, за счет пенсии, алиментов, возмещения ущерба в связи с потерей кормильца, помощи на подопечного ребенка и других социальных выплат, предназначенных на подопечного ребенка в соответствии с законами Украины, доходов от имущества подопечного и т.д.
4. Если подопечный является владельцем недвижимости или имущества, которое нуждается в постоянном управлении, опекун может с разрешения органа опеки и попечительства управлять этим имуществом или передать его по договору в управление другому лицу.

Статья 73. Право опекуна и попечителя на оплату за выполнение ими своих обязанностей
1. Основания возникновения права на оплату услуг опекуна и попечителя, их размер и порядок выплаты устанавливаются Кабинетом Министров Украины.

Статья 74. Опека над имуществом
1. Если у лица, над которым установлены опека или попечительство, есть имущество, которое находится в другой местности, опека над этим имуществом устанавливается органом опеки и попечительства по местонахождению имущества.
Опека над имуществом устанавливается также в других случаях, установленных законом.

Статья 75. Увольнение опекуна и попечителя
1. Суд, если он назначил опекуна или попечителя, либо орган опеки и попечительства по заявлению лица освобождает его от полномочий опекуна или попечителя. Это заявление рассматривается судом или органом опеки и попечительства в течение одного месяца.
Лицо выполняет полномочия опекуна или попечителя до вынесения решения об освобождении его от полномочий опекуна или попечителя или до окончания месячного срока со дня подачи заявления, если оно не было рассмотрено в течение этого срока.
2. Суд, если он назначил попечителя, или орган опеки и попечительства может освободить попечителя от его полномочий по заявлению лица, над которым установлено попечительство.
3. По заявлению органа опеки и попечительства суд может освободить лицо от полномочий опекуна или попечителя в случае невыполнения им своих обязанностей, нарушения прав подопечного, а также в случае помещения подопечного в учебное заведение, учреждение охраны здоровья или учреждение социальной защиты.

Статья 76. Прекращение опеки
1. Опека прекращается в случае передачи малолетнего лица родителям (усыновителям).
2. Опека прекращается в случае достижения подопечным четырнадцати лет. В этом случае лицо, которое осуществляло обязанности опекуна, становится попечителем без специального решения относительно этого.
3. Опека прекращается в случае возобновления гражданской дееспособности физического лица, которое было признано недееспособным.

Статья 77. Прекращение попечительства
1. Попечительство прекращается в случае:
достижения физическим лицом совершеннолетия;
регистрации брака несовершеннолетнего лица;
предоставления несовершеннолетнему лицу полной гражданской дееспособности;
возобновления гражданской дееспособности физического лица, гражданская дееспособность которого была ограничена.

Статья 78. Предоставление дееспособному физическому лицу помощи в осуществлении его прав и выполнении обязанностей
1. Дееспособное физическое лицо, которое по состоянию здоровья не может самостоятельно осуществлять свои права и исполнять обязанности, имеет право избрать себе помощника.
Помощником может быть дееспособное физическое лицо.
По заявлению лица, которое нуждается в помощи, имя его помощника регистрируется органом опеки и попечительства, что подтверждается соответствующим документом.
2. Помощник имеет право на получение пенсии, алиментов, заработной платы, почтовой корреспонденции, которые принадлежат физическому лицу, которое нуждается в помощи.
3. Помощник имеет право совершать мелкие бытовые сделки в интересах лица, которое нуждается в помощи, согласно предоставленным ему полномочиям.
4. Помощник представляет лицо в органах государственной власти, органах власти Автономной Республики Крым, органах местного самоуправления и организациях, деятельность которых связана с обслуживанием населения.
Помощник может представлять физическое лицо в суде лишь на основании отдельной доверенности.
5. Услуги помощника являются оплатными, если другое не определено договоренностями сторон.
6. Помощник может быть в любое время отозван лицом, которое нуждалось в помощи. В этом случае полномочия помощника прекращаются.

Статья 79. Обжалование действий опекуна, решений органа опеки и попечительства
1. Действия опекуна могут быть обжалованы заинтересованным лицом, в том числе родственниками подопечного, в органах опеки и попечительства или в суде.
2. Решение органа опеки и попечительства может быть обжаловано в соответствующем органе, которому подчинен орган опеки и попечительства, или в суде.
"""

GKU_g_7 = """ 
Глава 7 - Гражданского кодекса
Общие положения о юридическом лице

Статья 80. Понятие юридического лица
1. Юридическим лицом является организация, созданная и зарегистрированная в установленном законом порядке.
Юридическое лицо наделяется гражданской правоспособностью и дееспособностью, может быть истцом и ответчиком в суде.

Статья 81. Виды юридических лиц
1. Юридическое лицо может быть создано путем объединения лиц и (или) имущества.
2. Юридические лица, в зависимости от порядка их создания, делятся на юридические лица частного права и юридические лица публичного права.
Юридическое лицо частного права создается на основании учредительных документов согласно статье 87 Гражданского кодекса Украины.
Юридическое лицо публичного права создается распорядительным актом Президента Украины, органа государственной власти, органа власти Автономной Республики Крым или органа местного самоуправления.
3. Этим Кодексом устанавливаются порядок создания, организационно-правовой формы, правовой статус юридических лиц частного права.
Порядок образования и правовой статус юридических лиц публичного права устанавливаются Конституцией Украины и законом.
4. Юридическое лицо может быть создано путем принудительного деления (выделения) в случаях, установленных законом.

Статья 82. Участие юридических лиц публичного права в гражданских отношениях
1. На юридические лица публичного права в гражданских отношениях распространяются положения Гражданского кодекса Украины, если другое не установлено законом.

Статья 83. Организационно-правовые формы юридических лиц
1. Юридические лица могут создаваться в форме обществ, учреждений и в других формах, установленных законом.
2. Обществом является организация, созданная путем объединения лиц (участников), которые имеют право участия в этом обществе. Общество может быть создано одним лицом, если другое не установлено законом.
Общества делятся на предпринимательские и непредпринимательские.
3. Учреждением является организация, созданная одним или несколькими лицами (основателями), которые не берут участия в управлении ею, путем объединения (выделения) их имущества для достижения цели, определенной основателями, за счет этого имущества.
Особенности правового статуса отдельных видов учреждений устанавливаются законом.
4. Положения этой главы применяются ко всем обществам и учреждениям, если другие правила для отдельных видов обществ или учреждений не установлены законом.

Статья 84. Предпринимательские общества
1. Общества, которые осуществляют предпринимательскую деятельность с целью получения прибыли и последующего ее распределения между участниками (предпринимательские общества), могут быть созданы лишь как хозяйственные общества (полное общество, коммандитное общество, общество с ограниченной или дополнительной ответственностью, акционерное общество) или производственные кооперативы.

Статья 85. Непредпринимательские общества
1. Непредпринимательскими обществами являются общества, которые не имеют целью получение прибыли для ее последующего распределения между участниками.
2. Особенности правового статуса отдельных видов непредпринимательских обществ устанавливаются законом.

Статья 86. Осуществление предпринимательской деятельности непредпринимательскими обществами и учреждениями
1. Непредпринимательские общества (кооперативы, кроме производственных, объединения граждан и т.п.) и учреждения могут наряду со своей основной деятельностью осуществлять предпринимательскую деятельность, если иное не установлено законом и если эта деятельность соответствует цели, для которой они были созданы, и способствует ее достижению.

Статья 87. Создание юридического лица
1. Для создания юридического лица его участники (основатели) разрабатывают учредительные документы, которые составляются в письменном виде и подписываются всеми участниками (основателями), если законом не установлен другой порядок их утверждения.
Юридическое лицо частного права может создаваться и действовать на основании модельного устава, утвержденного Кабинетом Министров Украины, который после его принятия участниками становится учредительным документом.
Основатели (участники) юридического лица, образованного на основании модельного устава, могут в установленном законом порядке утвердить устав, который является уставным документом, и осуществлять деятельность на его основании
2. Учредительным документом общества является утвержденный участниками Устав или учредительский договор между участниками, если другое не установлено законом.
Общество, созданное одним лицом, действует на основании устава, утвержденного этим лицом.
3. Учреждение создается на основании индивидуального или общего учредительного акта, составленного основателем (основателями). Учредительный акт может содержаться также и в завещании. До создания учреждения учредительный акт, составленный одним или несколькими лицами, может быть упразднен основателем (основателями).
4. Юридическое лицо считается созданным со дня его государственной регистрации.

Статья 88. Требования к содержанию учредительных документов
1. В уставе общества указываются наименование юридического лица, органы управления обществом, их компетенция, порядок принятия ими решений, порядок вступления в общество и выхода из него, если дополнительные требования к содержанию устава не установлены настоящим Кодексом или другим законом.
2. В учредительном договоре общества определяются обязательства участников создать общество, порядок их совместной деятельности по его созданию, условия передачи обществу имущества участников, если дополнительные требования к содержанию учредительного договора не установлены настоящим Кодексом или другим законом.
3. В учредительном акте учреждения указывается его цель, определяются имущество, которое передается учреждению, необходимое для достижения этой цели, структура управления учреждением. Если в учредительном акте, который содержится в завещании, отсутствуют отдельные из вышеупомянутых положений, их устанавливает орган, осуществляющий государственную регистрацию.

Статья 89. Государственная регистрация юридического лица
1. Юридическое лицо подлежит государственной регистрации в порядке, установленном законом. Данные государственной регистрации включаются в единый государственный реестр, открытый для общего ознакомления.
2. Основания для отказа в проведении государственной регистрации юридического лица устанавливаются законом. Отказ в проведении государственной регистрации юридического лица по другим основаниям, чем установленные законом, не допускается.
3. Отказ в государственной регистрации, а также промедление с ее осуществлением могут быть обжалованы в суде.
4. В единый государственный реестр вносятся сведения об организационно-правовой форме юридического лица, его наименование, местонахождение, органы управления, филиалы и представительства, цель учреждения, а также другие сведения, установленные законом.
5. Изменения в учредительных документах юридического лица, которые касаются ведомостей, включенных в единый государственный реестр, вступают в силу для третьих лиц со дня их государственной регистрации. Юридические лица и их участники не имеют права ссылаться на отсутствие государственной регистрации таких изменений в отношениях с третьими лицами, которые действовали с учетом этих изменений.

Статья 90. Наименование юридического лица
1. Юридическое лицо должно иметь свое наименование, которое содержит информацию про его организационно-правовую форму и название.
Наименование учреждения должно содержать информацию о характере его деятельности.
Юридическое лицо может иметь кроме полного наименования сокращенное наименование.
2. Юридическое лицо, которое является предпринимательским обществом, может иметь коммерческое (фирменное) наименование.
Коммерческое (фирменное) наименование юридического лица может быть зарегистрировано в порядке, установленном законом.
3. Наименование юридического лица указывается в его учредительных документах и вносится в единый государственный реестр.
4. В случае изменения своего наименования юридическое лицо кроме выполнения других требований, установленных законом, обязано поместить объявления об этом в печатных средствах массовой информации, в которых публикуются ведомости о государственной регистрации юридического лица, и сообщить об этом всем лицам, с которыми оно находится в договорных отношениях - часть 4 исключена 26.11.2015
5. Юридическое лицо не имеет права использовать наименование другого юридического лица.

Статья 91. Гражданская правоспособность юридического лица
1. Юридическое лицо способно иметь такие же гражданские права и обязанности (гражданскую правоспособность), как и физическое лицо, кроме тех, которые по своей природе могут принадлежать лишь человеку.
2. Гражданская правоспособность юридического лица может быть ограничена лишь по решению суда.
3. Юридическое лицо может осуществлять отдельные виды деятельности, перечень которых устанавливается законом, после получения им специального разрешения (лицензии).
4. Гражданская правоспособность юридического лица возникает с момента его создания и прекращается со дня внесения в единый государственный реестр записи о его прекращении.

Статья 92. Гражданская дееспособность юридического лица
1. Юридическое лицо приобретает гражданские права и обязанности и осуществляет их через свои органы, которые действуют в соответствии с учредительными документами и законом.
Порядок создания органов юридического лица устанавливается учредительными документами и законом.
2. В случаях, установленных законом, юридическое лицо может приобретать гражданские права и обязанности и осуществлять их через своих участников.
3. Орган или лицо, которое согласно учредительным документам юридического лица или закона выступает от его имени, обязано действовать в интересах юридического лица, добросовестно и разумно и не превышать своих полномочий.
В отношениях с третьими лицами ограничения полномочий относительно представительства юридического лица не имеет юридической силы, кроме случаев, если юридическое лицо докажет, что третье лицо знало или при любых обстоятельствах не могло не знать о таких ограничениях.
4. Если члены органа юридического лица и прочие лица, которые согласно закона или учредительных документов выступают от имени юридического лица, нарушают свои обязанности относительно представительства, они несут солидарную ответственность за убытки, причиненные ими юридическому лицу.

Статья 93. Местонахождение юридического лица
1. Местонахождением юридического лица является фактическое место ведения деятельности или размещения офиса, из которого проводится ежедневное управление деятельностью юридического лица (где преимущественно находится руководство) и осуществление управления и учета

Статья 94. Личные неимущественные права юридического лица
1. Юридическое лицо имеет право на неприкосновенность его деловой репутации, на тайну корреспонденции, на информацию и прочие личные неимущественные права, которые могут ему принадлежать.
Личные неимущественные права юридического лица охраняются в соответствии с главой 3 Гражданского кодекса Украины.
2. Защита личных неимущественных прав юридического лица в связи с заведомо ложным сообщением или непреднамеренным сообщением недостоверной информации относительно его уполномоченного (должностного или служебного) лица о возможных фактах коррупционных или связанных с коррупцией правонарушений, других нарушений Закона Украины "О предупреждении коррупции" в порядке, предусмотренном настоящим Законом, осуществляется в том же объеме, что и личные неимущественные права физических лиц.

Статья 95. Филиалы и представительства
1. Филиалом является отдельное подразделение юридического лица, которое расположено вне его местонахождения и осуществляет все или часть его функций.
2. Представительством является отдельное подразделение юридического лица, которое расположено вне его местонахождения и осуществляет представительство и защиту интересов юридического лица.
3. Филиалы и представительства не являются юридическими лицами. Они наделяются имуществом юридического лица, которое их создало, и действуют на основании утвержденного им положения.
4. Руководители филиалов и представительств назначаются юридическим лицом и действуют на основании выданной им доверенности.
5. Ведомости о филиалах и представительствах юридического лица включаются в единый государственный реестр.

Статья 96. Ответственность юридических лиц
1. Юридическое лицо самостоятельно отвечает по своим обязательствами.
2. Юридическое лицо отвечает по своим обязательствам всем принадлежащим ему имуществом.
3. Участник (основатель) юридического лица не отвечает по обязательствам юридического лица, а юридическое лицо не отвечает по обязательствам его участника (основателя), кроме случаев, установленных учредительными документами и законом.
4. Лица, которые создают юридическое лицо, несут солидарную ответственность по обязательствам, которые возникли до его государственной регистрации.
Юридическое лицо отвечает по обязательствам его участников (основателей), которые связаны с его созданием, только в случае последующего одобрения их действий соответствующим органом юридического лица.

Статья 97. Управление обществом
1. Управление обществом осуществляют его органы.
2. Органами управления обществом являются общие сборы его участников и исполнительный орган, если другое не установлено законом.

Статья 98. Общие сборы участников общества
1. Общее собрание участников общества вправе принимать решения по всем вопросам деятельности общества, в том числе и из тех, которые относятся к компетенции других органов общества.
2. Решения общих сборов принимаются простым большинством от числа присутствующих участников, если другое не установлено учредительными документами или законом.
Решения о внесении изменений в устав общества, отчуждение имущества общества на сумму, которая составляет пятьдесят и больше процентов имущества общества, и о ликвидации общества принимаются большинством не менее чем в 3/4 голосов, если другое не установлено законом.
3. Участник общества не имеет права голоса при принятии общим собранием общества решений по вопросам совершения с ним сделки и относительно спора между ним и обществом, если иное не установлено законом. Это правило не применяется в обществе с одним участником.
4. Порядок созыва общих сборов определяется в учредительных документах общества. Участники общества, которые владеют не менее чем десятью процентами голосов, могут требовать созыва общих сборов.
Если требование участников о созыве общих сборов не выполнено, эти участники имеют право сами собрать общие сборы.
5. Часть пятая статьи 98 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 99. Исполнительный орган общества
1. Общие сборы общества своим решением создаюти исполнительный орган и устанавливают его компетенцию и состав.
2. Исполнительный орган общества может состоять из одного или нескольких лиц. Исполнительный орган, состоящий из нескольких человек, принимает решения в порядке, установленном абзацем первым части второй статьи 98 настоящего Кодекса.
3. Полномочия члена исполнительного органа могут быть в любое время прекращены или он может быть временно отстранен от исполнения своих полномочий.
4. Названием исполнительного органа общества в соответствии с учредительными документами или законом может быть "правление", "дирекция " т.д.

Статья 100. Выход и исключение из общества
1. Участники общества вправе выйти из общества, если иное не вытекает из закона.
2. Участник общества в случаях и в порядке, установленных законом, может быть исключен из общества.

Статья 101. Управление учреждением
1. Основатели учреждения не берут участия в управлении им.
В учреждении обязательно создается правление, к которому применяются положения статьи 99 Гражданского кодекса Украины.
Учредительный акт может предусматривать создание также других органов, определять порядок формирования этих органов и их состав.
2. Надзор за деятельностью учреждения осуществляет его наблюдательный совет. Наблюдательный совет осуществляет надзор за управлением имуществом учреждения, соблюдением цели учреждения и за его другой деятельностью согласно учредительного акта.

Статья 102. Передача имущества учреждению
1. В учредительном акте определяется имущество, которое основатель (а в случае его смерти - обязанное лицо) должен передать учреждению после его государственной регистрации.

Статья 103. Изменение цели учреждения и структуры управления
1. Если осуществление цели учреждения стало невозможным или оно угрожает общественным интересам, то соответствующий орган государственной власти, может обратиться в суд с заявлением об определении другой цели учреждения по согласованию с органами управления учреждением.
2. В случае изменения цели учреждения суд должен учитывать намерения основателя и заботиться о том, чтобы выгоды от использования имущества учреждения передавались тем дестинаторам, которым эти выгоды предназначались по намерениям основателя.
3. Суд может изменить структуру управления учреждения, если это необходимо вследствие изменения цели учреждения или по другим уважительным причинам.
4. В случае изменения цели учреждения или изменения структуры управления учреждения его правление обязано сообщить суду в письменной форме о своем мнении по этому вопросу.

Статья 104. Прекращение юридического лица
1. Юридическое лицо прекращается в результате реорганизации (слияния, присоединения, разделения, преобразования) или ликвидации. В случае реорганизации юридических лиц имущество, права и обязанности переходят к правопреемникам.
2. Юридическое лицо, не вправе распределять прибыль между участниками, не может быть реорганизована, если среди правопреемников является юридическое лицо, наделенное таким правом. Если среди правопреемников является юридическое лицо, не вправе распределять прибыль между участниками, решение о реорганизации общества, наделенного таким правом, принимается единогласно общим собранием участников, в которых приняли участие все участники общества.
3. Юридическое лицо, не вправе распределять имущество между участниками, в частности в случае ликвидации, не может быть реорганизована, если среди правопреемников является юридическое лицо, наделенное таким правом. Если среди правопреемников является юридическое лицо, не вправе распределять имущество между участниками, решение о реорганизации общества, наделенного таким правом, принимается единогласно общим собранием участников, в которых приняли участие все участники общества.
4. Учреждение не может быть преобразована, кроме случаев, предусмотренных законом.
5. Юридическое лицо является прекращенным со дня внесения в единый государственный реестр записи о его прекращении.
6. Порядок прекращения юридического лица в процессе восстановления его платежеспособности или банкротства устанавливается законом.
7. Особенности прекращения банка как юридического лица устанавливается законом.

Статья 105. Выполнение решения о прекращении юридического лица
1. Участники юридического лица, суд или орган, который принял решение о прекращении юридического лица, обязаны на протяжении трех рабочих дней с даты принятия решения письменно уведомить об этом орган, осуществляющий государственную регистрацию.
2. После внесения записи о принятии решения основателей (участников) юридического лица, суду или уполномоченного ими органа о прекращении юридического лица в Единый государственный реестр юридических лиц и физических лиц - предпринимателей уведомление о внесения записи в Единый государственный реестр юридических лиц и физических лиц - предпринимателей относительно принятия решения основателей (участников) юридического лица, суду или уполномоченному ими органу о прекращении юридического лица публикуется в специализированном печатном средстве массовой информации - часть 2 исключена 26.11.2015.
3. Участники юридического лица, суд или орган, принявший решение о прекращении юридического лица, согласно Гражданского Кодекса назначают комиссию по прекращению юридического лица (комиссию по реорганизации, ликвидационную комиссию), председателя комиссии или ликвидатора и устанавливают порядок и срок заявления кредиторами своих требований к юридическому лицу, которое прекращается.
Выполнение функций комиссии по прекращению юридического лица (комиссии по реорганизации, ликвидационной комиссии) может быть возложено на орган управления юридического лица.
4. К комиссии по прекращению юридического лица (комиссии по реорганизации, ликвидационной комиссии) или ликвидатору с момента назначения переходят полномочия по управлению делами юридического лица. Председатель комиссии, ее члены или ликвидатор юридического лица представляют его в отношениях с третьими лицами и выступают в суде от имени юридического лица, которое прекращается.
5. Срок заявления кредиторами своих требований к юридическому лицу, которое прекращается, не может составлять менее двух и более шести месяцев со дня публикации сообщения о решении о прекращении юридического лица.
6. Каждое отдельное требование кредитора, в частности по уплате налогов, сборов, единого взноса на общеобязательное государственное социальное страхование, страховых средств в Пенсионный фонд Украины, фондов социального страхования, рассматривается, после чего принимается соответствующее решение, которое направляется кредитору не позднее тридцати дней со дня получения юридическим лицом, которое прекращается, соответствующего требования кредитора.

Статья 106. Слияние, присоединение, деление и преобразование юридического лица
1. Слияние, присоединение, деление и преобразование юридического лица осуществляются по решению его участников или органа юридического лица, уполномоченного на это учредительными документами, а в случаях, предусмотренных законом, - по решению суда или соответствующих органов государственной власти.
2. Законом может быть предусмотрено получение согласия соответствующих органов государственной власти на прекращение юридического лица путем слияния или присоединения.

Статья 107. Порядок прекращения юридического лица путем слияния, присоединение, деления и преобразования
1. Кредитор может требовать от юридического лица, которое прекращает, исполнение обязательств которого не обеспечено, прекращения или досрочного исполнения обязательства, или обеспечения исполнения обязательства, кроме случаев, предусмотренных законом.
2. После окончания срока для предъявления требований кредиторами и удовлетворения или отклонения этих требований комиссия по прекращению юридического лица составляет акт передачи (в случае слияния, присоединения или преобразования) или распределительный баланс (в случае деления), который должен содержать положения о правонаследовании относительно имущества, прав и обязанностей прекращаемого юридического лица, путем разделения относительно всех его кредиторов и должников, включая обязательства, которые оспариваются сторонами.
3. Акт передачи и распределительный баланс утверждаются участниками юридического лица или органом, который принял решение о его прекращении кроме случаев, установленных законом.
Подписанные председателем и членами комиссии по прекращению юридического лица и утвержденные участниками юридического лица или органом, который принял решение о прекращении юридического лица, экземпляры акта передачи и распределительного баланса передаются в орган, осуществляющий государственную регистрацию юридического лица, которое прекращается, по месту его государственной регистрации, а также в орган, осуществляющий государственную регистрацию  юридического лица - правопреемника, по месту его государственной регистрации - абзац 2 части 3 исключен 26.11.15
4. Нарушение положений частей второй и третьей этой статьи являются основанием для отказа во внесении в единый государственный реестр записи о прекращении юридического лица и государственной регистрации создаваемых юридических лиц - правопреемников.
5. Юридическое лицо - правопреемник, которое образовалось вследствие разделения, несет субсидиарную ответственность по обязательствам прекращенного юридического лица, которые согласно распределительному балансу перешли к другому юридическому лицу - правопреемнику. Если юридических лиц - правопреемников, которые образовались в результате деления, больше двух, такую ​​субсидиарную ответственность они несут солидарно.
6. Если правопреемниками юридического лица являются несколько юридических лиц и точно определить правопреемника по конкретным обязательствам прекращенного юридического лица, невозможно, юридические лица - правопреемники несут солидарную ответственность перед кредиторами прекращенного юридического лица. Участники (основатели) прекращенного юридического лица, которые согласно закона или учредительных документов отвечали по его обязательствам, отвечают по обязательствам правопреемников, возникших до момента прекращения юридического лица, в том же объеме, если больший объем ответственности участников (основателей) по обязательствам правопреемников не установлен законом или их учредительными документами.

Статья 108. Преобразование юридического лица
1. Преобразованием юридического лица является изменение его организационно-правовой формы.
2. В случае преобразования к новому юридическому лицу переходят все имущество, все права и обязанности предшествующего юридического лица.

Статья 109. Выделение
1. Выделением является переход по распределительному балансу части имущества, прав и обязанностей юридического лица к одному или нескольким создаваемым новым юридическим лицам.
2. После принятия решения о выделении участники юридического лица или орган, принявший решение о выделении, составляют и утверждают разделительный баланс.
Суд, принявший решение о выделении, в своем решении определяет участника юридического лица или высший орган юридического лица (владельца), который обязан составить и утвердить разделительный баланс.
3. Юридическое лицо, образовавшееся вследствие выделения, несет субсидиарную ответственность по обязательствам юридического лица, из которого было осуществлено выделение, которые согласно распределительному балансом не перешли к юридическому лицу, образовавшемуся вследствие выделения. Юридическое лицо, из которого произошло выделение, несет субсидиарную ответственность по обязательствам, которые согласно распределительного баланса перешли к юридическому лицу, образовавшемуся вследствие выделения. Если юридических лиц, образовавшихся в результате выделения, два или более, субсидиарную ответственность они несут совместно с юридическим лицом, с которого было осуществлено выделение, солидарно.
4. Если после выделения невозможно точно установить обязанности лица по отдельным обязательствам, которое существовало у юридического лица до выделения, юридическое лицо, из которого произошло выделение, и юридические лица, которые были созданы в результате выделения, несут солидарную ответственность перед кредитором по таким обязательствам.

Статья 110. Ликвидация юридического лица
1. Юридическое лицо ликвидируется:
по решению его участников или органа юридического лица, уполномоченного на это учредительными документами, в том числе в связи с окончанием срока, на который было создано юридическое лицо, достижением цели, для которой она создана, а также в других случаях, предусмотренных учредительными документами;
по решению суда о ликвидации юридического лица вследствие допущенных при его создании нарушений, которые нельзя устранить, по иску участника юридического лица или соответствующего органа государственной власти;
по решению суда о ликвидации юридического лица в иных случаях, установленных законом, - по иску соответствующего органа государственной власти.
2. Если с иском о ликвидации юридического лица обратился орган государственной власти, ликвидатором может быть назначен этот орган, если он наделен соответствующими полномочиями.
3. Если стоимость имущества юридического лица недостаточна для удовлетворения требований кредиторов, юридическое лицо осуществляет все необходимые действия, установленные законом о восстановлении платежеспособности или признания банкротом.
4. Особенности ликвидации банков устанавливаются законом о банках и банковской деятельности.

Статья 111. Порядок ликвидации юридического лица
1. С даты внесения в Единый государственный реестр юридических лиц, физических лиц - предпринимателей и гражданских формирований записи о решении учредителей (участников) юридического лица, суду или уполномоченному им органа о ликвидации юридического лица ликвидационная комиссия (ликвидатор) обязана принять все необходимые меры по взысканию дебиторской задолженности ликвидируемого юридического лица, и письменно уведомить каждого из должников о прекращении юридического лица в установленные Гражданским Кодексом сроки.
Ликвидационная комиссия (ликвидатор) заявляет требования и иски о взыскании задолженности с должников юридического лица.
2. Ликвидационная комиссия (ликвидатор) обязана сообщить участникам юридического лица, суду или органу, принявшему решение о прекращении юридического лица, о ее участии в других юридических лицах и/или предоставить сведения о созданных ею хозяйственных обществах, дочерних предприятиях.
3. Во время проведении мероприятий по ликвидации юридического лица до окончания срока предъявления требований кредиторов ликвидационная комиссия (ликвидатор) закрывает счета, открытые в финансовых учреждениях, кроме счета, который используется для расчетов с кредиторами во время ликвидации юридического лица.
4. Ликвидационная комиссия (ликвидатор) принимает меры по инвентаризации имущества прекращаемого юридического лица, а также имущества его филиалов и представительств, дочерних предприятий, хозяйственных обществ, а также имущества, которое подтверждает его корпоративные права в других юридических лицах, выявляет и принимает меры по возвращению имущества, находящегося у третьих лиц.
В случаях, установленных законом, ликвидационная комиссия (ликвидатор) обеспечивает проведение независимой оценки имущества прекращаемого юридического лица.
5. Ликвидационная комиссия (ликвидатор) принимает меры по закрытию обособленных подразделений юридического лица (филиалов, представительств) в соответствии с законодательством о труде осуществляет увольнения работников прекращаемого юридического лица.
6. Лицензии, документы разрешительного характера и другие документы, а также печати и штампы, подлежащие возврату органам государственной власти, органам местного самоуправления, возвращаются им ликвидационной комиссией (ликвидатором).
7. Для проведения проверок и определения наличия или отсутствия задолженности по уплате налогов, сборов, единого взноса на общеобязательное государственное социальное страхование, страховых средств в Пенсионный фонд Украины, фонды социального страхования ликвидационная комиссия (ликвидатор) обеспечивает своевременное предоставление налоговым органам и Пенсионного фонда Украины, фондов социального страхования документов юридического лица (его филиалов, представительств), в том числе первичных документов, регистров бухгалтерского и налогового учета.
До момента утверждения ликвидационного баланса ликвидационная комиссия (ликвидатор) составляет и представляет налоговым органам, Пенсионного фонда Украины и фондов социального страхования отчетность за последний отчетный период.
8. Ликвидационная комиссия (ликвидатор) по истечении срока для предъявления требований кредиторами составляет промежуточный ликвидационный баланс, включающий сведения о составе имущества ликвидируемого юридического лица, перечень предъявленных кредиторами требований и результат их рассмотрения.
Промежуточный ликвидационный баланс утверждается участниками юридического лица, судом или органом, принявшим решение о ликвидации юридического лица.
9. Выплата денежных сумм кредиторам ликвидируемого юридического лица, в том числе по налогам, сборам, единым взносам на общеобязательное государственное социальное страхование и другими средствами, подлежащим уплате в государственный или местный бюджет, Пенсионный фонд Украины, фонды социального страхования, производится в порядке очередности, установленном статьей 112 Гражданского Кодекса.
В случае недостаточности у ликвидируемого юридического лица, средств для удовлетворения требований кредиторов ликвидационная комиссия (ликвидатор) организует реализацию имущества юридического лица.
10. До утверждения ликвидационного баланса ликвидационная комиссия (ликвидатор) составляет и представляет налоговым органам, Пенсионному фонду Украины и фондам социального страхования отчетность за последний отчетный период
11. После завершения расчетов с кредиторами ликвидационная комиссия (ликвидатор) составляет ликвидационный баланс, обеспечивает его утверждения участниками юридического лица, судом или органом, принявшим решение о прекращении юридического лица, и обеспечивает представление налоговым органам.
12. Имущество юридического лица, оставшееся после удовлетворения требований кредиторов (в том числе по налогам, сборам, единым взносам на общеобязательное государственное социальное страхование и другим средствам, подлежащим уплате в государственный или местный бюджет, Пенсионный фонд Украины, фонд социального страхования), передается участникам юридического лица, если иное не установлено учредительными документами юридического лица или законом.
13. Документы, подлежащие обязательному хранению, передаются в установленном законодательством порядке в соответствующие архивные учреждения.
14. Ликвидационная комиссия (ликвидатор) обеспечивает предоставление государственному регистратору документов, предусмотренных законом для проведения государственной регистрации прекращения юридического лица в установленный законом срок.

Статья 112. Удовлетворение требований кредиторов
1. В случае ликвидации платежеспособного юридического лица требования его кредиторов удовлетворяются в такой очередности:
в первую очередь удовлетворяются требования относительно возмещения вреда, причиненного увечьем, другим повреждением здоровья или смертью, и требования кредиторов, обеспеченные залогом или другим способом;
во-вторую очередь удовлетворяются требования работников, связанные с трудовыми отношениями, требования автора о плате за использование результата его интеллектуальной, творческой деятельности;
в третью очередь удовлетворяются требования относительно налогов, сборов (обязательных платежей);
в четвертую очередь удовлетворяются все другие требования.
Требования первой очереди удовлетворяются пропорционально сумме требований, которые принадлежат каждому кредитору этой очереди.
2. Очередность удовлетворения требований кредиторов по договорам страхования определяется законом.
3. В случае отказа ликвидационной комиссии в удовлетворении требований кредитора или уклонения от их рассмотрения кредитор имеет право на протяжении месяца с даты, когда он узнал или мог узнать о таком отказе, обратиться в суд с иском к ликвидационной комиссии. По решению суда требования кредитора могут быть удовлетворены за счет имущества, которое осталось после ликвидации юридического лица.
4. Требования кредитора, заявленные после истечения срока, установленного ликвидационной комиссией для их предъявления, удовлетворяются из имущества юридического ликвидируемого лица, которое осталось после удовлетворения требований кредиторов, заявленных своевременно.
5 Требования кредиторов, не признанные ликвидационной комиссией, если кредитор в месячный срок после получения сообщения о полном или частичном отказе в признании его требований не обращался в суд с иском, требования, в удовлетворении которых по решению суда кредитору отказано, а также требования, которые не удовлетворены из-за отсутствия имущества ликвидируемого юридического лица, считаются погашенными
"""

GKU_g_8 = """ 
Глава 8 - Гражданского кодекса
Предпринимательские общества

Параграф 1. Хозяйственные общества
1. Общие положения

Статья 113. Понятие и виды хозяйственных обществ
1. Хозяйственным обществом является юридическое лицо, уставной (составленный) капитал которого разделенный на частицы между участниками.
2. Хозяйственные общества могут быть созданы в форме полного общества, коммандитного общества, общества с ограниченной или дополнительной ответственностью, акционерного общества.

Статья 114. Участники хозяйственного общества
1. Участником хозяйственного общества может быть физическое или юридическое лицо.
Ограничение относительно участия в хозяйственных обществах может быть установлено законом.
2. Хозяйственное общество, кроме полного и коммандитного общества, может быть создано одним лицом, которое становится его единым участником.

Статья 115. Имущество хозяйственного общества
1. Хозяйственное общество является собственником:
имущества, переданного ему участниками общества в собственность как вклад в уставной (составленный) капитал;
продукции, выработанной обществом в результате хозяйственной деятельности;
полученных доходов;
другого имущества, приобретенного на основаниях, которые не запрещены законом.
2. Вкладом в уставной капитал хозяйственного общества могут быть деньги, ценные бумаги, другие вещи или имущественные или другие отчуждаемые права, имеющие денежную оценку, если другое не установлено законом.
Денежная оценка вклада участника хозяйственного общества осуществляется по согласию участников общества, а в случаях, установленных законом, она подлежит независимой экспертной проверке.

Статья 116. Права участников хозяйственного общества
1. Участники хозяйственного общества имеют права в порядке, установленном учредительным документом общества и законом:
принимать участие в управлении обществом в порядке, определенном в учредительном документе, кроме случаев, установленных законом;
принимать участие в распределении прибыли общества и получать его часть (дивиденды);
выйти в установленном порядке из общества;
осуществить отчуждение доли (ее части) в уставном (складочном) капитале общества, ценных бумаг, которые удостоверяют участие в обществе, в порядке, установленном законом.
Договор отчуждения имущества, предметом которого является доля (ее часть) в уставном (складочном) капитале общества, заключается в письменной форме;
получать информацию о деятельности общества в порядке, установленном учредительным документом.
2. Участники хозяйственного общества могут также иметь другие права, установленные учредительным документом общества и законом.

Статья 117. Обязанности участников хозяйственного общества
1. Участники хозяйственного общества обязаны:
придерживаться учредительного документа общества и выполнять решения общего собрания;
выполнять свои обязательства перед обществом, в том числе, связанные с имущественным участием, а также делать вклады (оплачивать акции) в размере, в порядке и средствами, предусмотренными учредительным документом;
не разглашать коммерческую тайну и конфиденциальную информацию о деятельности общества.
2. Участники хозяйственного общества могут также иметь другие обязанности, установленные учредительным документом общества и законом.

Статья 118. Зависимое хозяйственное общество
1. Хозяйственное общество (общество с ограниченной или дополнительной ответственностью, акционерное общество) является зависимым, если другому (главному) хозяйственному обществу принадлежат двадцать или более процентов уставного капитала общества с ограниченной или дополнительной ответственностью либо двадцать или более процентов простых акций акционерного общества.
2. Хозяйственное общество, которое купило или иным образом приобрело двадцать или больше процентов уставного капитала общества с ограниченной или дополнительной ответственностью либо двадцать или более процентов простых акций акционерного общества, обязано сделать достоянием гласности эту информацию в порядке, установленному законом.
2. Полное общество

Статья 119. Понятие полного общества
1. Полным является общество, участники которого в соответствии с заключенным между ними договором осуществляют предпринимательскую деятельность от лица общества и солидарно несут дополнительную (субсидиарную) ответственность по его обязательствам всем имуществом, которое им принадлежит.
2. Лицо может быть участником только одного полного общества.
3. Участник полного общества не имеет права без согласия других участников совершать от своего имени и в своих интересах или в интересах третьих лиц сделки, идентичные тем, которые составляют предмет деятельности общества.
В случае нарушения этого правила общество имеет право по своему выбору требовать от такого участника или возмещения причиненных обществу убытков, или передачи обществу всей выгоды, приобретенной по таким сделкам.
4. Наименование полного общества может содержать имена (наименование) всех его участников, слова "полное общество" или содержать имя (наименование) одного или нескольких участников с добавлением слов "и компания", а также слова "полное общество".

Статья 120. Учредительный договор полного общества
1. Полное общество создается и действует на основании учредительного договора. Учредительный договор подписывается всеми его участниками.
2. Учредительный договор полного общества кроме сведений, предусмотренных статьей 88 Гражданского кодекса Украины, может содержать сведения про: размер и состав составленного капитала общества; размер и порядок изменения долей любого из участников в составленном капитале; размер, состав и сроки внесения ими вкладов.

Статья 121. Управление полным обществом
1. Управление деятельностью полного общества осуществляется по общему согласию всех участников. Учредительским договором общества могут быть предусмотрены случаи, когда решение принимается большинством голосов участников.
2. Каждый участник полного общества имеет один голос, если учредительским договором не предусмотрен другой порядок определения количества голосов.
3. Каждый участник полного общества, независимо от того, уполномоченный ли он вести дела общества, имеет право ознакомляться с всей документацией относительно ведения дел общества. Отказ от этого права ли его ограничение, в частности по договоренности участников общества, является ничтожным.

Статья 122. Ведение дел полного общества
1. Каждый участник полного общества имеет право действовать от лица общества, если учредительским договором не определено, что все участники ведут дела совместно или что ведение дел поручено отдельным участникам.
В случае общего ведения дел участниками общества для совершения любой сделки необходимо согласие всех участников общества. Если ведение дел поручено отдельным участникам полного общества, другие участники могут совершать сделки от лица общества при наличии у них доверенности, выданной участниками, которым поручено ведения дел общества.
В отношениях с третьими лицами полное общество не может ссылаться на положение учредительского договора, которые ограничивают полномочия участников полного общества относительно права действовать от лица общества, кроме случаев, если будет доказано, что третье лицо в момент совершения сделки знало или могло знать об отсутствии у участника общества права действовать от лица общества.
2. Участник полного общества, которое действовало в общих интересах, но не имел на это полномочий, имеет право в случае, если его действия не были одобрены другими участниками, требовать от общества возмещения осуществленных им затрат, если он докажет, что в связи с его действиями общество сохранило или приобрело имущество, которое по стоимости превышает эти затраты.
3. В случае спора между участниками полного общества полномочия на ведение дел общества, предоставленные одному или нескольким участникам, могут быть прекращены судом по требованию одного или нескольких других участников общества при наличии для этого достаточных оснований, в частности вследствие грубого нарушения участником, уполномоченным на ведение дел общества, своих обязанностей или выявления его неспособности к разумному ведению дел. На основании решения суда в учредительный договор общества вносятся необходимые изменения.

Статья 123. Распределение прибыли и убытков полного общества
1. Прибыль и убытки полного общества распределяются между его участниками пропорционально их долям в составленном капитале, если другое не предусмотрено учредительным договором или договоренностью участников.
2. Лишение участника полного общества права на участие в распределении прибыли или убытков не допускается.

Статья 124. Ответственность участников полного общества по его обязательствам
1. В случае недостаточности у полного общества имущества для удовлетворения требований кредиторов в полном объеме участники полного общества солидарно отвечают по обязательствам общества всем своим имуществом, на которое может быть обращено взыскание.
2. Участник полного общества отвечает по долгам общества независимо от того, возникли эти долги до или после его вступления в общество.
3. Участник полного общества, который выбыл из общества, отвечает по обязательствам общества, которые возникли к моменту его убытия, в равной мере с участниками, которые остались, на протяжении трех лет со дня утверждения отчета о деятельности общества за год, в котором он выбыл из общества.
4. Участник полного общества, которое уплатило полностью долги общества, имеет право обратиться с регрессным требованием в соответствующей части к другим участникам, которые несут перед ним ответственность пропорционально своим долям в уставном капитале общества.

Статья 125. Изменения в составе участников полного общества
1. Изменения в составе участников полного общества могут быть в связи с:
выходом участника полного общества из его состава по собственной инициативе;
исключением из состава участников;
убытием из состава участников по причине, которая не зависит от участника.
2. Порядок и особенности выхода, исключение и убытие участников из состава полного общества определяются этим Кодексом, другим законом и учредительским договором.

Статья 126. Выход из полного общества
1. Участник полного общества, которое было создано на неопределенный срок, может в любой момент выйти из общества, заявив об этом не позднее чем за три месяца до фактического выхода из общества. Подлинность подписи на заявлении о выходе из общества подлежит нотариальному удостоверению.
Досрочный выход участника из полного общества, которое основано на определенный срок, допускается лишь по уважительной причине.
2. Отказ от права выйти из полного общества является ничтожным.

Статья 127. Передача участником доли (ее части) в составленном капитале полного общества
1. Участник полного общества имеет право по согласию других его участников передать свою частицу в составленном капитале или ее часть другому участнику общества или третьему лицу.
2. В случае передачи доли (ее части) новому участнику к нему переходят полностью или в соответствующей части права, которые принадлежали участнику, который передал долю (ее часть). Лицо, которому передана доля (ее часть), отвечает по обязательствам общества соответственно части второй статьи 124 Гражданского кодекса Украины.
3. В случае передачи участником общества всей доли другому лицу участие этого участника в полном обществе прекращается и для него наступают следствия, предусмотренные частью третьей статьи 124 Гражданского кодекса Украины.

Статья 128. Исключение из состава участников полного общества
1. Участник полного общества, которое систематически не выполняет или выполняет ненадлежащим образом обязанности, возложенные на него обществом, или что препятствует своими действиями (бездеятельностью) достижению целей общества, может быть исключен из общества в порядке, установленном учредительным договором.
2. Решение об исключении из состава участников полного общества может быть обжаловано в суде.

Статья 129. Убытие из полного общества
1. Полное общество может принять решение о признании участника полного общества, выбывшим из его состава, в случае:
смерти участника или объявлении его умершим - из-за отсутствия наследников;
ликвидации юридического лица - участника общества, в том числе в связи с признанием его банкротом;
признание участника недееспособным, ограничение его гражданской дееспособности или признания безвестно отсутствующим;
назначение по решению суда принудительной реорганизации юридического лица - участника общества, в частности в связи с его неплатежеспособностью;
обращение взыскания на часть имущества полного общества, которое соответствует доле участника в составленном капитале общества.
2. Решение о признании участника полного общества, выбывшим из его состава, может быть обжаловано заинтересованными лицами в суде.
3. В случае убытия участника из полного общества на основаниях, предусмотренных частью первой этой статьи, общество может продолжить свою деятельность, если другое не установлено учредительским договором общества или договоренностью между участниками, которые остаются.

Статья 130. Расчеты в случае выхода, исключение и убытие с полного общества
1. Участнику, который вышел, который исключен или который выбыл из полного общества на основаниях, установленных в статьях 126, 128 и 129 Гражданского кодекса Украины, выплачивается стоимость части имущества общества, пропорционально доле этого участника в составленном капитале общества, если другое не установлено учредительским договором.
2. Если наследник участника полного общества - физического лица или правопреемник юридического лица не вступил в полное общество, расчеты с ним осуществляются соответственно части первой этой статьи.
3. Порядок определения стоимости доли участника в имуществе полного общества и сроки ее выплаты устанавливаются учредительским договором и законом.

Статья 131. Обращение взыскания на часть имущества полного общества, пропорциональную частице участника общества в составленном капитале
1. Обращение взыскания на частицу участника в составленном капитале полного общества по его личным обязательствам допускается только в случае недостаточности другого имущества для удовлетворения требований кредиторов. В случае недостаточности имущества участника полного общества для выполнения его обязательств перед кредиторами они могут требовать в установленном порядке выделения части имущества полного общества, пропорциональной доле участника-должника в составленном капитале общества.
2. Часть имущества полного общества, пропорциональная частице участника-должника в составленном капитале, выделяется в денежной форме или в натуре соответственно балансу, составленного на момент убытия такого участника из общества.

Статья 132. Ликвидация полного общества
1. Полное общество ликвидируется на основаниях, установленных статьей 110 Гражданского кодекса Украины, а также в случае, если в обществе остается один участник. Этот участник имеет право на протяжении шести месяцев с момента, когда он стал единым участником общества, превратить такое общество в другое хозяйственное общество в порядке, установленному этим Кодексом.
2. В случае выхода участника из полного общества, исключение одного из его участников из общества, смерти участника общества, ликвидации юридического лица - участника общества или обращение кредитором одного из участников взыскания на часть имущества, пропорциональную его доле в уставном капитале, общество может продолжить свою деятельность, если это предусмотрено учредительским договором общества или договоренностью между участниками, которые остаются.
3. Коммандитное общество

Статья 133. Основные положения о коммандитном обществе
1. Коммандитным обществом является общество, в котором вместе с участниками, которые осуществляют от лица общества предпринимательскую деятельность и солидарно несут дополнительную (субсидиарную) ответственность по обязательствам общества всем своим имуществом (полными участниками), есть одних или несколько участников (вкладчиков), которые несут риск убытков, связанных с деятельностью общества, в границах сумм сделанных ими вкладов и не берут участия в деятельности общества.
2. Наименование коммандитного общества может содержать имена (наименование) всех полных участников, слова "коммандитное общество" или содержать имени (наименование) хотя бы одного полного участника с приданием слов "и компания", а также слова "коммандитное общество".
Если в название коммандитного общества включено имя вкладчика, такой вкладчик становится полным участником общества.
3. К коммандитному обществу применяются положения о полном обществе, если другое не установлено Гражданским кодексом Украины, или другим законом.

Статья 134. Учредительский договор коммандитного общества
1. Коммандитное общество создается и действует на основании учредительского договора. Учредительский договор подписывается всеми полными участниками.
2. Учредительский договор коммандитного общества кроме сведений, предусмотренных статьей 88 Гражданского кодекса Украины, может содержать сведения про: размер и состав уставного капитала общества; размер и порядок изменения долей любого из полных участников в уставном капитале; совокупный размер вкладов вкладчиков.
3. Если вследствие выхода, исключения или убытие в коммандитном обществе остался один полный участник, учредительский договор переоформляется в единоличное заявление, подписанное полным участником. Если коммандитное общество создается одним полным участником, то учредительным документом является единоличное заявление (меморандум), которое содержит все сведения, установленные этой статьей для коммандитного общества.

Статья 135. Участники коммандитного общества
1. Правовой статус полных участников коммандитного общества и их ответственность по обязательствам общества устанавливаются положениями Гражданского кодекса Украины об участниках полного общества.
2. Лицо может быть полным участником только в одном коммандитном обществе.
Полный участник коммандитного общества не может быть участником полного общества.
Полный участник коммандитного общества не может быть вкладчиком этого самого общества.
3. Совокупный размер вкладов вкладчиков не должен превышать пятидесяти процентов уставного капитала полного общества.
На момент государственной регистрации коммандитного общества любой из вкладчиков должен сделать вклад в размере, установленном законом.

Статья 136. Управление коммандитным обществом
1. Управление деятельностью коммандитного общества осуществляется полными участниками в порядке, установленном Гражданским кодексом Украины для полного общества.
2. Вкладчики не имеют права брать участия в управлении деятельностью коммандитного общества и возражать против действий полных участников относительно управления деятельностью общества. Вкладчики коммандитного общества могут действовать от лица общества только по доверенности.

Статья 137. Права и обязанности вкладчика коммандитного общества
1. Вкладчик коммандитного общества обязан сделать вклад в уставный капиталу. Внесение вкладов заверяется свидетельством об участии в коммандитном обществе.
2. Вкладчик коммандитного общества имеет право:
получать часть прибыли общества соответственно его частице в уставном капитале общества в порядке, установленном учредительским договором (меморандумом);
действовать от лица общества в случае выдачи ему доверенности и соответственно ей;
преимущественно перед третьими лицами приобретать отчуждаемую долю (ее часть) в уставном капитале общества соответственно положениям статьи 147 Гражданского кодекса Украины.
Если желание выкупить частицу (ее часть) выразили несколько вкладчиков, указанная доля распределяется между ними соответственно их долям в уставном капитале общества;
требовать первоочередного возвращения вклада в случае ликвидации общества;
ознакомляться с годовыми отчетами и балансами общества;
после окончания финансового года выйти из общества и получить свой вклад в порядке, установленном учредительским договором (меморандумом);
передать свою долю (ее часть) в уставном капитале другому вкладчику или третьему лицу, сообщив об этом обществу.
Передача вкладчиком всей своей доли другому лицу прекращает его участие в коммандитном обществе.
3. Учредительским договором (меморандумом) коммандитного общества могут быть предусмотрены также другие права вкладчика.

Статья 138. Ответственность вкладчика коммандитного общества
1. Если вкладчик коммандитного общества совершает сделку от лица и в интересах общества без соответствующих полномочий, то в случае одобрения его действий коммандитным обществом он освобождается от ответственности перед кредиторами за совершенную сделку.
Если одобрение коммандитного общества не будет получено, вкладчик отвечает перед третьими лицами за совершенную им сделку всем своим имуществом, на которое соответственно закону может быть обращено взыскание.
2. Вкладчик коммандитного общества, которое не внесло предусмотренного учредительским договором (меморандумом) вклада, несет ответственность перед обществом в порядке, установленному учредительским договором (меморандумом).

Статья 139. Ликвидация коммандитного общества
1. Коммандитное общество ликвидируется при убытии всех вкладчиков. Полные участники имеют право в случае убытия всех вкладчиков превратить коммандитное общество в полное общество. Коммандитное общество ликвидируется также на основаниях, установленных статьей 132 Гражданского кодекса Украины. Коммандитное общество не обязано ликвидироваться, если в нем остаются хотя бы один полный участник и один вкладчик.
2. В случае ликвидации коммандитного общества, после расчетов с кредиторами, вкладчики имеют преобладающее право перед полными участниками на получение вкладов в порядке и на условиях, установленных этим Кодексом, другим законом и учредительским договором (меморандумом). При недостаточности средств общества для полного возвращения вкладчикам их вкладов, имеющиеся средства распределяются между вкладчиками пропорционально к их долям в уставном капитале общества.
4. Общество с ограниченной ответственностью
Название подраздела 4 § 1 главы 8 "4. Общество с ограниченной ответственностью" исключено на основании Закона № 2275-VIII от 06.02.2018

Статья 140. Понятие общества с ограниченной ответственностью
1. Обществом с ограниченной ответственностью является основанное одним или несколькими лицами общество, уставной капитал которого разделен на доли, размер которых устанавливается уставом.
2. Участники общества с ограниченной ответственностью не отвечают по его обязательствам и несут риск убытков, связанных с деятельностью общества, в границах стоимости своих вкладов. Участники общества, которые не полностью внесли вклады, несут солидарную ответственность по его обязательствам в границах стоимости невнесенной части вклада любого из участников.
3. Наименование общества с ограниченной ответственностью может содержать наименования общества, а также слова "общество с ограниченной ответственностью".

Статья 140 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 141. Участники общества с ограниченной ответственностью
1. Максимальное количество участников общества с ограниченной ответственностью устанавливается законом. При превышении этого количества общество с ограниченной ответственностью подлежит преобразованию в акционерное общество на протяжении одного года, а по истечении этого срока - ликвидации в судебном порядке, если количество его участников не уменьшится в установленных пределах.
2. Общество с ограниченной ответственностью не может иметь единым участником другое хозяйственное общество, участником которого является одно лицо. Лицо может быть участником лишь одного общества с ограниченной ответственностью, которое имеет одного участника.

Статья 141 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 142. Договор об учреждении общества с ограниченной ответственностью
1. Если общество с ограниченной ответственностью основывается несколькими лицами, эти лица в случае необходимости определить взаимоотношения между собою относительно создания общества заключают договор в письменной форме, который устанавливает порядок учреждения общества, условия осуществления совместной деятельности относительно создания общества, размер уставного капитала, долю в уставном капитале любого из участников, сроки и порядок внесения вкладов и прочие условия.
2. Договор об учреждении общества с ограниченной ответственностью не является учредительным документом. Представление настоящего договора при государственной регистрации общества не является обязательным.

Статья 142 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 143. Устав общества с ограниченной ответственностью
1. Учредительным документом общества с ограниченной ответственностью является устав.
Устав общества с ограниченной ответственностью кроме сведений, предусмотренных статьей 88 Гражданского кодекса Украины, может содержать сведения про: размер уставного капитала, с определением доли каждого участника; состав и компетенцию органов управления и порядок принятия ими решений; размер и порядок формирования резервного фонда; порядок передачи (перехода) долей в уставном фонде.
2. Устав общества с ограниченной ответственностью со всеми следующими изменениями сохраняется в органе, который осуществил государственную регистрацию общества, и является открытым для ознакомления.

Статья 143 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 144. Уставной капитал общества с ограниченной ответственностью
1. Уставной капитал общества с ограниченной ответственностью состоит из стоимости вкладов его участников.
Соответственно уставному капиталу определяется минимальный размер имущества общества, которое гарантирует интересы его кредиторов. Размер уставного капитала общества не может быть меньше размера, установленного законом.
2. Не допускается увольнение участника общества с ограниченной ответственностью от обязанности внесения вклада в уставной капитал общества, в том числе путем зачисления требований к обществу.
3. Уставной капитал общества с ограниченной ответственностью подлежащей уплате участниками общества до окончания первого года с дня государственной регистрации общества.
Если участники до окончания первого года со дня государственной регистрации общества не внесли (не полностью внесли) свои вклады, Общее собрание участников принимает одно из следующих решений:
об исключении из состава общества тех участников, которые не внесли (не полностью внесли) свои вклады, и об определении порядка перераспределения долей в уставном капитале;
об уменьшении уставного капитала и об определении порядка перераспределения долей в уставном капитале;
о ликвидации общества.
Изменения в устав, связанные с изменением размера уставного капитала и / или с изменением состава участников, подлежат государственной регистрации в установленном законом порядке.
Решение об уменьшении уставного капитала общества направляется почтовым отправлением всем кредиторам общества не позднее трехдневного срока со дня его принятия.
4. Если после окончания второго или каждого следующего финансового года стоимость чистых активов общества с ограниченной ответственностью окажется меньше уставного капитала, общество обязано объявить об уменьшении своего уставного капитала и зарегистрировать соответствующие изменения в устав в установленном порядке, если участники не приняли решения о внесении дополнительных вкладов. Если стоимость чистых активов общества становится меньше определенного законом минимального размера уставного капитала, общество подлежит ликвидации.
5. Уменьшение уставного капитала общества с ограниченной ответственностью допускается после сообщения в порядке, установленном законом, всех его кредиторов. В этом случае кредиторы имеют право требовать досрочного прекращения или выполнения соответствующих обязательств общества и возмещения им убытков.
6. Увеличение уставного капитала общества с ограниченной ответственностью допускается после внесения всеми его участниками вкладов в полном объеме. Порядок внесения дополнительных вкладов устанавливается законом и уставом общества.

Статья 144 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 145. Управление обществом с ограниченной ответственностью
1. Вышестоящим органом общества с ограниченной ответственностью являются общие сборы его участников.
2. В обществе с ограниченной ответственностью создается исполнительный орган (коллегиальный или единоличный), осуществляющий текущее руководство за его деятельностью и является подотчетным общим сборам его участников. Исполнительный орган общества может быть избран также и не из состава участников общества.
3. Компетенция исполнительного органа общества с ограниченной ответственностью, порядок принятия им решений и порядок совершения действий от лица общества устанавливаются этим Кодексом, другим законом и уставом общества.
4. К исключительной компетенции общих сборов участников общества с ограниченной ответственностью относятся:
определение основных направлений деятельности общества, утверждение его планов и отчетов об их выполнении;
внесение изменений в устав общества, изменение размера его уставного капитала;
создание и отзыв исполнительного органа общества;
определение форм контроля за деятельностью исполнительного органа, создание и определение полномочий соответствующих контрольных органов;
утверждение годовых отчетов и бухгалтерских балансов, распределение прибыли и убытков общества;
решение вопроса о приобретении обществом долей участников;
исключение участника из общества;
принятие решения о ликвидации общества, назначение ликвидационной комиссии, утверждение ликвидационного баланса.
Уставом общества и законом к исключительной компетенции общего собрания может быть также отнесено решение других вопросов.
Вопросы, отнесенные к исключительной компетенции общих сборов участников общества, не могут быть переданы ими для решения исполнительному органу общества.
Очередность и порядок созыва общего собрания устанавливаются уставом общества и законом.

Статья 145 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 146. Контроль за деятельностью исполнительного органа общества с ограниченной ответственностью
1. Контроль за деятельностью исполнительного органа общества с ограниченной ответственностью осуществляется в порядке, установленном уставом и законом.
2. Общие сборы общества с ограниченной ответственностью могут формировать органы, которые осуществляют постоянный контроль за финансово-хозяйственной деятельностью исполнительного органа. Порядок создания и полномочия контрольного органа устанавливаются общими сборами участников общества.
3. Для осуществления контроля за финансовой деятельностью общества с ограниченной ответственностью в соответствии с решением его общего собрания, а также в других случаях, установленных уставом и законом общества, может назначаться аудиторская проверка.
4. Порядок проведения аудиторских проверок деятельности и отчетности общества с ограниченной ответственностью устанавливается уставом общества и законом.
По требованию кого-нибудь из участников общества может быть проведена аудиторская проверка годовой финансовой отчетности общества с привлечением профессионального аудитора, не связанного имущественными интересами с обществом или с его участниками.
Затраты, связанные с проведением такой проверки, возлагаются на участника, по требованию которого проводится аудиторская проверка, если другое не установлено уставом общества.
5. Публичная отчетность общества с ограниченной ответственностью о результатах его деятельности не требуется, кроме случаев, установленных законом.

Статья 146 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 147. Переход доли (ее части) участника в уставном капитале общества с ограниченной ответственностью к другому лицу
1. Участник общества с ограниченной ответственностью имеет право продать ли иным образом отчуждать свою долю (ее часть) в уставном капитале один или нескольким участникам этого общества.
2. Отчуждение участником общества с ограниченной ответственностью своей доли (ее части) третьим лицам допускается, если другое не установлено уставом общества.
Участники общества пользуются преобладающим правом покупки доли (ее части) участника пропорционально к размерам своих долей, если уставом общества или договоренностью между участниками не установлен другой порядок осуществления этого права. Покупка осуществляется по цене и прочим условиям, при которых доля (ее часть) предлагалась для продажи третьим лицам. Если участники общества не воспользуются своим преобладающим правом в течение месяца со дня сообщения о намерении участника продать долю (ее часть) или на протяжении другого срока, установленного уставом общества или договоренностью между его участниками, доля (ее часть) участника может быть отчуждена третьему лицу.
3. Доля участника общества с ограниченной ответственностью может быть отчуждена к полной ее уплате лишь в той части, в которой за нее уже уплачено.
4. В случае приобретения доли (ее части) участника самим обществом с ограниченной ответственностью оно обязано реализовать ее другим участникам или третьим лицам на протяжении срока и в порядке, установленных уставом и законом, или уменьшить свой уставной капитал соответственно статье 144 Гражданского кодекса Украины.
5. Доля в уставном капитале общества с ограниченной ответственностью переходит к наследнику физического лица или правопреемника юридического лица - участника общества, если уставом общества не предусмотрено, что такой переход допускается лишь по согласию других участников общества.
Расчеты с наследниками (правопреемниками) участника, которые не вступили в общество, осуществляются в соответствии с положениями статьи 148 Гражданского кодекса Украины.

Статья 147 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 148. Выход участника из общества с ограниченной ответственностью
1. Участник общества с ограниченной ответственностью вправе выйти из общества, заявив об этом не позднее чем за три месяца до выхода, если иной срок не установлен уставом. Подлинность подписи на заявлении о выходе из общества подлежит нотариальному удостоверению.
2. Участник, который выходит из общества с ограниченной ответственностью, имеет право получить стоимость части имущества, пропорциональную его доли в уставном капитале общества. По договоренности между участником и обществом выплата стоимости части имущества общества может быть заменена передачей имущества в натуре.
Если вклад в уставный капитал был осуществлен путем передачи права пользования имуществом, соответствующее имущество возвращается участнику без выплаты вознаграждения.
Порядок и способ определения стоимости части имущества, пропорциональны доле участника в уставном капитале, а также порядок и сроки ее выплаты устанавливаются уставом и законом.
3. Споры, которые возникают в связи с выходом участника из общества с ограниченной ответственностью, в том числе споры относительно порядка определения доли в уставном капитале, ее размера и сроков выплаты, решаются судом.

Статья 148 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 149. Обращение взыскания на часть имущества общества с ограниченной ответственностью, пропорциональную доле участника общества в уставном капитале
1. Обращение взыскания на часть имущества общества с ограниченной ответственностью, пропорциональную доле участника общества в уставном капитале, за его личными долгами допускается лишь в случае недостаточности у него другого имущества для удовлетворения требований кредиторов. Кредиторы такого участника имеют право требовать от общества выплаты стоимости части имущества общества, пропорциональной доле должника в уставном капитале общества, или выделения соответствующей части имущества для обращения на него взыскания. Часть имущества, подлежащего выделению, или объем средств, которые составляют его стоимость, устанавливается в соответствии с балансом, который складывается на дату предъявления требований кредиторами.
2. Обращение взыскания на всю долю участника в уставном капитале общества с ограниченной ответственностью прекращает его участие в обществе.

Статья 149 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 150. Ликвидация общества с ограниченной ответственностью
1. Общество с ограниченной ответственностью может быть ликвидировано по решению общих сборов его участников, в том числе в связи с истечением срока, на который общество было создано, а также по решению суда - в случаях, установленных законом.
2. Общество с ограниченной ответственностью может быть преобразовано в акционерное общество или в производственный кооператив.

Статья 150 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 151. Понятие общества с дополнительной ответственностью
1. Обществом с дополнительной ответственностью является общество, основанное одним или несколькими лицами, Уставной капитал которого разделен на доли, размер которых определен уставом.
2. Участники общества с дополнительной ответственностью солидарно несут дополнительную (субсидиарную) ответственность по его обязательствам своим имуществом в размере, который устанавливается уставом общества и является одинаково кратным для всех участников к стоимости внесенного каждым участником вклада. В случае признания банкротом одного из участников его ответственность по обязательствам общества распределяется между другими участниками общества пропорционально их долям в уставном капитале общества.
3. Наименование общества с дополнительной ответственностью должно содержать наименование общества, а также слова "общество с дополнительной ответственностью".
4. К обществу с дополнительной ответственностью применяются положения Гражданского кодекса Украины об обществе с ограниченной ответственностью, если другое не установлено уставом общества и законом.

Статья 151 исключена на основании Закона № 2275-VIII от 06.02.2018
5. Акционерное общество

Статья 152. Понятие акционерного общества
1. Акционерное общество - хозяйственное общество, уставный капитал которого разделен на определенное количество долей одинаковой номинальной стоимости, корпоративные права по которым удостоверяются акциями.
2. Акционерное общество самостоятельно отвечает по своим обязательствам всем своим имуществом. Акционеры не отвечают по обязательствам общества и несут риск убытков, связанных с деятельностью общества, в пределах стоимости акций, которые им принадлежат (кроме случаев, установленных законом).
Акционеры, которые не полностью оплатили акции, в случаях, установленных уставом, отвечают по обязательствам общества в пределах неоплаченной части стоимости принадлежащих им акций.
Гарантии защиты имущественных прав акционеров устанавливаются законом.
3. Наименование акционерного общества должно содержать его наименование и указание того, что общество является акционерным.
4. Особенности правового статуса акционерных обществ, созданных в процессе приватизации государственных предприятий, устанавливаются законом.
Порядок создания, деятельности и прекращения корпоративных инвестиционных фондов регулируется законодательством об институтах совместного инвестирования.
5. Акционерное общество, которое осуществляет публичное размещение акций, обязано ежегодно публиковать для всеобщего сведения годовой отчет, бухгалтерский баланс, сведения о доходах и убытки, а также другую информацию, предусмотренную законом.
6. Акционерные общества по типу разделяются на публичные общества и частные общества. Особенности правового статуса публичных и частных акционерных обществ устанавливаются законом.

Статья 153. Создание акционерного общества
1. Акционерное общество может быть создано юридическими и (или) физическими лицами, а также государством в лице уполномоченного органа, территориальной общиной в лице уполномоченного органа.
2. Если акционерное общество создается несколькими людьми, они заключают между собой договор, который определяет порядок осуществления ими общей деятельности относительно создания общества.
Настоящий договор не является учредительным документом общества.
Договор о создании акционерного общества заключается в письменной форме, а если общество создается физическими лицами, договор подлежит нотариальному удостоверению.
3. Лица, которые создают акционерное общество, несут солидарную ответственность по обязательствам, которые возникли при государственной регистрации общества.
Акционерное общество отвечает по обязательствам участников, связанных с его созданием, лишь в случае следующего одобрения их действий общим собранием акционеров.
4. Акционерное общество может быть создано одним человеком или может состоять из одного человека в случае приобретения одним акционером всех акций общества. Ведомости об этом подлежат регистрации и опубликованию для общего известная.
Акционерное общество не может иметь единым участником другое предпринимательское общество, участником которого является один человек.
5. Порядок и сроки совершения действий относительно создания акционерного общества, в том числе порядок проведения учредительного собрания и их компетенция, устанавливаются законом.

Статья 154. Устав акционерного общества
1. Учредительным документом акционерного общества является его устав.
2. Устав акционерного общества кроме ведомостей, предусмотренных статьей 88 Гражданского кодекса Украины, должны содержать ведомости о: размере уставного капитала; сведения о категориях акций, которые выпускаются обществом, и их нарицательную стоимость и количество; права акционеров; состав и компетенцию органов управления обществом и о порядке принятия ими решений. В уставе акционерного общества должны также содержаться другие ведомости, предусмотренные законом.

Статья 155. Уставной капитал акционерного общества
1. Уставной капитал акционерного общества образовывается из стоимости вкладов акционеров, внесенных вследствие приобретения ими акций.
Уставной капитал общества определяет минимальный размер имущества общества, который гарантирует интересы его кредиторов. Он не может быть меньшим размера, установленного законом.
2. В процессе создания акционерного общества его акции подлежат размещению исключительно среди учредителей путем частного размещения. Публичное размещение акций осуществляется после получения свидетельства о регистрации первого выпуска акций.
3. Если после истечения второго и каждого следующего финансового года стоимость чистых активов акционерного общества окажется меньше уставного капитала, общество обязано объявить об уменьшении своего уставного капитала и зарегистрировать соответствующие изменения в устав в установленном порядке. Если стоимость чистых активов общества становится меньше минимального размера уставного капитала, установленного законом, общество подлежит ликвидации.

Статья 156. Увеличение уставного капитала акционерного общества
1. Акционерное общество имеет право по решению общего собрания акционеров увеличить Уставной капитал путем увеличения нарицательной стоимости акций или дополнительного выпуска акций.
2. Увеличение уставного капитала акционерного общества допускается после его полной уплаты. Увеличение уставного капитала общества для покрытия убытков не допускается.
3. В случаях, установленных уставом общества и законом, может быть установлено преобладающее право акционеров на приобретение акций, которые дополнительно выпускаются обществом.

Статья 157. Уменьшение уставного капитала акционерного общества
1. Акционерное общество имеет право по решению общих сборов акционеров уменьшить Уставной капитал путем уменьшения нарицательной стоимости акций или путем покупки обществом части выпущенных акций с целью уменьшения их общего количества.
Уменьшение уставного капитала акционерного общества допускается после сообщения об этом всем его кредиторам в порядке, установленном законом. При этом кредиторы общества имеют право требовать досрочного прекращения или выполнения обществом соответствующих обязательств и возмещения убытков.
2. Уменьшение уставного капитала акционерного общества путем покупки и погашения части акций допускается, если такая возможность предусмотрена в уставе общества.
3. Уменьшение акционерным обществом уставного капитала ниже установленного законом размера ведет к ликвидации общества.

Статья 158. Ограничение относительно выпуска ценных бумаг и относительно выплаты дивидендов
1. Доля привилегированных акций в общем объеме уставного капитала акционерного общества не может превышать двадцати пяти процентов.
2. Часть вторая статьи 158 исключена на основании Закона N 3480 - IV от 23.02.2006./p>
3. Акционерное общество не имеет права объявлять и выплачивать дивиденды:
до полной уплаты всего уставного капитала;
при уменьшении стоимости чистых активов акционерного общества до размера, меньшего, чем размер уставного капитала и резервного фонда;
в других случаях, установленных законом.

Статья 159. Общее собрание акционеров
1. Вышестоящим органом акционерного общества является общее собрание акционеров. В общем собрании имеют право принимать участие все его акционеры независимо от количества и вида акций, которые им принадлежат.
Акционеры (их представители), которые принимают участие в общем собрании, регистрируются с указанием количества голосов, которые имеет каждый акционер, который принимает участие в собрании.
2. К исключительной компетенции общего собрания акционеров принадлежит:
внесение изменений в устав общества, в том числе изменение размера его уставного капитала;
образование и ликвидация наблюдательного совета и других органов общества, избрание и отзыв членов наблюдательного совета;
утверждение годового отчета общества;
решение о ликвидации общества.
К исключительной компетенции общих сборов уставом общества и законом может быть также отнесено решение других вопросов.
Вопросы, отнесенные законом к исключительной компетенции общего собрания акционеров, не могут быть переданы им для решения другим органам общества.
3. Порядок голосования на общем собрании акционеров устанавливается законом.
Акционер имеет право назначить своего представителя для участия в собрании. Представитель может быть постоянным или предназначенным на определенный срок. Акционер имеет право в любой момент заменить своего представителя в вышестоящем органе общества, сообщив об этом в исполнительный орган акционерного общества.
4. Решение общих собраниях акционеров принимаются большинством не менее чем в 3/4 голосов акционеров, которые принимают участие в собрании, относительно:
внесения изменений в устав общества;
ликвидации общества, кроме случаев, установленных законом;
вопросов, предусмотренных законом, регулирующим вопросы создания, деятельности и прекращения акционерных обществ.
По другим вопросам решения принимаются простым большинством голосов акционеров, которые принимают участие в собрании.
5. Общие собрания акционеров созываются не реже одного раза в год.
Внеочередные собрания акционеров созываются в случае неплатежеспособности общества, а также при наличии обстоятельств, определенных в уставе общества, и в любом другом случае, если этого требуют интересы акционерного общества в целом.
Порядок созыва и проведения общего собрания, а также условия созыва и проводка внеочередного собрания и сообщение акционеров устанавливаются уставом общества и законом.

Статья 160. Наблюдательный совет акционерного общества
1. В акционерном обществе может быть создан Наблюдательный совет акционерного общества, который осуществляет контроль за деятельностью его исполнительного органа и защиту прав акционеров общества.
Случаи обязательного создания в акционерном обществе наблюдательного совета устанавливаются законом.
2. Уставом акционерного общества и законом устанавливается исключительная компетенция наблюдательного совета. Вопросы, отнесенные уставом к исключительной компетенции наблюдательного совета, не могут быть переданы им для решения исполнительным органом общества.
3. Члены наблюдательного совета акционерного общества не могут быть членами его исполнительного органа.
4. Наблюдательный совет акционерного общества определяет формы контроля за деятельностью его исполнительного органа.

Статья 161. Исполнительный орган акционерного общества
1. Исполнительным органом акционерного общества, который осуществляет руководство его текущей деятельностью, является правление или другой орган, определенный уставом.
Исполнительный орган решает все вопросы деятельности акционерного общества, кроме отнесенных к компетенции общего собрания и наблюдательного совета общества.
Исполнительный орган является подотчетным общему собранию акционеров и надзорному совету акционерного общества и организовывает выполнение их решений. Исполнительный орган действует от лица акционерного общества в пределах, установленных уставом акционерного общества и законом.
2. Исполнительный орган акционерного общества может быть коллегиальным (правление, дирекция) или единоличным (директор, генеральный директор).

Статья 162. Аудиторская проверка
1. Акционерное общество, которое обязано согласно закону публиковать для общего ознакомления документы, предусмотренные статьей 152 Гражданского кодекса Украины, должно для проверки и подтверждения правильности годовой финансовой отчетности ежегодно привлекать аудитора, не связанного имущественными интересами с обществом или с его участниками.
2. Аудиторская проверка деятельности акционерного общества, в том числе, не обязаного публиковать для общего ознакомления документы, должна быть проведена в любое время по требованию акционеров, которые вместе владеют не менее чем десятью процентами акций.
Порядок проводки аудиторских проверок деятельности акционерного общества устанавливается уставом общества и законом.
Расходы, связанные с проводкой такой проверки, полагаются на лица, по требованию которых проводится аудиторская проверка, если общими собранием акционеров не будет принято решение о другом.
Параграф 2 - Производственный кооператив

Статья 163. Понятие производственного кооператива
1. Производственным кооперативом является добровольное объединение граждан на началах членства для общей производственной или другой хозяйственной деятельности, которая базируется на их личном трудовом участии и объединении его членами имущественных паевых взносов. Уставом кооператива и законом может быть предусмотрено участие в деятельности производственного кооператива на началах членства также других лиц.
2. Члены производственного кооператива несут субсидиарную ответственность по обязательствам кооператива в размерах и порядке, установленных уставом кооператива и законом.
3. Наименование кооператива должно содержать его название, а также слова "производственный кооператив".
4. Правовой статус производственных кооперативов, права и обязанности их членов устанавливаются этим Кодексом и другим законом.
5. Особенности создания и деятельности сельскохозяйственных кооперативов могут устанавливаться законом.

Статья 164. Учредительные документы производственного кооператива
1. Учредительным документом производственного кооператива является его устав, который утверждается общими сборами его членов.
2. Устав производственного кооператива должен содержать кроме ведомостей, предусмотренных статьей 88 Гражданского кодекса Украины, ведомости о: размере паевого взноса члена кооператива; состав и порядок внесения паевых взносов членами кооператива и их ответственность за нарушение обязательства относительно внесения паевых взносов; характер и порядок трудового участия его членов в деятельности кооператива и их ответственности за нарушение обязательств относительно личного трудового участия; порядок распределения прибыли и убытков кооператива; размер и условия субсидиарной ответственности его членов по обязательствам кооператива; состав и компетенцию органов управления кооператива и о порядке принятия ими решений.
3. Количество членов кооператива не может быть меньше, установленного законом.

Статья 165. Имущество производственного кооператива
1. Имущество, которое находится в собственности производственного кооператива, делится на паи его членов согласно уставу кооператива.
2. Член производственного кооператива обязан внести в день государственной регистрации кооператива не меньше десяти процентов паевого взноса, а часть, которая осталась, - на протяжении года со дня его государственной регистрации, если другой срок не установлен уставом кооператива.
Порядок внесения паевых взносов членами производственного кооператива устанавливается уставом кооператива и законом.
3. Производственный кооператив не имеет права выпускать акции.
4. Прибыль производственного кооператива распределяется между его членами согласно их трудовому участию, если другой порядок не установлен уставом кооператива.
5. Имущество, которое осталось после ликвидации производственного кооператива и удовлетворение требований его кредиторов, распределяется между его членами согласно их трудовому участию, если другой порядок не установлен уставом кооператива.

Статья 166. Прекращение членства в производственном кооперативе и переход пая
1. Член производственного кооператива имеет право на выход из кооператива. В этом случае ему выплачивается стоимость пая или выдается имущество, пропорциональное размеру его пая, а также осуществляются выплаты, установленные уставом кооператива.
Выдача пая, выплата стоимости пая и другие выплаты члену кооператива, который выходит из него, осуществляются в порядке, установленном уставом кооператива и законом.
2. Член производственного кооператива может быть исключен из кооператива по решению общего собрания в случае невыполнения или ненадлежащего выполнения обязанностей, возложенных на него уставом кооператива, а также в других случаях, установленных уставом кооператива и законом.
Член производственного кооператива, которого исключили из кооператива, имеет право на получение пая и других выплат, установленных уставом кооператива, согласно части первой этой статьи.
3. Член производственного кооператива имеет право передать свой пай или его часть другому члену кооператива, если другое не установлено уставом кооператива и законом.
Передача пая (его части) лицу, которое не является членом производственного кооператива, допускается лишь по согласию кооператива. В этом случае другие члены кооператива пользуются преобладающим правом покупки такого пая (его части). Порядок отчуждения пая или его части другому члену кооператива или третьему лицу устанавливается уставом кооператива и законом.
4. В случае смерти члена производственного кооператива его наследники могут быть приняты в члены кооператива, если другое не установлено уставом кооператива. За отказы принять наследников в члены кооператива кооператив выплачивает наследникам стоимость пая умершего члена кооператива.
5. Обращение взыскания на пай члена производственного кооператива по его собственным обязательствам допускается лишь в случае недостаточности у него другого имущества в порядке, установленном уставом кооператива и законом.
6. В случае обращения залогодержателем взыскания на пай члена производственного кооператива, который передан в залог, применяются положение части третьей этой статьи.
"""

GKU_g_9 = """ 
Глава 9 - Гражданского кодекса
Правовые формы участия государства, АР Крым, территориальных общин в гражданских отношениях

Статья 167. Правовые формы участия государства в гражданских отношениях
1. Государство действует в гражданских отношениях на равных правах с другими участниками этих отношений.
2. Государство может создавать юридические лица публичного права (государственные предприятия, учебные заведения и т.п.) в случаях и в порядке, установленных Конституцией Украины и законом.
3. Государство может создавать юридические лица частного права (предпринимательские общества и т.п.), принимать участие в их деятельности на общих основаниях, если другое не установлено законом

Статья 168. Правовые формы участия Автономной Республики Крым в гражданских отношениях
1. Автономная Республика Крым действует в гражданских отношениях на равных правах с другими участниками этих отношений.
2. Автономная Республика Крым может создавать юридические лица публичного права (учебные заведения и т.п.) в случаях и в порядке, установленных Конституцией Украины и законом.
3. Автономная Республика Крым может создавать юридические лица частного права (предпринимательские общества и т.п.), принимать участие в их деятельности на общих основаниях, если другое не установлено законом

Статья 169. Правовые формы участия территориальных общин в гражданских отношениях
1. Территориальные общины действуют в гражданских отношениях на равных правах с другими участниками этих отношений.
2. Территориальные общины могут создавать юридические лица публичного права (коммунальные предприятия, общие коммунальные предприятия, учебные заведения и т.п.) в случаях и в порядке, установленных Конституцией Украины и законом.
3. Территориальные общины могут создавать юридические лица частного права (предпринимательские общества и т.п.), принимать участие в их деятельности на общих основаниях, если другое не установлено законом.
"""

GKU_g_10 = """ 
Глава 10 - Гражданского кодекса
Органы и представители, через которых действуют государство, АР Крым, территориальные общины в гражданских отношениях

Статья 170. Органы, через которых действует государство в гражданских отношениях
1. Государство приобретает и осуществляет гражданские права и обязанности через органы государственной власти в границах их компетенции, установленной законом.

Статья 171. Органы, через которых действует Автономная Республика Крым в гражданских отношениях
1. Автономная Республика Крым приобретает и осуществляет гражданские права и обязанности через органы власти Автономной Республики Крым в границах их компетенции, установленной законом.

Статья 172. Органы, через которых действуют территориальные общины в гражданских отношениях
1. Территориальные общины приобретают и осуществляют гражданские права и обязанности через органы местного самоуправления в границах их компетенции, установленной законом.

Статья 173. Представители государства, Автономной Республики Крым, территориальных общин
1. В случаях и в порядке, установленных законом, другими нормативно-правовыми актами, от лица государства, Автономной Республики Крым, территориальных общин за специальными поручениями могут выступать физические и юридические лица, органы государственной власти, органы власти Автономной Республики Крым и органы местного самоуправления.
2. Государство приобретает и осуществляет гражданские права и обязанности через органы государственной власти в границах их компетенции, установленной законом.
3. Автономная Республика Крым приобретает и осуществляет гражданские права и обязанности через органы власти Автономной Республики Крым в границах их компетенции, установленной законом.
4. Территориальные общины приобретают и осуществляют гражданские права и обязанности через органы местного самоуправления в границах их компетенции, установленной законом.
5. В случаях и в порядке, установленных законом, другими нормативно-правовыми актами, от лица государства, Автономной Республики Крым, территориальных общин за специальными поручениями могут выступать физические и юридические лица, органы государственной власти, органы власти Автономной Республики Крым и органы местного самоуправления.
"""

GKU_g_11 = """ 
Глава 11 - Гражданского кодекса
Ответственность по обязательствам государства, АР Крым, территориальных общин

Статья 174. Ответственность по обязательствам государства
1. Государство отвечает по своим обязательствам своим имуществом, кроме имущества, на которое в соответствии с законом не может быть совершено взыскания.

Статья 175. Ответственность по обязательствам территориальных общин
1. Территориальные общины отвечают по своим обязательствам своим имуществом, кроме имущества, на которое в соответствии с законом не может быть совершено взыскания.

Статья 176. Размежевание ответственности по обязательствам государства, АР Крым, территориальных общин и созданных ими юридических лиц
1. Государство, Автономная Республика Крым, территориальные общины не отвечают по обязательствам созданных ими юридических лиц, кроме случаев, установленных законом.
2. Юридические лица, созданные государством, Автономной Республикой Крым, территориальными общинами, не отвечают по обязательствам соответственно государства, Автономной Республики Крым, территориальных общин.
3. Государство не отвечает по обязательствам Автономной Республики Крым и территориальных общин.
4. Автономная Республика Крым не отвечает по обязательствам государства и территориальных общин.
5. Территориальная община не отвечает по обязательствам государства, Автономной Республики Крым и других территориальных общин.
"""

GKU_g_12 = """ 

"""
GKU_g_13 = """ 

"""
GKU_g_14 = """ 

"""
GKU_g_15 = """ """
GKU_g_16 = """ """
GKU_g_17 = """ """
GKU_g_18 = """ """
GKU_g_19 = """ """
GKU_g_20 = """ """
GKU_g_21 = """ """
GKU_g_22 = """ """
GKU_g_23 = """ """
GKU_g_24 = """ """
GKU_g_25 = """ """
GKU_g_26 = """ """
GKU_g_27 = """ """
GKU_g_28 = """ """
GKU_g_29 = """ """
GKU_g_30 = """ """
GKU_g_31 = """ """
GKU_g_32 = """ """
GKU_g_33 = """ """
GKU_g_34 = """ """
GKU_g_35 = """ """
GKU_g_36 = """ """
GKU_g_37 = """ """
GKU_g_38 = """ """
GKU_g_39 = """ """
GKU_g_40 = """ """
GKU_g_41 = """ """
GKU_g_42 = """ """
GKU_g_43 = """ """
GKU_g_44 = """ """
GKU_g_45 = """ """
GKU_g_46 = """ """
GKU_g_47 = """ """
GKU_g_48 = """ """
GKU_g_49 = """ """
GKU_g_50 = """ """
GKU_g_51 = """ """
GKU_g_52 = """ """
GKU_g_53 = """ """
GKU_g_54 = """ """
GKU_g_55 = """ """
GKU_g_56 = """ """
GKU_g_57 = """ """
GKU_g_58 = """ """
GKU_g_59 = """ """
GKU_g_60 = """ """
GKU_g_61 = """ """
GKU_g_62 = """ """
GKU_g_63 = """ """
GKU_g_64 = """ """
GKU_g_65 = """ """
GKU_g_66 = """ """
GKU_g_67 = """ """
GKU_g_68 = """ """
GKU_g_69 = """ """
GKU_g_70 = """ """
GKU_g_71 = """ """
GKU_g_72 = """ """
GKU_g_73 = """ """
GKU_g_74 = """ """
GKU_g_75 = """ """
GKU_g_76 = """ """
GKU_g_77 = """ """
GKU_g_78 = """ """
GKU_g_79 = """ """
GKU_g_80 = """ """
GKU_g_81 = """ """
GKU_g_82 = """ """
GKU_g_83 = """ """
GKU_g_84 = """ """
GKU_g_85 = """ """
GKU_g_86 = """ """
GKU_g_87 = """ """
GKU_g_88 = """ """
GKU_g_89 = """ """
GKU_g_90 = """ """