GKU_g_1 = """ 
Книга первая - Общие положения Гражданского кодекса
Глава 1 - Гражданского кодекса
Гражданское законодательство Украины

Статья 1. Отношения, которые регулируются гражданским законодательством
1. Гражданским законодательством регулируются личные неимущественные и имущественные отношения (гражданские отношения), основанные на юридическом равенстве, свободном волеизъявлении, имущественной независимости их участников.
2. К имущественным отношениям, основанным на административном или другом властном подчинении одной стороны второй стороне, а также к налоговым, бюджетным отношениям гражданское законодательство не применяется, если другое не установлено законом.

Статья 2. Участники гражданских отношений
1. Участниками гражданских отношений являются физические лица и юридические лица (далее - лица).
2. Участниками гражданских отношений являются: государство Украина, Автономная Республика Крым, территориальные общины, иностранные государства и прочие субъекты публичного права.

Статья 3. Общие принципы гражданского законодательства
1. Общими принципами гражданского законодательства являются:
недопустимость своевольного вмешательства в сферу личной жизни человека;
недопустимость лишения права собственности, кроме случаев, установленных Конституцией Украины и законом;
свобода договора;
свобода предпринимательской деятельности, которая не запрещена законом;
судебная защита гражданских прав и интересов;
справедливость, добросовестность и разумность.

Статья 4. Акты гражданского законодательства Украины
1. Основу гражданского законодательства Украины составляет Конституция Украины.
2. Основным актом гражданского законодательства Украины является Гражданский кодекс Украины.
Актами гражданского законодательства являются также другие законы Украины, которые принимаются согласно Конституции Украины и этого Кодекса (далее - закон).
Если субъект права законодательной инициативы подал в Верховный Совет Украины проект закона, который регулирует гражданские отношения иначе, чем этот Кодекс, он обязан одновременно подать проект закона о внесении изменений в Гражданский кодекс Украины. Поданый законопроект рассматривается Верховным Советом Украины одновременно с соответствующим проектом закона о внесении изменений в Гражданский кодекс Украины.
3. Гражданские отношения могут регулироваться актами Президента Украины в случаях, установленных Конституцией Украины
4. Актами гражданского законодательства являются также постановления Кабинета Министров Украины.
Если постановление Кабинета Министров Украины противоречит положениям этого Кодекса или другому закону, применяются соответствующие положения этого Кодекса или другого закона.
5. Другие органы государственной власти Украины, органы власти Автономной Республики Крым могут выдавать нормативно-правовые акты, которые регулируют гражданские отношения, лишь в случаях и в границах, установленных Конституцией Украины  и законом.
6. Гражданские отношения регулируются одинаково на всей территории Украины.

Статья 5. Действие актов гражданского законодательства во времени
1. Акты гражданского законодательства регулируют отношения, которые возникли со дня вступления их в силу.
2. Акт гражданского законодательства не имеет обратного действия во времени, кроме случаев, когда он смягчает или отменяет гражданскую ответственность лица.
3. Если гражданские отношения возникли раньше и регулировались актом гражданского законодательства, утратившего силу, новый акт гражданского законодательства применяется к правам и обязанностям, которые возникли с момента вступления его в силу.

Статья 6. Акты гражданского законодательства и договор
1. Стороны имеют право заключить договор, который не предусмотрен актами гражданского законодательства, но отвечает общим основам гражданского законодательства.
2. Стороны имеют право урегулировать в договоре, который предусмотрен актами гражданского законодательства, свои отношения, которые не урегулированы этими актами.
3. Стороны в договоре могут отступить от положений актов гражданского законодательства и урегулировать свои отношения на собственное усмотрение.
Стороны в договоре не могут отступить от положений актов гражданского законодательства, если в этих актах прямо сказано об этом, а также в случае, если обязательность для сторон положений актов гражданского законодательства вытекает из их содержания или из сути отношений между сторонами.
4. Положение частей первой, второй и третьей этой статьи применяются и к односторонним сделкам.

Статья 7. Обычай
1. Гражданские отношения могут регулироваться обычаем, в частности обычаем делового оборота.
Обычаем является правило поведения, которое не установлено актами гражданского законодательства, но является устоявшимся в определенной сфере гражданских отношений.
Обычай может быть зафиксирован в соответствующем документе.
2. Обычай, который противоречит договору или актам гражданского законодательства, в гражданских отношениях не применяется.

Статья 8. Аналогия
1. Если гражданские отношения не урегулированы этим Кодексом, другими актами гражданского законодательства или договором, они регулируются теми правовыми нормами этого Кодекса, других актов гражданского законодательства, которые регулируют похожие по смыслу гражданские отношения (аналогия закона).
2. В случае невозможности использовать аналогию закона для регулирования гражданских отношений они регулируются согласно общим основам гражданского законодательства (аналогия права).

Статья 9. Применение Гражданского кодекса Украины к урегулированию отношений в сферах хозяйствования, использования природных ресурсов, охраны окружающей среды, а также к трудовым и семейным отношениям
1. Положения этого Кодекса применяются к урегулированию отношений, которые возникают в сферах использования естественных ресурсов и охраны окружающей среды, а также к трудовым и семейным отношениям, если они не урегулированы другими актами законодательства.
2. Законом могут быть предусмотрены особенности регулирования имущественных отношений в сфере хозяйствования.

Статья 10. Международные договора
1. Действующий международный договор, который регулирует гражданские отношения, согласие на обязательность которого дано Верховной Радой Украины, является частью национального гражданского законодательства Украины.
2. Если в действующем международном договоре Украины, составленном в установленном законом порядке, содержатся другие правила, чем установленные соответствующим актом гражданского законодательства, применяются правила соответствующего международного договора Украины."""

GKU_g_2 = """
Глава 2 - Гражданского кодекса
Основания возникновения гражданских прав и обязанностей. Осуществление гражданских прав и выполнение обязанностей

Статья 11. Основания возникновения гражданских прав и обязанностей
1. Гражданские права и обязанности возникают из действий лиц, предусмотренных актами гражданского законодательства, а также из действий лиц, не предусмотренных этими актами, но по аналогии порождают гражданские права и обязанности.
2. Основаниями возникновения гражданских прав и обязанностей, в частности, являются:
договоры и прочие сделки;
создание литературных, художественных произведений, изобретений и других результатов интеллектуальной, творческой деятельности;
нанесение имущественного (материального) и морального ущерба другому лицу;
другие юридические факты.
3. Гражданские права и обязанности могут возникать непосредственно из актов гражданского законодательства.
4. В случаях, установленных актами гражданского законодательства, гражданские права и обязанности возникают непосредственно из актов органов государственной власти, органов власти Автономной Республики Крым или органов местного самоуправления.
5. В случаях, установленных актами гражданского законодательства, гражданские права и обязанности могут возникать по решению суда.
6. В случаях, установленных актами гражданского законодательства или договором, основанием возникновения гражданских прав и обязанностей может быть наступление или ненаступление определенного события.

Статья 12. Осуществление гражданских прав
1. Лицо осуществляет свои гражданские права свободно, по собственному усмотрению.
2. Неосуществление лицом своих гражданских прав не является основанием для их прекращения, кроме случаев, установленных законом.
3. Лицо может отказаться от своего имущественного права.
Отказ от права собственности на транспортные средства, животных, недвижимое имущество осуществляется в порядке, установленном актами гражданского законодательства.
4. Лицо может по возмездному или безвозмездному договору передать свое имущественное право другому лицу, кроме случаев, установленных законом.
5. Если законом установлены правовые последствия недобросовестного или неразумного осуществления лицом своего права, считается, что поведение лица является добросовестным и разумным, если другое не установлено судом.

Статья 13. Границы осуществления гражданских прав
1. Гражданские права лицо осуществляет в границах, предоставленных ему договором или актами гражданского законодательства.
2. При осуществлении своих прав лицо обязанно воздержаться от действий, которые могли бы нарушить права других лиц, нанести ущерб окружающей среде или культурному наследию.
3. Не допускаются действия лица, совершаемые с намерением нанести ущерб другому лицу, а также злоупотребление правом в других формах.
4. При осуществлении гражданских прав лицо должно придерживаться моральных основ общества.
5. Не допускается использование гражданских прав с целью неправомерного ограничения конкуренции, злоупотребления монопольным положением на рынке, а также недобросовестная конкуренция.
6. В случае несоблюдения лицом при осуществлении своих прав требований, установленных частями второй - пятой этой статьи, суд может обязать его прекратить злоупотребление своими правами, а также применить другие последствия, установленные законом.

Статья 14. Выполнение гражданских обязанностей
1. Гражданские обязанности выполняются в границах, установленных договором или актом гражданского законодательства.
2. Лицо не может быть принуждено к действиям, совершение которых не является для него обязательным.
3. Выполнение гражданских обязанностей обеспечивается средствами поощрения и ответственностью, которые установлены договором или актом гражданского законодательства.
4. Лицо может быть освобождено от гражданской обязанности или ее выполнения в случаях, установленных договором или актами гражданского законодательства. 
"""

GKU_g_3 = """
Глава 3 - Гражданского кодекса
Защита гражданских прав и интересов

Статья 15. Право на защиту гражданских прав и интересов
1. Каждое лицо имеет право на защиту своего гражданского права в случае его нарушения, непризнания или оспаривания.
2. Каждое лицо имеет право на защиту своего интереса, который не противоречит общим основам гражданского законодательства.

Статья 16. Защита гражданских прав и интересов в суде
1. Каждое лицо имеет право обратиться в суд за защитой своего личного неимущественного или имущественного права и интереса.
2. Способами защиты гражданских прав и интересов могут быть:
признание права;
признание сделки недействительной;
прекращение действия, которое нарушает право;
восстановление положения, которое существовало до нарушения;
принудительное выполнение обязанности в натуре;
изменение правоотношения;
прекращение правоотношения;
возмещение убытков и прочие способы возмещения имущественного ущерба;
возмещение морального (неимущественного) ущерба;
признание незаконными решения, действий или бездеятельности органа государственной власти, органа власти Автономной Республики Крым или органа местного самоуправления, их должностных и служебных лиц.
Суд может защитить гражданское право или интерес другим способом, установленным договором или законом или судом в определенных законом случаях.
3. Суд может отказать в защите гражданского права и интереса лица в случае нарушения им положений частей второй - пятой статьи 13 этого Кодекса.

Статья 17. Защита гражданских прав и интересов Президентом Украины, органами государственной власти, органами власти Автономной Республики Крым или органами местного самоуправления
1. Президент Украины осуществляет защиту гражданских прав и интересов в пределах полномочий, определенных Конституцией Украины
2. В случаях, установленных Конституцией Украины и законом, лицо имеет право обратиться за защитой гражданского права и интереса в орган государственной власти, орган власти Автономной Республики Крым или орган местного самоуправления.
3. Орган государственной власти, орган власти Автономной Республики Крым или орган местного самоуправления осуществляют защиту гражданских прав и интересов в пределах, на основаниях и способом, которые установлены Конституцией Украины и законом.
Решение, принятое указанными органами относительно защиты гражданских прав и интересов, не является препятствием для обращения за их защитой в суд.

Статья 18. Защита гражданских прав нотариусом
1. Нотариус осуществляет защиту гражданских прав путем совершения исполнительной надписи на долговом документе в случаях и в порядке, установленных законом.

Статья 19. Самозащита гражданских прав
1. Лицо имеет право на самозащиту своего гражданского права и права другого лица от нарушений и противоправных посягательств.
Самозащитой является применение лицом способов противодействий, которые не запрещены законом и не противоречат моральным принципам общества.
2. Способы самозащиты должны соответствовать содержанию нарушенного права, характеру действий, которыми оно нарушено, а также последствиями, которые вызваны этим нарушением.
Способы самозащиты могут выбираться самим лицом или устанавливаться договором или актами гражданского законодательства.

Статья 20. Осуществление права на защиту
1. Право на защиту лицо осуществляет на свое усмотрение.
2. Неосуществление лицом права на защиту не является основанием для прекращения затронутого гражданского права, кроме случаев, установленных законом.

Статья 21. Признание незаконным правового акта органа государственной власти, органа власти Автономной Республики Крым или органа местного самоуправления
1. Суд признает незаконным и отменяет правовой акт индивидуального действия, выданный органом государственной власти, органом власти Автономной Республики Крым или органом местного самоуправления, если он противоречит актам гражданского законодательства и нарушает гражданские права или интересы.
2. Суд признает незаконным и отменяет нормативно-правовой акт органа государственной власти, органа власти Автономной Республики Крым или органа местного самоуправления, если он противоречит актам гражданского законодательства и нарушает гражданские права или интересы.

Статья 22. Возмещение убытков и прочие способы возмещения имущественного ущерба
1. Лицо, которому причинен ущерб в результате нарушения его гражданского права, имеет право на его возмещение.
2. Ущербом является:
потери, которые лицо понесло в связи с уничтожением или повреждением вещи, а также затраты, которые лицо понесло или должно понести для восстановления своего нарушенного права (реальные убытки);
доходы, которые лицо могло бы реально получить при обычных обстоятельствах, если бы его право не было нарушено (упущенная выгода).
3. Убытки возмещаются в полном объеме, если договором или законом не предусмотрено возмещение в меньшем или в большем размере.
Если лицо, которое нарушило право, получило в связи с этим доходы, то размер упущенной выгоды, которая может возмещаться лицу, право которого нарушено, не может быть меньше доходов, полученных лицом, которое нарушило право.
4. По требованию лица, которому причинен вред, и в соответствии с обстоятельствами дела имущественный вред может быть возмещен и другим способом, в частности, ущерб, нанесенный имуществу, может возмещаться в натуре (передача вещи того же рода и того же качества, исправление поврежденной вещи и т.п.), если иное не установлено законом.

Статья 23. Возмещение морального ущерба
1. Лицо имеет право на возмещение морального ущерба, причиненного вследствие нарушения его прав.
2. Моральный ущерб состоит:
в физической боли и страданиях, которые физическое лицо испытывает всвязи с увечьем или другим повреждением здоровья;
в душевных страданиях, которые физическое лицо испытывает в связи с противоправным поведением относительно его самого, членов его семьи или близких родственников;
в душевных страданиях, которые физическое лицо испытало в связи с уничтожением или повреждением его имущества;
в унижении чести и достоинства физического лица, а также деловой репутации физического или юридического лица.
3. Если иное не установлено законом, моральный вред возмещается денежными средствами, другим имуществом или другим способом.
Размер денежного возмещения морального ущерба определяется судом в зависимости от характера правонарушения, глубины физических и душевных страданий, ухудшения способностей потерпевшего или лишение его возможности их реализации, степени вины лица, которое нанесло моральный ущерб, если вина является основанием для возмещения, а также с учетом других обстоятельств, которые имеют существенное значение. При определении размера возмещения учитываются требования разумности и справедливости.
4. Моральный ущерб возмещается независимо от имущественного ущерба, который подлежит возмещению, и не связан с размером этого возмещения.
5. Моральный ущерб возмещается единоразово, если другое не установлено договором или законом. 
"""

GKU_g_4 = """
Глава 4 - Гражданского кодекса
Общие положения о физическом лице

Статья 24. Понятие физического лица
1. Человек как участник гражданских отношений считается физическим лицом.

Статья 25. Гражданская правоспособность физического лица
1. Способность иметь гражданские права и обязанности (гражданскую правоспособность) имеют все физические лица.
2. Гражданская правоспособность физического лица возникает в момент его рождения.
В случаях, установленных законом, охраняются интересы зачатого, но еще не родившегося ребенка.
3. В случаях, установленных законом, способность иметь отдельные гражданские права и обязанности может связываться с достижением физическим лицом соответствующего возраста
4. Гражданская правоспособность физического лица прекращается в момент его смерти.

Статья 26. Объем гражданской правоспособности физического лица
1. Все физические лица равны в способности иметь гражданские права и обязанности.
2. Физическое лицо имеет все личные неимущественные права, установленные Конституцией Украины и этим Кодексом.
3. Физическое лицо способно иметь все имущественные права, установленные этим Кодексом, другим законом.
4. Физическое лицо способно иметь другие гражданские права, не установленные Конституцией Украины, этим Кодексом, другим законом, если они не противоречат законам и моральным устоям общества.
5. Физическое лицо способно иметь обязанности как участник гражданских отношений.

Статья 27. Предотвращение ограничения способности физического лица иметь гражданские права и обязанности
1. Сделка, ограничивающая возможность физического лица иметь не запрещенные законом гражданские права и обязанности, являются ничтожной.
2. Правовой акт Президента Украины, органа государственной власти, органа власти Автономной Республики Крым, органа местного самоуправления, их должностных и служебных лиц не может ограничивать возможность физического лица иметь не запрещенные законом гражданские права и обязанности, кроме случаев, когда такое ограничение предусмотрено Конституцией Украины.

Статья 28. Имя физического лица
1. Физическое лицо приобретает права и обязанности и осуществляет их под своим именем.
Имя физического лица, которое является гражданином Украины, состоит из фамилии, собственного имени и отчества, если другое не вытекает из закона или обычая национального меньшинства, к которому оно принадлежит.
2. При осуществлении отдельных гражданских прав физическое лицо в соответствии с законом может использовать псевдоним (выдуманное имя) или действовать без указания имени.
3. Имя физическому лицу предоставляется в соответствии с законом.

Статья 29. Место проживания физического лица
1. Местом жительства физического лица является жилье, в котором он проживает постоянно или временно.
2. Физическое лицо, достигшее четырнадцати лет, свободно выбирает себе место проживания, за исключением ограничений, которые устанавливаются законом.
3. Местом проживания физического лица в возрасте от десяти до четырнадцати лет является место жительства его родителей (усыновителей) или одного из них, с кем оно проживает, опекуна или место нахождения учебного заведения или учреждения здравоохранения и т.п., в котором оно проживает, если другое место жительства не установлено по согласию между ребенком и родителями (усыновителями, опекуном) или организацией, которая выполняет относительно него функции опекуна.
В случае спора место проживания физического лица в возрасте от десяти до четырнадцати лет определяется органом опеки и попечительства или судом.
4. Местом проживания физического лица, которое не достигло десяти лет, является место проживания его родителей (усыновителей) или одного из них, с кем оно проживает, опекуна или местонахождение учебного заведения или учреждения здравоохранения, в котором оно проживает.
5. Местожительством недееспособного лица является местожительство его опекуна или местонахождение соответствующей организации, которая выполняет относительно него функции опекуна.
6. Физическое лицо может иметь несколько мест проживания.

Статья 30. Гражданская дееспособность физического лица
1. Гражданскую дееспособность имеет физическое лицо, которое сознает значение своих действий и может руководить ими.
Гражданской дееспособностью физического лица является его способность своими действиями приобретать для себя гражданские права и самостоятельно их осуществлять, а также способность своими действиями создавать для себя гражданские обязанности, самостоятельно их выполнять и нести ответственность в случае их невыполнения.
2. Объем гражданской дееспособности физического лица устанавливается этим Кодексом и может быть ограничен исключительно в случаях и в порядке, установленных законом.

Статья 31. Частичная гражданская дееспособность физического лица, не достигшего четырнадцати лет
1. Физическое лицо, которое не достигло четырнадцати лет (малолетнее лицо), имеет право:
1) самостоятельно совершать мелкие бытовые сделки.
Сделка считается мелкой бытовой, если она удовлетворяет бытовые потребности лица, отвечает его физическому, духовному или социальному развитию и касается предмета, который имеет невысокую стоимость;
2) осуществлять личные неимущественные права в результате интеллектуальной, творческой деятельности, которые охраняются законом.
2. Малолетнее лицо не несет ответственности за причиненный им вред.

Статья 32. Неполная гражданская дееспособность физического лица в возрасте от четырнадцати до восемнадцати лет
1. Кроме сделок, предусмотренных статьей 31 этого Кодекса, физическое лицо в возрасте от четырнадцати до восемнадцати лет (несовершеннолетнее лицо) имеет право:
самостоятельно распоряжаться своим заработком, стипендией или другими доходами;
самостоятельно осуществлять права на результаты интеллектуальной, творческой деятельности, которые охраняются законом;
быть участником (основателем) юридических лиц, если это не запрещено законом или учредительными документами юридического лица;
самостоятельно заключать договор банковского вклада (счета) и распоряжаться вкладом, внесенным им на свое имя (денежными средствами на счету).
2. Несовершеннолетнее лицо совершает другие сделки по согласию родителей (усыновителей) или попечителей.
На совершение несовершеннолетним лицом cделки относительно транспортных средств или недвижимого имущества должно быть письменное нотариально удостоверенное согласие родителей (усыновителей) или попечителя и разрешение органа опеки и попечительства.
3. Несовершеннолетнее лицо может распоряжаться денежными средствами, которые внесены полностью или частично другими лицами в финансовое учреждение на его имя, с согласия органа опеки и попечительства и родителей (усыновителей) или попечителя.
4. Согласие на совершение несовершеннолетним лицом сделки должно быть получено от родителей (усыновителей) или попечителя и органа опеки и попечительства в соответствии с законом.
5. При наличии достаточных оснований суд по заявлению родителей (усыновителей), попечителя, органа опеки и попечительства может ограничить право несовершеннолетнего лица самостоятельно распоряжаться своим заработком, стипендией или другими доходами или лишить его этого права.
Суд отменяет свое решение об ограничении или лишении этого права, если исчезли обстоятельства, которые были основанием для его принятия.
6. Порядок ограничения гражданской дееспособности несовершеннолетнего лица устанавливается Гражданским процессуальным кодексом Украины.

Статья 33. Гражданская ответственность несовершеннолетнего лица
1. Несовершеннолетнее лицо лично несет ответственность за нарушение договора, заключенного им самостоятельно согласно закону.
2. Несовершеннолетнее лицо лично несет ответственность за нарушение договора, заключенного по согласию родителей (усыновителей), попечителя. Если у несовершеннолетнего лица недостаточно имущества для возмещения убытков, дополнительную ответственность несут его родители (усыновители) или попечитель.
3. Несовершеннолетнее лицо несет ответственность за вред, причиненный им другому лицу, согласно статье 1179 этого Кодекса.

Статья 34. Полная гражданская дееспособность
1. Полную гражданскую дееспособность имеет физическое лицо, которое достигло восемнадцати лет (совершеннолетие).
2. В случае регистрации брака физического лица, которое не достигло совершеннолетия, оно приобретает полную гражданскую дееспособность из момента регистрации брака.
В случае прекращения брака до достижения физическим лицом совершеннолетия, приобретенная им полная гражданская дееспособность сохраняется.
В случае признания брака недействительным на основаниях, не связанных с противоправным поведением несовершеннолетнего лица, приобретенная им полная гражданская дееспособность сохраняется.

Статья 35. Предоставление полной гражданской дееспособности
1. Полная гражданская дееспособность может быть предоставлена физическому лицу, которое достигло шестнадцати лет и работает по трудовому договору, а также несовершеннолетнему лицу, которое записано матерью или отцом ребенка.
2. Предоставление полной гражданской дееспособности происходит по решению органа опеки и попечительства по заявлению заинтересованного лица при письменном согласии родителей (усыновителей) или попечителя, а в случае отсутствия такого согласия полная гражданская дееспособность может быть предоставлена по решению суда.
3. Полная гражданская дееспособность может быть предоставлена физическому лицу, которое достигло шестнадцати лет и которое желает заниматься предпринимательской деятельностью.
При наличии письменного согласия на это родителей (усыновителей), опекуна или органа опеки и попечительства такое лицо может быть зарегистрировано как предприниматель. В этом случае физическое лицо приобретает полную гражданскую дееспособность с момента государственной регистрации его как предпринимателя.
4. Полная гражданская дееспособность, предоставленная физическому лицу, распространяется на все гражданские права и обязанности.
5. В случае прекращения трудового договора, прекращения физическим лицом предпринимательской деятельности предоставленная ему полная гражданская дееспособность сохраняется.

Статья 36. Ограничение гражданской дееспособности физического лица
1. Суд может ограничить гражданскую дееспособность физического лица, если оно страдает психическим расстройством, которое существенным образом влияет на его способность сознавать значение своих действий и (или) руководить ими.
2. Суд может ограничить гражданскую дееспособность физического лица, если оно злоупотребляет спиртными напитками, наркотическими средствами, токсичными веществами, азартными играми и т.д. и тем ставит себя или свою семью, а также других лиц, которых оно по закону обязано содержать, в тяжелое материальное положение.
3. Порядок ограничения гражданской дееспособности физического лица устанавливается Гражданским процессуальным кодексом Украины
4. Гражданская дееспособность физического лица является ограниченной из момента вступления в законную силу решения суда об этом.

Статья 37. Правовые последствия ограничения гражданской дееспособности физического лица
1. Над физическим лицом, гражданская дееспособность которого ограничена, устанавливается попечительство.
2. Физическое лицо, гражданская дееспособность которого ограничена, может самостоятельно совершать лишь мелкие бытовые сделки.
3. Сделки относительно распоряжения имуществом и прочие сделки, которые выходят за пределы мелких бытовых, совершаются лицом, гражданская дееспособность которого ограничена, по согласию попечителя.
Отказ опекуна дать согласие на совершение сделок, выходящих за пределы мелких бытовых, может быть обжалован лицом, гражданская дееспособность которого ограничена, в органе опеки и попечительства или в суде.
4. Получение заработка, пенсии, стипендии, других доходов лица, с ограниченной гражданской дееспособностью, и распоряжение ими осуществляются попечителем. Попечитель может письменно разрешить физическому лицу с ограниченной гражданской дееспособностью, самостоятельно получать заработок, пенсию, стипендию, другие доходы и распоряжаться ими.
5. Лицо с ограниченной гражданской дееспособностью, самостоятельно несет ответственность за нарушение им договора, заключенного с согласия попечителя, и за вред, который причинен им другому лицу.

Статья 38. Возобновление гражданской дееспособности физического лица с ограниченной гражданской дееспособностью
1. В случае выздоровления физического лица с ограниченной гражданской дееспособностью, или такого улучшения его психического состояния, которое восстановило в полном объеме его способность осознавать значение своих действий и (или) руководить ими, суд возобновляет его гражданскую дееспособность.
2. В случае прекращения физическим лицом злоупотребления спиртными напитками, наркотическими средствами, токсичными веществами, азартными играми и т.п. суд возобновляет его гражданскую дееспособность.
3. Попечительство, установленное над физическим лицом, прекращается на основании решения суда о возобновлении гражданской дееспособности.
4. Порядок возобновления гражданской дееспособности физического лица с ограниченной гражданской дееспособностью, устанавливается Гражданским процессуальным кодексом Украины.

Статья 39. Признание физического лица недееспособным
1. Физическое лицо может быть признано судом недееспособным, если оно вследствие хронического, стойкого психического расстройства не способно осознавать значение своих действий и (или) руководить ими.
2. Порядок признания физического лица недееспособным устанавливается Гражданским процессуальным кодексом Украины
3. Если суд откажет в удовлетворении заявления о признании лица недееспособным и будет установлено, что требование было заявлено недобросовестно без достаточного для этого основания, физическое лицо, которому такими действиями был причинен моральный ущерб, имеет право требовать от заявителя его возмещения.

Статья 40. Момент признания физического лица недееспособным
1. Физическое лицо признается недееспособным с момента вступления в законную силу решения суда об этом.
2. Если от времени возникновения недееспособности зависит признание недействительным брака, договора или другой сделки, суд с учетом вывода судебно-психиатрической экспертизы и других доказательств относительно психического состояния лица может определить в своем решении день, с которого оно признается недееспособным.

Статья 41. Правовые последствия признания физического лица недееспособным
1. Над недееспособным физическим лицом устанавливается опека.
2. Недееспособное физическое лицо не имеет права совершать любые сделки
3. Сделки от имени недееспособного физического лица и в его интересах совершает его опекун.
4. Ответственность за вред, причиненный недееспособным физическим лицом, несет его опекун (статья 1184 этого Кодекса).

Статья 42. Возобновление гражданской дееспособности физического лица, признанного недееспособным
1. По заявлению опекуна или органа опеки и попечительства суд возобновляет гражданскую дееспособность физического лица, которое было признано недееспособным, и прекращает опеку, если будет установлено, что вследствие выздоровления или значительного улучшения его психического состояния у него возобновилась способность осознавать значение своих действий и управлять ими.
2. Порядок восстановления гражданской дееспособности физического лица, которое было признано недееспособным, устанавливается Гражданским процессуальным кодексом Украины.

Статья 43. Признание физического лица безвестно отсутствующим
1. Физическое лицо может быть признано судом безвестно отсутствующим, если на протяжении одного года в месте его постоянного проживания нет сведений о месте его пребывания.
2. В случае невозможности установить день получения последних сведений о месте пребывания лица, началом его безвестного отсутствия считается первое число месяца, который идет за тем, в котором были получены такие сведения, а в случае невозможности установить этот месяц - первое января следующего года.
3. Порядок признания физического лица безвестно отсутствующим устанавливается Гражданским процессуальным кодексом Украины

Статья 44. Опека над имуществом физического лица, признанного безвестно отсутствующим, а также лица, пропавшего без вести
1. На основании решения суда о признании физического лица безвестно отсутствующим нотариус по последнему месту его проживания описывает принадлежащее ему имущество и устанавливает над ним опеку.
2. По заявлению заинтересованного лица или органа опеки и попечительства над имуществом лица, пропавшего без вести, опека может быть установлена нотариусом до принятия судом решения о признании его безвестно отсутствующим.
3. Опекун над имуществом физического лица, признанного безвестно отсутствующим, или лица, пропавшего без вести, принимает исполнение гражданских обязанностей в его пользу, погашает за счет его имущества долги, управляет этим имуществом в ее интересах.
4. По заявлению заинтересованного лица опекун над имуществом физического лица, признанного безвестно отсутствующим, или лица, пропавшего без вести, предоставляет за счет этого имущества содержание лицам, которых они по закону обязаны содержать.
5. Опека над имуществом прекращается в случае отмены решения суда о признании физического лица безвестно отсутствующим, а также в случае появления лица, пропавшего без вести.

Статья 45. Отмена решения суда о признании физического лица безвестно отсутствующим
1. Если физическое лицо, признанное безвестно отсутствующим, объявилось или если получены сведения о месте его пребывания, суд по месту его пребывания или суд, который постановил решения о признании этого лица безвестно отсутствующим, по заявлению этого лица или другого заинтересованного лица отменяет решение о признании физического лица безвестно отсутствующим.

Статья 46. Объявление физического лица умершим
1. Физическое лицо может быть объявлено судом умершим, если на месте его постоянного проживания нет сведений о месте его пребывания в течение трех лет, а если оно пропало без вести при обстоятельствах, угрожавших ему смертью или дающих основание предполагать его гибель от определенного несчастного случая, - в течение шести месяцев, а при возможности считать физическое лицо погибшим от определенного несчастного случая или других обстоятельств вследствие чрезвычайных ситуаций техногенного и природного характера - втечение одного месяца после завершения работы специальной комиссии, созданной в результате чрезвычайных ситуаций техногенного и природного характера.
2. Физическое лицо, пропала без вести в связи с военными действиями, вооруженным конфликтом, может быть объявлен судом умершим по истечении двух лет со дня окончания военных действий. С учетом конкретных обстоятельств дела суд может объявить физическое лицо умершим и до истечения этого срока, но не ранее истечения шести месяцев.
3. Физическое лицо объявляется умершим со дня вступления в законную силу решения суда об этом. Физическое лицо, пропала без вести при обстоятельствах, угрожавших ему смертью или дающих основания предполагать его гибель от определенного несчастного случая или в связи с военными действиями, вооруженным конфликтом, может быть объявлено умершим со дня его возможной смерти.
4. Порядок объявления физического лица умершим устанавливается Гражданским процессуальным кодексом Украины.

Статья 47. Правовые последствия объявления физического лица умершим
1. Правовые последствия объявления физического лица умершим приравниваются к правовым последствиям, которые наступают в случае смерти.
2. Наследники физического лица, объявленного умершим, не имеют права отчуждать на протяжении пяти лет недвижимое имущество, которое перешло к ним в связи с открытием наследства.
Нотариус, который выдал наследнику свидетельство о праве на наследство на недвижимое имущество, накладывает на него запрет отчуждения.

Статья 48. Правовые последствия появления физического лица, которое было объявлено умершим
1. Если физическое лицо, объявленное умершим, объявилось или если получены сведения о месте его пребывания, суд по месту пребывания этого лица или суд, который постановил решение об объявлении его умершим, по заявлению этого лица или другого заинтересованного лица отменяет решение суда об объявлении физического лица умершим.
2. Независимо от времени своего появления физическое лицо, объявленное умершим, имеет право требовать от лица, которое владеет его имуществом, возвращения этого имущества, если оно сохранилось и безвозмездно перешло к нему после объявления физического лица умершим, за исключением имущества, приобретенного по исковой давности, а также денег и ценных бумаг на предъявителя.
3. Лицо, к которому имущество перешло по оплатному договору, обязано возвратить его, если будет установлено, что на момент приобретения этого имущества оно знало, что физическое лицо, которое было объявлено умершим, живо.
В случае невозможности возвратить имущество в натуре лицу, которое было объявлено умершим, возмещается стоимость этого имущества.
4. Если имущество физического лица, которое было объявлено умершим и появилось, перешло в собственность государства, Автономной Республики Крым или территориальной общины и было реализовано им, этому лицу возвращается сумма, полученная от реализации этого имущества

Статья 49. Акты гражданского состояния
1. Актами гражданского состояния являются события и действия, которые неразрывно связаны с физическим лицом и начинают, изменяют, дополняют или прекращают его возможность быть субъектом гражданских прав и обязанностей.
2. Актами гражданского состояния являются рождение физического лица, установление его происхождения, обретение гражданства, выход из гражданства и его утрата, достижение соответствующего возраста, предоставление полной гражданской дееспособности, ограничение гражданской дееспособности, признание лица недееспособным, брак, расторжение брака, усыновление, лишение и возобновление родительских прав, изменение имени, инвалидность, смерть и т.п..
3. Государственной регистрации подлежат рождение физического лица и его происхождение, гражданство, брак, расторжение брака в случаях, предусмотренных законом, изменение имени, смерть.
4. Регистрация актов гражданского состояния производится в соответствии с законом.
Рождение физического лица и его происхождение, усыновление, лишение и восстановление родительских прав, брак, расторжение брака, изменение имени, смерть подлежат обязательному внесению в Государственный реестр актов гражданского состояния граждан в органах юстиции в порядке, определенном Кабинетом Министров Украины.
"""

GKU_g_5 = """
Глава 5 - Гражданского кодекса
Физическое лицо - предприниматель

Статья 50. Право физического лица на осуществление предпринимательской деятельности
1. Право на осуществление предпринимательской деятельности, которая не запрещена законом, имеет физическое лицо с полной гражданской дееспособностью.
Ограничения права физического лица на осуществление предпринимательской деятельности устанавливаются Конституцией Украины и законом.
2. Физическое лицо осуществляет свое право на предпринимательскую деятельность при условии его государственной регистрации в порядке, установленном законом.
Информация о государственной регистрации физических лиц - предпринимателей является открытой.
3. Если лицо начало предпринимательскую деятельность без государственной регистрации, заключив соответствующие договора, оно не имеет права оспаривать эти договора на том основании, что оно не является предпринимателем.

Статья 50-1. Обязанности физического лица - предпринимателя по обязательствам, связанным с прекращением его предпринимательской деятельности
1. Физическое лицо - предприниматель письменно уведомляет государственного администратора, кредиторов о принятом решении о прекращении его предпринимательской деятельности, порядок и срок заявления кредиторами своих требований, который не может составлять менее двух и более трех
месяцев со дня опубликования сообщения о принятии физическим лицом - предпринимателем решения о прекращении предпринимательской деятельности.
2. После внесения записи о принятии решения о прекращении предпринимательской деятельности физического лица - предпринимателя в Единый государственный реестр юридических лиц и физических лиц - предпринимателей уведомление о внесении записи в Единый государственный реестр юридических лиц и физических лиц - предпринимателей относительно решения физического лица - предпринимателя о прекращении им предпринимательской деятельности публикуется в специализированном печатном средстве массовой информации.
3. Каждое требование кредитора, в частности по уплате налогов, сборов, единого взноса на общеобязательное государственное социальное страхование, страховых средств в Пенсионный фонд Украины, фонды социального страхования, рассматривается физическим лицом - предпринимателем, после чего принимается соответствующее решение, которое направляется кредитору не позднее пятнадцати дней со дня получения физическим лицом - предпринимателем соответствующего требования кредитора.
4. Требования кредиторов, не признанные физическим лицом - предпринимателем, деятельность которого прекращается, если кредитор в месячный срок со дня получения уведомления о полном или
частичном отказе в признании его требований не обращался в суд с иском, и требования, в удовлетворении которых по решению суда кредитору отказано, а также требования, не удовлетворенные из-за отсутствия имущества, считаются погашенными.
В случае прекращения предпринимательской деятельности физического лица - предпринимателя требования его кредиторов удовлетворяются в следующей очередности:
1) в первую очередь удовлетворяются требования по возмещению вреда, причиненного увечьем, другим повреждением здоровья или смертью, и требования кредиторов, обеспеченные залогом или иным способом;
2) во вторую очередь удовлетворяются требования наемных работников, связанные с трудовыми отношениями, требования автора о плате за использование результата его интеллектуальной, творческой деятельности;
3) в третью очередь удовлетворяются требования по налогам, сборам (обязательным платежам), единого взноса на общеобязательное государственное социальное страхование, страховых средств в Пенсионный фонд Украины, фондов социального страхования, других сумм, связанных с такими обязательствами;
4) в четвертую очередь удовлетворяются все остальные требования.
Требования одной очереди удовлетворяются пропорционально сумме требований каждого кредитора этой очереди.
5. Предпринимательская деятельность физического лица - предпринимателя является прекращенной с даты внесения в Единый государственный реестр юридических лиц и физических лиц - предпринимателей записи о государственной регистрации прекращения такой деятельности.

Статья 51. Применение к предпринимательской деятельности физического лица нормативно-правовых актов, которые регулируют предпринимательскую деятельность юридических лиц
1. К предпринимательской деятельности физических лиц применяются нормативно-правовые акты, которые регулируют предпринимательскую деятельность юридических лиц, если другое не установлено законом или не вытекает из сути отношений.

Статья 52. Гражданско-правовая ответственность физического лица- предпринимателя
1. Физическое лицо - предприниматель отвечает по обязательствам, связанными с предпринимательской деятельностью, всем своим имуществом, кроме имущества, на которое согласно закона не может быть обращено взыскание.
2. Физическое лицо - предприниматель, которое находится в браке, отвечает по обязательствам, связанными с предпринимательской деятельностью, всем своим личным имуществом и долей в праве общей совместной собственности супругов, которая будет принадлежать ему при разделе этого имущества

Статья 53. Банкротство физического лица - предпринимателя
1. Физическое лицо, которое не в состоянии удовлетворить требования кредиторов, связанные с осуществлением им предпринимательской деятельности, может быть признано банкротом в порядке, установленном законом.

Статья 54. Управление имуществом, которое используется в предпринимательской деятельности, органом опеки и попечительства
1. Если физическое лицо - предприниматель признано безвестно отсутствующим, недееспособным или его гражданская дееспособность ограничена или если владельцем имущества, которое использовалось в предпринимательской деятельности, является несовершеннолетнее или малолетнее лицо, орган опеки и попечительства может назначить управителя этим имуществом.
Орган опеки и попечительства заключает с управителем договор об управлении этим имуществом.
2. При осуществлении полномочий относительно управления имуществом управитель действует от своего имени в интересах лица, которое является владельцем имущества.
3. В договоре об управлении имуществом устанавливаются права и обязанности управителя.
Орган опеки и попечительства осуществляет контроль за деятельностью управителя имуществом согласно правилам о контроле за деятельностью опекуна и попечителя.
4. Договор об управлении имуществом прекращается, если исчезли обстоятельства, на основании которых он был заключен.
"""

GKU_g_6 = """ 
Глава 6 - Гражданского кодекса
Опека и попечительство

Статья 55. Задачи опеки и попечительства
1. Опека и попечительство устанавливаются с целью обеспечения личных неимущественных и имущественных прав и интересов малолетних, несовершеннолетних лиц, а также совершеннолетних лиц, которые по состоянию здоровья не могут самостоятельно осуществлять свои права и исполнять обязанности.

Статья 56. Орган опеки и попечительства
1. Органами опеки и попечительства являются районные, районные в городах Киеве и Севастополе государственные администрации, исполнительные органы городских, районных в городах, сельских, поселковых советов.
2. Права и обязанности органов, на которые возложено осуществление опеки и попечительства, относительно обеспечения прав и интересов физических лиц, нуждающихся в опеке и попечительстве, устанавливаются законом и иными нормативными правовыми актами

Статья 57. Обязанность сообщать о физических лицах, которые нуждаются в опеке или попечительстве
1. Лицо, которому стало известно о физическом лице, которое нуждается в опеке или попечительстве, обязано немедленно сообщить об этом орган опеки и попечительства.

Статья 58. Физические лица, над которыми устанавливается опека
1. Опека устанавливается над малолетними лицами, которые являются сиротами или лишены родительской опеки, и физическими лицами, которые признаны недееспособными.

Статья 59. Физические лица, над которыми устанавливается попечительство
1. Попечительство устанавливается над несовершеннолетними лицами, которые являются сиротами или лишены родительской опеки, и физическими лицами, гражданская дееспособность которых ограничена.

Статья 60. Установление опеки и попечительства судом
1. Суд устанавливает опеку над физическим лицом в случае признания его недееспособным и назначает опекуна по представлению органа опеки и попечительства.
2. Суд устанавливает попечительство над физическим лицом в случае ограничения его гражданской дееспособности и назначает попечителя по представлению органа опеки и попечительства.
3. Суд устанавливает опеку над несовершеннолетним лицом, если при рассмотрении дела будет установлено, что оно лишено родительской заботы, и назначает опекуна по представлению органа опеки и попечительства.
4. Суд устанавливает попечительства над несовершеннолетним лицом, если при рассмотрении дела будет установлено, что она лишена родительского попечения, и назначает опекуна по представлению органа опеки и попечительства.

Статья 61. Установление опеки и попечительства органом опеки и попечительства
1. Орган опеки и попечительства устанавливает опеку над малолетним лицом и попечительство над несовершеннолетним лицом, кроме случаев, установленных частями первой и второй статьи 60 Гражданского кодекса Украины.

Статья 62. Место установления опеки или попечительства
1. Опека или попечительство устанавливаются по месту проживания физического лица, которое нуждается в опеке или попечительстве, или по месту проживания опекуна или попечителя.

Статья 63. Назначение опекуна или попечителя
1. Опекуна или попечителя назначает орган опеки или попечительства , кроме случаев, установленных статьей 60 настоящего Кодекса.
2. Опекуном или попечителем может быть только физическое лицо с полной гражданской дееспособностью.
3. Физическое лицо может быть назначено опекуном или попечителем только по его письменному заявлению.
4. Опекун или попечитель назначаются преимущественно из лиц, которые находятся в семейных, родственных отношениях с подопечным, с учетом личных отношений между ними, возможности лица исполнять обязанности опекуна или попечителя.
При назначении опекуна для малолетнего лица и при назначении попечителя для несовершеннолетнего лица учитывается желание подопечного.
5. Физическому лицу может быть назначен один или несколько опекунов или попечителей.

Статья 64. Физическое лицо, которое не может быть опекуном или попечителем
1. Опекуном или попечителем не может быть физическое лицо:
которое лишено родительских прав, если эти права не были возобновлены;
поведение и интересы которого противоречат интересам физического лица, которое нуждается в опеке или попечительстве.

Статья 65. Опека или попечительство над физическим лицом, относительно которого не назначен опекун или попечитель
1. До установления опеки или попечительства и назначения опекуна или попечителя, опеку или попечительство над физическим лицом осуществляет соответствующий орган опеки и попечительства.

Статья 66. Опека или попечительство над физическим лицом, которое находится в специальном учреждении
1. Если над физическим лицом, которое находится в учебном заведении, учреждении здравоохранения или учреждении социальной защиты населения, не установлена опека или попечительство или не назначен опекун или попечитель, опеку или попечительство над ним осуществляет это учреждение.

Статья 67. Права и обязанности опекуна
1. Опекун обязан заботиться о подопечном, о создании ему необходимых бытовых условий, обеспечении его уходом и лечением.
Опекун малолетнего лица обязан заботиться о его воспитании, обучении и развитии.
2. Опекун имеет право требовать возвращения подопечного от лиц, которые удерживают его без законного основания.
3. Опекун совершает сделки от имени и в интересах подопечного.
4. Опекун обязан принимать меры относительно защиты гражданских прав и интересов подопечного.

Статья 68. Сделки, которые не может совершать опекун
1. Опекун, его жена, муж и близкие родственники (родители, дети, братья, сестры) не могут заключать с подопечным договоров, кроме передачи имущества подопечному в собственность по договору дарения или в безвозмездное пользование по договору займа.
2. Опекун не может осуществлять дарение от лица подопечного, а также обязываться от его имени поручительством.

Статья 69. Права и обязанности попечителя
1. Попечитель над несовершеннолетним лицом обязан заботиться о создании для него необходимых бытовых условий, о его воспитании, обучении и развитии.
Попечитель над физическим лицом, с ограниченной гражданской дееспособностью, обязан заботиться о его лечении, создании необходимых бытовых условий.
2. Попечитель дает согласие на совершение подопечным правовых действий согласно статьям 32 и 37 Гражданского кодекса Украины.
3. Попечитель обязан принимать меры относительно защиты гражданских прав и интересов подопечного.

Статья 70. Сделки, на совершение которых попечитель не может давать согласие
1. Попечитель не может давать согласие на заключение договоров между подопечным и своей женой (своим мужем) или своими близкими родственниками, кроме передачи имущества подопечному в собственность по договору дарения или в безвозмездное пользование на основании договора займа.

Статья 71. Сделки, которые совершаются с разрешения органа опеки и попечительства
1. Опекун не имеет права без разрешения органа опеки и попечительства: 
отказаться от имущественных прав подопечного;
выдавать письменные обязательства от лица подопечного;
заключать договора, которые подлежат нотариальному удостоверению и (или) государственной регистрации, в том числе договора относительно раздела или обмена жилого дома, квартиры;
заключать договора относительно другого ценного имущества.
2. Попечитель имеет право давать согласие на совершение сделок, предусмотренных частью первой этой статьи, только с разрешения органа опеки и попечительства.

Статья 72. Управление имуществом лица, над которым установлена опека
1. Опекун обязан заботиться о сохранении и использовании имущества подопечного в его интересах.
2. Если малолетнее лицо может самостоятельно определить свои нужды и интересы, опекун, осуществляя управление его имуществом, должен учитывать его желания.
3. Опекун самостоятельно осуществляет расходы, необходимые для удовлетворения потребностей подопечного, за счет пенсии, алиментов, возмещения ущерба в связи с потерей кормильца, помощи на подопечного ребенка и других социальных выплат, предназначенных на подопечного ребенка в соответствии с законами Украины, доходов от имущества подопечного и т.д.
4. Если подопечный является владельцем недвижимости или имущества, которое нуждается в постоянном управлении, опекун может с разрешения органа опеки и попечительства управлять этим имуществом или передать его по договору в управление другому лицу.

Статья 73. Право опекуна и попечителя на оплату за выполнение ими своих обязанностей
1. Основания возникновения права на оплату услуг опекуна и попечителя, их размер и порядок выплаты устанавливаются Кабинетом Министров Украины.

Статья 74. Опека над имуществом
1. Если у лица, над которым установлены опека или попечительство, есть имущество, которое находится в другой местности, опека над этим имуществом устанавливается органом опеки и попечительства по местонахождению имущества.
Опека над имуществом устанавливается также в других случаях, установленных законом.

Статья 75. Увольнение опекуна и попечителя
1. Суд, если он назначил опекуна или попечителя, либо орган опеки и попечительства по заявлению лица освобождает его от полномочий опекуна или попечителя. Это заявление рассматривается судом или органом опеки и попечительства в течение одного месяца.
Лицо выполняет полномочия опекуна или попечителя до вынесения решения об освобождении его от полномочий опекуна или попечителя или до окончания месячного срока со дня подачи заявления, если оно не было рассмотрено в течение этого срока.
2. Суд, если он назначил попечителя, или орган опеки и попечительства может освободить попечителя от его полномочий по заявлению лица, над которым установлено попечительство.
3. По заявлению органа опеки и попечительства суд может освободить лицо от полномочий опекуна или попечителя в случае невыполнения им своих обязанностей, нарушения прав подопечного, а также в случае помещения подопечного в учебное заведение, учреждение охраны здоровья или учреждение социальной защиты.

Статья 76. Прекращение опеки
1. Опека прекращается в случае передачи малолетнего лица родителям (усыновителям).
2. Опека прекращается в случае достижения подопечным четырнадцати лет. В этом случае лицо, которое осуществляло обязанности опекуна, становится попечителем без специального решения относительно этого.
3. Опека прекращается в случае возобновления гражданской дееспособности физического лица, которое было признано недееспособным.

Статья 77. Прекращение попечительства
1. Попечительство прекращается в случае:
достижения физическим лицом совершеннолетия;
регистрации брака несовершеннолетнего лица;
предоставления несовершеннолетнему лицу полной гражданской дееспособности;
возобновления гражданской дееспособности физического лица, гражданская дееспособность которого была ограничена.

Статья 78. Предоставление дееспособному физическому лицу помощи в осуществлении его прав и выполнении обязанностей
1. Дееспособное физическое лицо, которое по состоянию здоровья не может самостоятельно осуществлять свои права и исполнять обязанности, имеет право избрать себе помощника.
Помощником может быть дееспособное физическое лицо.
По заявлению лица, которое нуждается в помощи, имя его помощника регистрируется органом опеки и попечительства, что подтверждается соответствующим документом.
2. Помощник имеет право на получение пенсии, алиментов, заработной платы, почтовой корреспонденции, которые принадлежат физическому лицу, которое нуждается в помощи.
3. Помощник имеет право совершать мелкие бытовые сделки в интересах лица, которое нуждается в помощи, согласно предоставленным ему полномочиям.
4. Помощник представляет лицо в органах государственной власти, органах власти Автономной Республики Крым, органах местного самоуправления и организациях, деятельность которых связана с обслуживанием населения.
Помощник может представлять физическое лицо в суде лишь на основании отдельной доверенности.
5. Услуги помощника являются оплатными, если другое не определено договоренностями сторон.
6. Помощник может быть в любое время отозван лицом, которое нуждалось в помощи. В этом случае полномочия помощника прекращаются.

Статья 79. Обжалование действий опекуна, решений органа опеки и попечительства
1. Действия опекуна могут быть обжалованы заинтересованным лицом, в том числе родственниками подопечного, в органах опеки и попечительства или в суде.
2. Решение органа опеки и попечительства может быть обжаловано в соответствующем органе, которому подчинен орган опеки и попечительства, или в суде.
"""

GKU_g_7 = """ 
Глава 7 - Гражданского кодекса
Общие положения о юридическом лице

Статья 80. Понятие юридического лица
1. Юридическим лицом является организация, созданная и зарегистрированная в установленном законом порядке.
Юридическое лицо наделяется гражданской правоспособностью и дееспособностью, может быть истцом и ответчиком в суде.

Статья 81. Виды юридических лиц
1. Юридическое лицо может быть создано путем объединения лиц и (или) имущества.
2. Юридические лица, в зависимости от порядка их создания, делятся на юридические лица частного права и юридические лица публичного права.
Юридическое лицо частного права создается на основании учредительных документов согласно статье 87 Гражданского кодекса Украины.
Юридическое лицо публичного права создается распорядительным актом Президента Украины, органа государственной власти, органа власти Автономной Республики Крым или органа местного самоуправления.
3. Этим Кодексом устанавливаются порядок создания, организационно-правовой формы, правовой статус юридических лиц частного права.
Порядок образования и правовой статус юридических лиц публичного права устанавливаются Конституцией Украины и законом.
4. Юридическое лицо может быть создано путем принудительного деления (выделения) в случаях, установленных законом.

Статья 82. Участие юридических лиц публичного права в гражданских отношениях
1. На юридические лица публичного права в гражданских отношениях распространяются положения Гражданского кодекса Украины, если другое не установлено законом.

Статья 83. Организационно-правовые формы юридических лиц
1. Юридические лица могут создаваться в форме обществ, учреждений и в других формах, установленных законом.
2. Обществом является организация, созданная путем объединения лиц (участников), которые имеют право участия в этом обществе. Общество может быть создано одним лицом, если другое не установлено законом.
Общества делятся на предпринимательские и непредпринимательские.
3. Учреждением является организация, созданная одним или несколькими лицами (основателями), которые не берут участия в управлении ею, путем объединения (выделения) их имущества для достижения цели, определенной основателями, за счет этого имущества.
Особенности правового статуса отдельных видов учреждений устанавливаются законом.
4. Положения этой главы применяются ко всем обществам и учреждениям, если другие правила для отдельных видов обществ или учреждений не установлены законом.

Статья 84. Предпринимательские общества
1. Общества, которые осуществляют предпринимательскую деятельность с целью получения прибыли и последующего ее распределения между участниками (предпринимательские общества), могут быть созданы лишь как хозяйственные общества (полное общество, коммандитное общество, общество с ограниченной или дополнительной ответственностью, акционерное общество) или производственные кооперативы.

Статья 85. Непредпринимательские общества
1. Непредпринимательскими обществами являются общества, которые не имеют целью получение прибыли для ее последующего распределения между участниками.
2. Особенности правового статуса отдельных видов непредпринимательских обществ устанавливаются законом.

Статья 86. Осуществление предпринимательской деятельности непредпринимательскими обществами и учреждениями
1. Непредпринимательские общества (кооперативы, кроме производственных, объединения граждан и т.п.) и учреждения могут наряду со своей основной деятельностью осуществлять предпринимательскую деятельность, если иное не установлено законом и если эта деятельность соответствует цели, для которой они были созданы, и способствует ее достижению.

Статья 87. Создание юридического лица
1. Для создания юридического лица его участники (основатели) разрабатывают учредительные документы, которые составляются в письменном виде и подписываются всеми участниками (основателями), если законом не установлен другой порядок их утверждения.
Юридическое лицо частного права может создаваться и действовать на основании модельного устава, утвержденного Кабинетом Министров Украины, который после его принятия участниками становится учредительным документом.
Основатели (участники) юридического лица, образованного на основании модельного устава, могут в установленном законом порядке утвердить устав, который является уставным документом, и осуществлять деятельность на его основании
2. Учредительным документом общества является утвержденный участниками Устав или учредительский договор между участниками, если другое не установлено законом.
Общество, созданное одним лицом, действует на основании устава, утвержденного этим лицом.
3. Учреждение создается на основании индивидуального или общего учредительного акта, составленного основателем (основателями). Учредительный акт может содержаться также и в завещании. До создания учреждения учредительный акт, составленный одним или несколькими лицами, может быть упразднен основателем (основателями).
4. Юридическое лицо считается созданным со дня его государственной регистрации.

Статья 88. Требования к содержанию учредительных документов
1. В уставе общества указываются наименование юридического лица, органы управления обществом, их компетенция, порядок принятия ими решений, порядок вступления в общество и выхода из него, если дополнительные требования к содержанию устава не установлены настоящим Кодексом или другим законом.
2. В учредительном договоре общества определяются обязательства участников создать общество, порядок их совместной деятельности по его созданию, условия передачи обществу имущества участников, если дополнительные требования к содержанию учредительного договора не установлены настоящим Кодексом или другим законом.
3. В учредительном акте учреждения указывается его цель, определяются имущество, которое передается учреждению, необходимое для достижения этой цели, структура управления учреждением. Если в учредительном акте, который содержится в завещании, отсутствуют отдельные из вышеупомянутых положений, их устанавливает орган, осуществляющий государственную регистрацию.

Статья 89. Государственная регистрация юридического лица
1. Юридическое лицо подлежит государственной регистрации в порядке, установленном законом. Данные государственной регистрации включаются в единый государственный реестр, открытый для общего ознакомления.
2. Основания для отказа в проведении государственной регистрации юридического лица устанавливаются законом. Отказ в проведении государственной регистрации юридического лица по другим основаниям, чем установленные законом, не допускается.
3. Отказ в государственной регистрации, а также промедление с ее осуществлением могут быть обжалованы в суде.
4. В единый государственный реестр вносятся сведения об организационно-правовой форме юридического лица, его наименование, местонахождение, органы управления, филиалы и представительства, цель учреждения, а также другие сведения, установленные законом.
5. Изменения в учредительных документах юридического лица, которые касаются ведомостей, включенных в единый государственный реестр, вступают в силу для третьих лиц со дня их государственной регистрации. Юридические лица и их участники не имеют права ссылаться на отсутствие государственной регистрации таких изменений в отношениях с третьими лицами, которые действовали с учетом этих изменений.

Статья 90. Наименование юридического лица
1. Юридическое лицо должно иметь свое наименование, которое содержит информацию про его организационно-правовую форму и название.
Наименование учреждения должно содержать информацию о характере его деятельности.
Юридическое лицо может иметь кроме полного наименования сокращенное наименование.
2. Юридическое лицо, которое является предпринимательским обществом, может иметь коммерческое (фирменное) наименование.
Коммерческое (фирменное) наименование юридического лица может быть зарегистрировано в порядке, установленном законом.
3. Наименование юридического лица указывается в его учредительных документах и вносится в единый государственный реестр.
4. В случае изменения своего наименования юридическое лицо кроме выполнения других требований, установленных законом, обязано поместить объявления об этом в печатных средствах массовой информации, в которых публикуются ведомости о государственной регистрации юридического лица, и сообщить об этом всем лицам, с которыми оно находится в договорных отношениях - часть 4 исключена 26.11.2015
5. Юридическое лицо не имеет права использовать наименование другого юридического лица.

Статья 91. Гражданская правоспособность юридического лица
1. Юридическое лицо способно иметь такие же гражданские права и обязанности (гражданскую правоспособность), как и физическое лицо, кроме тех, которые по своей природе могут принадлежать лишь человеку.
2. Гражданская правоспособность юридического лица может быть ограничена лишь по решению суда.
3. Юридическое лицо может осуществлять отдельные виды деятельности, перечень которых устанавливается законом, после получения им специального разрешения (лицензии).
4. Гражданская правоспособность юридического лица возникает с момента его создания и прекращается со дня внесения в единый государственный реестр записи о его прекращении.

Статья 92. Гражданская дееспособность юридического лица
1. Юридическое лицо приобретает гражданские права и обязанности и осуществляет их через свои органы, которые действуют в соответствии с учредительными документами и законом.
Порядок создания органов юридического лица устанавливается учредительными документами и законом.
2. В случаях, установленных законом, юридическое лицо может приобретать гражданские права и обязанности и осуществлять их через своих участников.
3. Орган или лицо, которое согласно учредительным документам юридического лица или закона выступает от его имени, обязано действовать в интересах юридического лица, добросовестно и разумно и не превышать своих полномочий.
В отношениях с третьими лицами ограничения полномочий относительно представительства юридического лица не имеет юридической силы, кроме случаев, если юридическое лицо докажет, что третье лицо знало или при любых обстоятельствах не могло не знать о таких ограничениях.
4. Если члены органа юридического лица и прочие лица, которые согласно закона или учредительных документов выступают от имени юридического лица, нарушают свои обязанности относительно представительства, они несут солидарную ответственность за убытки, причиненные ими юридическому лицу.

Статья 93. Местонахождение юридического лица
1. Местонахождением юридического лица является фактическое место ведения деятельности или размещения офиса, из которого проводится ежедневное управление деятельностью юридического лица (где преимущественно находится руководство) и осуществление управления и учета

Статья 94. Личные неимущественные права юридического лица
1. Юридическое лицо имеет право на неприкосновенность его деловой репутации, на тайну корреспонденции, на информацию и прочие личные неимущественные права, которые могут ему принадлежать.
Личные неимущественные права юридического лица охраняются в соответствии с главой 3 Гражданского кодекса Украины.
2. Защита личных неимущественных прав юридического лица в связи с заведомо ложным сообщением или непреднамеренным сообщением недостоверной информации относительно его уполномоченного (должностного или служебного) лица о возможных фактах коррупционных или связанных с коррупцией правонарушений, других нарушений Закона Украины "О предупреждении коррупции" в порядке, предусмотренном настоящим Законом, осуществляется в том же объеме, что и личные неимущественные права физических лиц.

Статья 95. Филиалы и представительства
1. Филиалом является отдельное подразделение юридического лица, которое расположено вне его местонахождения и осуществляет все или часть его функций.
2. Представительством является отдельное подразделение юридического лица, которое расположено вне его местонахождения и осуществляет представительство и защиту интересов юридического лица.
3. Филиалы и представительства не являются юридическими лицами. Они наделяются имуществом юридического лица, которое их создало, и действуют на основании утвержденного им положения.
4. Руководители филиалов и представительств назначаются юридическим лицом и действуют на основании выданной им доверенности.
5. Ведомости о филиалах и представительствах юридического лица включаются в единый государственный реестр.

Статья 96. Ответственность юридических лиц
1. Юридическое лицо самостоятельно отвечает по своим обязательствами.
2. Юридическое лицо отвечает по своим обязательствам всем принадлежащим ему имуществом.
3. Участник (основатель) юридического лица не отвечает по обязательствам юридического лица, а юридическое лицо не отвечает по обязательствам его участника (основателя), кроме случаев, установленных учредительными документами и законом.
4. Лица, которые создают юридическое лицо, несут солидарную ответственность по обязательствам, которые возникли до его государственной регистрации.
Юридическое лицо отвечает по обязательствам его участников (основателей), которые связаны с его созданием, только в случае последующего одобрения их действий соответствующим органом юридического лица.

Статья 97. Управление обществом
1. Управление обществом осуществляют его органы.
2. Органами управления обществом являются общие сборы его участников и исполнительный орган, если другое не установлено законом.

Статья 98. Общие сборы участников общества
1. Общее собрание участников общества вправе принимать решения по всем вопросам деятельности общества, в том числе и из тех, которые относятся к компетенции других органов общества.
2. Решения общих сборов принимаются простым большинством от числа присутствующих участников, если другое не установлено учредительными документами или законом.
Решения о внесении изменений в устав общества, отчуждение имущества общества на сумму, которая составляет пятьдесят и больше процентов имущества общества, и о ликвидации общества принимаются большинством не менее чем в 3/4 голосов, если другое не установлено законом.
3. Участник общества не имеет права голоса при принятии общим собранием общества решений по вопросам совершения с ним сделки и относительно спора между ним и обществом, если иное не установлено законом. Это правило не применяется в обществе с одним участником.
4. Порядок созыва общих сборов определяется в учредительных документах общества. Участники общества, которые владеют не менее чем десятью процентами голосов, могут требовать созыва общих сборов.
Если требование участников о созыве общих сборов не выполнено, эти участники имеют право сами собрать общие сборы.
5. Часть пятая статьи 98 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 99. Исполнительный орган общества
1. Общие сборы общества своим решением создаюти исполнительный орган и устанавливают его компетенцию и состав.
2. Исполнительный орган общества может состоять из одного или нескольких лиц. Исполнительный орган, состоящий из нескольких человек, принимает решения в порядке, установленном абзацем первым части второй статьи 98 настоящего Кодекса.
3. Полномочия члена исполнительного органа могут быть в любое время прекращены или он может быть временно отстранен от исполнения своих полномочий.
4. Названием исполнительного органа общества в соответствии с учредительными документами или законом может быть "правление", "дирекция " т.д.

Статья 100. Выход и исключение из общества
1. Участники общества вправе выйти из общества, если иное не вытекает из закона.
2. Участник общества в случаях и в порядке, установленных законом, может быть исключен из общества.

Статья 101. Управление учреждением
1. Основатели учреждения не берут участия в управлении им.
В учреждении обязательно создается правление, к которому применяются положения статьи 99 Гражданского кодекса Украины.
Учредительный акт может предусматривать создание также других органов, определять порядок формирования этих органов и их состав.
2. Надзор за деятельностью учреждения осуществляет его наблюдательный совет. Наблюдательный совет осуществляет надзор за управлением имуществом учреждения, соблюдением цели учреждения и за его другой деятельностью согласно учредительного акта.

Статья 102. Передача имущества учреждению
1. В учредительном акте определяется имущество, которое основатель (а в случае его смерти - обязанное лицо) должен передать учреждению после его государственной регистрации.

Статья 103. Изменение цели учреждения и структуры управления
1. Если осуществление цели учреждения стало невозможным или оно угрожает общественным интересам, то соответствующий орган государственной власти, может обратиться в суд с заявлением об определении другой цели учреждения по согласованию с органами управления учреждением.
2. В случае изменения цели учреждения суд должен учитывать намерения основателя и заботиться о том, чтобы выгоды от использования имущества учреждения передавались тем дестинаторам, которым эти выгоды предназначались по намерениям основателя.
3. Суд может изменить структуру управления учреждения, если это необходимо вследствие изменения цели учреждения или по другим уважительным причинам.
4. В случае изменения цели учреждения или изменения структуры управления учреждения его правление обязано сообщить суду в письменной форме о своем мнении по этому вопросу.

Статья 104. Прекращение юридического лица
1. Юридическое лицо прекращается в результате реорганизации (слияния, присоединения, разделения, преобразования) или ликвидации. В случае реорганизации юридических лиц имущество, права и обязанности переходят к правопреемникам.
2. Юридическое лицо, не вправе распределять прибыль между участниками, не может быть реорганизована, если среди правопреемников является юридическое лицо, наделенное таким правом. Если среди правопреемников является юридическое лицо, не вправе распределять прибыль между участниками, решение о реорганизации общества, наделенного таким правом, принимается единогласно общим собранием участников, в которых приняли участие все участники общества.
3. Юридическое лицо, не вправе распределять имущество между участниками, в частности в случае ликвидации, не может быть реорганизована, если среди правопреемников является юридическое лицо, наделенное таким правом. Если среди правопреемников является юридическое лицо, не вправе распределять имущество между участниками, решение о реорганизации общества, наделенного таким правом, принимается единогласно общим собранием участников, в которых приняли участие все участники общества.
4. Учреждение не может быть преобразована, кроме случаев, предусмотренных законом.
5. Юридическое лицо является прекращенным со дня внесения в единый государственный реестр записи о его прекращении.
6. Порядок прекращения юридического лица в процессе восстановления его платежеспособности или банкротства устанавливается законом.
7. Особенности прекращения банка как юридического лица устанавливается законом.

Статья 105. Выполнение решения о прекращении юридического лица
1. Участники юридического лица, суд или орган, который принял решение о прекращении юридического лица, обязаны на протяжении трех рабочих дней с даты принятия решения письменно уведомить об этом орган, осуществляющий государственную регистрацию.
2. После внесения записи о принятии решения основателей (участников) юридического лица, суду или уполномоченного ими органа о прекращении юридического лица в Единый государственный реестр юридических лиц и физических лиц - предпринимателей уведомление о внесения записи в Единый государственный реестр юридических лиц и физических лиц - предпринимателей относительно принятия решения основателей (участников) юридического лица, суду или уполномоченному ими органу о прекращении юридического лица публикуется в специализированном печатном средстве массовой информации - часть 2 исключена 26.11.2015.
3. Участники юридического лица, суд или орган, принявший решение о прекращении юридического лица, согласно Гражданского Кодекса назначают комиссию по прекращению юридического лица (комиссию по реорганизации, ликвидационную комиссию), председателя комиссии или ликвидатора и устанавливают порядок и срок заявления кредиторами своих требований к юридическому лицу, которое прекращается.
Выполнение функций комиссии по прекращению юридического лица (комиссии по реорганизации, ликвидационной комиссии) может быть возложено на орган управления юридического лица.
4. К комиссии по прекращению юридического лица (комиссии по реорганизации, ликвидационной комиссии) или ликвидатору с момента назначения переходят полномочия по управлению делами юридического лица. Председатель комиссии, ее члены или ликвидатор юридического лица представляют его в отношениях с третьими лицами и выступают в суде от имени юридического лица, которое прекращается.
5. Срок заявления кредиторами своих требований к юридическому лицу, которое прекращается, не может составлять менее двух и более шести месяцев со дня публикации сообщения о решении о прекращении юридического лица.
6. Каждое отдельное требование кредитора, в частности по уплате налогов, сборов, единого взноса на общеобязательное государственное социальное страхование, страховых средств в Пенсионный фонд Украины, фондов социального страхования, рассматривается, после чего принимается соответствующее решение, которое направляется кредитору не позднее тридцати дней со дня получения юридическим лицом, которое прекращается, соответствующего требования кредитора.

Статья 106. Слияние, присоединение, деление и преобразование юридического лица
1. Слияние, присоединение, деление и преобразование юридического лица осуществляются по решению его участников или органа юридического лица, уполномоченного на это учредительными документами, а в случаях, предусмотренных законом, - по решению суда или соответствующих органов государственной власти.
2. Законом может быть предусмотрено получение согласия соответствующих органов государственной власти на прекращение юридического лица путем слияния или присоединения.

Статья 107. Порядок прекращения юридического лица путем слияния, присоединение, деления и преобразования
1. Кредитор может требовать от юридического лица, которое прекращает, исполнение обязательств которого не обеспечено, прекращения или досрочного исполнения обязательства, или обеспечения исполнения обязательства, кроме случаев, предусмотренных законом.
2. После окончания срока для предъявления требований кредиторами и удовлетворения или отклонения этих требований комиссия по прекращению юридического лица составляет акт передачи (в случае слияния, присоединения или преобразования) или распределительный баланс (в случае деления), который должен содержать положения о правонаследовании относительно имущества, прав и обязанностей прекращаемого юридического лица, путем разделения относительно всех его кредиторов и должников, включая обязательства, которые оспариваются сторонами.
3. Акт передачи и распределительный баланс утверждаются участниками юридического лица или органом, который принял решение о его прекращении кроме случаев, установленных законом.
Подписанные председателем и членами комиссии по прекращению юридического лица и утвержденные участниками юридического лица или органом, который принял решение о прекращении юридического лица, экземпляры акта передачи и распределительного баланса передаются в орган, осуществляющий государственную регистрацию юридического лица, которое прекращается, по месту его государственной регистрации, а также в орган, осуществляющий государственную регистрацию  юридического лица - правопреемника, по месту его государственной регистрации - абзац 2 части 3 исключен 26.11.15
4. Нарушение положений частей второй и третьей этой статьи являются основанием для отказа во внесении в единый государственный реестр записи о прекращении юридического лица и государственной регистрации создаваемых юридических лиц - правопреемников.
5. Юридическое лицо - правопреемник, которое образовалось вследствие разделения, несет субсидиарную ответственность по обязательствам прекращенного юридического лица, которые согласно распределительному балансу перешли к другому юридическому лицу - правопреемнику. Если юридических лиц - правопреемников, которые образовались в результате деления, больше двух, такую ​​субсидиарную ответственность они несут солидарно.
6. Если правопреемниками юридического лица являются несколько юридических лиц и точно определить правопреемника по конкретным обязательствам прекращенного юридического лица, невозможно, юридические лица - правопреемники несут солидарную ответственность перед кредиторами прекращенного юридического лица. Участники (основатели) прекращенного юридического лица, которые согласно закона или учредительных документов отвечали по его обязательствам, отвечают по обязательствам правопреемников, возникших до момента прекращения юридического лица, в том же объеме, если больший объем ответственности участников (основателей) по обязательствам правопреемников не установлен законом или их учредительными документами.

Статья 108. Преобразование юридического лица
1. Преобразованием юридического лица является изменение его организационно-правовой формы.
2. В случае преобразования к новому юридическому лицу переходят все имущество, все права и обязанности предшествующего юридического лица.

Статья 109. Выделение
1. Выделением является переход по распределительному балансу части имущества, прав и обязанностей юридического лица к одному или нескольким создаваемым новым юридическим лицам.
2. После принятия решения о выделении участники юридического лица или орган, принявший решение о выделении, составляют и утверждают разделительный баланс.
Суд, принявший решение о выделении, в своем решении определяет участника юридического лица или высший орган юридического лица (владельца), который обязан составить и утвердить разделительный баланс.
3. Юридическое лицо, образовавшееся вследствие выделения, несет субсидиарную ответственность по обязательствам юридического лица, из которого было осуществлено выделение, которые согласно распределительному балансом не перешли к юридическому лицу, образовавшемуся вследствие выделения. Юридическое лицо, из которого произошло выделение, несет субсидиарную ответственность по обязательствам, которые согласно распределительного баланса перешли к юридическому лицу, образовавшемуся вследствие выделения. Если юридических лиц, образовавшихся в результате выделения, два или более, субсидиарную ответственность они несут совместно с юридическим лицом, с которого было осуществлено выделение, солидарно.
4. Если после выделения невозможно точно установить обязанности лица по отдельным обязательствам, которое существовало у юридического лица до выделения, юридическое лицо, из которого произошло выделение, и юридические лица, которые были созданы в результате выделения, несут солидарную ответственность перед кредитором по таким обязательствам.

Статья 110. Ликвидация юридического лица
1. Юридическое лицо ликвидируется:
по решению его участников или органа юридического лица, уполномоченного на это учредительными документами, в том числе в связи с окончанием срока, на который было создано юридическое лицо, достижением цели, для которой она создана, а также в других случаях, предусмотренных учредительными документами;
по решению суда о ликвидации юридического лица вследствие допущенных при его создании нарушений, которые нельзя устранить, по иску участника юридического лица или соответствующего органа государственной власти;
по решению суда о ликвидации юридического лица в иных случаях, установленных законом, - по иску соответствующего органа государственной власти.
2. Если с иском о ликвидации юридического лица обратился орган государственной власти, ликвидатором может быть назначен этот орган, если он наделен соответствующими полномочиями.
3. Если стоимость имущества юридического лица недостаточна для удовлетворения требований кредиторов, юридическое лицо осуществляет все необходимые действия, установленные законом о восстановлении платежеспособности или признания банкротом.
4. Особенности ликвидации банков устанавливаются законом о банках и банковской деятельности.

Статья 111. Порядок ликвидации юридического лица
1. С даты внесения в Единый государственный реестр юридических лиц, физических лиц - предпринимателей и гражданских формирований записи о решении учредителей (участников) юридического лица, суду или уполномоченному им органа о ликвидации юридического лица ликвидационная комиссия (ликвидатор) обязана принять все необходимые меры по взысканию дебиторской задолженности ликвидируемого юридического лица, и письменно уведомить каждого из должников о прекращении юридического лица в установленные Гражданским Кодексом сроки.
Ликвидационная комиссия (ликвидатор) заявляет требования и иски о взыскании задолженности с должников юридического лица.
2. Ликвидационная комиссия (ликвидатор) обязана сообщить участникам юридического лица, суду или органу, принявшему решение о прекращении юридического лица, о ее участии в других юридических лицах и/или предоставить сведения о созданных ею хозяйственных обществах, дочерних предприятиях.
3. Во время проведении мероприятий по ликвидации юридического лица до окончания срока предъявления требований кредиторов ликвидационная комиссия (ликвидатор) закрывает счета, открытые в финансовых учреждениях, кроме счета, который используется для расчетов с кредиторами во время ликвидации юридического лица.
4. Ликвидационная комиссия (ликвидатор) принимает меры по инвентаризации имущества прекращаемого юридического лица, а также имущества его филиалов и представительств, дочерних предприятий, хозяйственных обществ, а также имущества, которое подтверждает его корпоративные права в других юридических лицах, выявляет и принимает меры по возвращению имущества, находящегося у третьих лиц.
В случаях, установленных законом, ликвидационная комиссия (ликвидатор) обеспечивает проведение независимой оценки имущества прекращаемого юридического лица.
5. Ликвидационная комиссия (ликвидатор) принимает меры по закрытию обособленных подразделений юридического лица (филиалов, представительств) в соответствии с законодательством о труде осуществляет увольнения работников прекращаемого юридического лица.
6. Лицензии, документы разрешительного характера и другие документы, а также печати и штампы, подлежащие возврату органам государственной власти, органам местного самоуправления, возвращаются им ликвидационной комиссией (ликвидатором).
7. Для проведения проверок и определения наличия или отсутствия задолженности по уплате налогов, сборов, единого взноса на общеобязательное государственное социальное страхование, страховых средств в Пенсионный фонд Украины, фонды социального страхования ликвидационная комиссия (ликвидатор) обеспечивает своевременное предоставление налоговым органам и Пенсионного фонда Украины, фондов социального страхования документов юридического лица (его филиалов, представительств), в том числе первичных документов, регистров бухгалтерского и налогового учета.
До момента утверждения ликвидационного баланса ликвидационная комиссия (ликвидатор) составляет и представляет налоговым органам, Пенсионного фонда Украины и фондов социального страхования отчетность за последний отчетный период.
8. Ликвидационная комиссия (ликвидатор) по истечении срока для предъявления требований кредиторами составляет промежуточный ликвидационный баланс, включающий сведения о составе имущества ликвидируемого юридического лица, перечень предъявленных кредиторами требований и результат их рассмотрения.
Промежуточный ликвидационный баланс утверждается участниками юридического лица, судом или органом, принявшим решение о ликвидации юридического лица.
9. Выплата денежных сумм кредиторам ликвидируемого юридического лица, в том числе по налогам, сборам, единым взносам на общеобязательное государственное социальное страхование и другими средствами, подлежащим уплате в государственный или местный бюджет, Пенсионный фонд Украины, фонды социального страхования, производится в порядке очередности, установленном статьей 112 Гражданского Кодекса.
В случае недостаточности у ликвидируемого юридического лица, средств для удовлетворения требований кредиторов ликвидационная комиссия (ликвидатор) организует реализацию имущества юридического лица.
10. До утверждения ликвидационного баланса ликвидационная комиссия (ликвидатор) составляет и представляет налоговым органам, Пенсионному фонду Украины и фондам социального страхования отчетность за последний отчетный период
11. После завершения расчетов с кредиторами ликвидационная комиссия (ликвидатор) составляет ликвидационный баланс, обеспечивает его утверждения участниками юридического лица, судом или органом, принявшим решение о прекращении юридического лица, и обеспечивает представление налоговым органам.
12. Имущество юридического лица, оставшееся после удовлетворения требований кредиторов (в том числе по налогам, сборам, единым взносам на общеобязательное государственное социальное страхование и другим средствам, подлежащим уплате в государственный или местный бюджет, Пенсионный фонд Украины, фонд социального страхования), передается участникам юридического лица, если иное не установлено учредительными документами юридического лица или законом.
13. Документы, подлежащие обязательному хранению, передаются в установленном законодательством порядке в соответствующие архивные учреждения.
14. Ликвидационная комиссия (ликвидатор) обеспечивает предоставление государственному регистратору документов, предусмотренных законом для проведения государственной регистрации прекращения юридического лица в установленный законом срок.

Статья 112. Удовлетворение требований кредиторов
1. В случае ликвидации платежеспособного юридического лица требования его кредиторов удовлетворяются в такой очередности:
в первую очередь удовлетворяются требования относительно возмещения вреда, причиненного увечьем, другим повреждением здоровья или смертью, и требования кредиторов, обеспеченные залогом или другим способом;
во-вторую очередь удовлетворяются требования работников, связанные с трудовыми отношениями, требования автора о плате за использование результата его интеллектуальной, творческой деятельности;
в третью очередь удовлетворяются требования относительно налогов, сборов (обязательных платежей);
в четвертую очередь удовлетворяются все другие требования.
Требования первой очереди удовлетворяются пропорционально сумме требований, которые принадлежат каждому кредитору этой очереди.
2. Очередность удовлетворения требований кредиторов по договорам страхования определяется законом.
3. В случае отказа ликвидационной комиссии в удовлетворении требований кредитора или уклонения от их рассмотрения кредитор имеет право на протяжении месяца с даты, когда он узнал или мог узнать о таком отказе, обратиться в суд с иском к ликвидационной комиссии. По решению суда требования кредитора могут быть удовлетворены за счет имущества, которое осталось после ликвидации юридического лица.
4. Требования кредитора, заявленные после истечения срока, установленного ликвидационной комиссией для их предъявления, удовлетворяются из имущества юридического ликвидируемого лица, которое осталось после удовлетворения требований кредиторов, заявленных своевременно.
5 Требования кредиторов, не признанные ликвидационной комиссией, если кредитор в месячный срок после получения сообщения о полном или частичном отказе в признании его требований не обращался в суд с иском, требования, в удовлетворении которых по решению суда кредитору отказано, а также требования, которые не удовлетворены из-за отсутствия имущества ликвидируемого юридического лица, считаются погашенными
"""

GKU_g_8 = """ 
Глава 8 - Гражданского кодекса
Предпринимательские общества

Параграф 1. Хозяйственные общества
1. Общие положения

Статья 113. Понятие и виды хозяйственных обществ
1. Хозяйственным обществом является юридическое лицо, уставной (составленный) капитал которого разделенный на частицы между участниками.
2. Хозяйственные общества могут быть созданы в форме полного общества, коммандитного общества, общества с ограниченной или дополнительной ответственностью, акционерного общества.

Статья 114. Участники хозяйственного общества
1. Участником хозяйственного общества может быть физическое или юридическое лицо.
Ограничение относительно участия в хозяйственных обществах может быть установлено законом.
2. Хозяйственное общество, кроме полного и коммандитного общества, может быть создано одним лицом, которое становится его единым участником.

Статья 115. Имущество хозяйственного общества
1. Хозяйственное общество является собственником:
имущества, переданного ему участниками общества в собственность как вклад в уставной (составленный) капитал;
продукции, выработанной обществом в результате хозяйственной деятельности;
полученных доходов;
другого имущества, приобретенного на основаниях, которые не запрещены законом.
2. Вкладом в уставной капитал хозяйственного общества могут быть деньги, ценные бумаги, другие вещи или имущественные или другие отчуждаемые права, имеющие денежную оценку, если другое не установлено законом.
Денежная оценка вклада участника хозяйственного общества осуществляется по согласию участников общества, а в случаях, установленных законом, она подлежит независимой экспертной проверке.

Статья 116. Права участников хозяйственного общества
1. Участники хозяйственного общества имеют права в порядке, установленном учредительным документом общества и законом:
принимать участие в управлении обществом в порядке, определенном в учредительном документе, кроме случаев, установленных законом;
принимать участие в распределении прибыли общества и получать его часть (дивиденды);
выйти в установленном порядке из общества;
осуществить отчуждение доли (ее части) в уставном (складочном) капитале общества, ценных бумаг, которые удостоверяют участие в обществе, в порядке, установленном законом.
Договор отчуждения имущества, предметом которого является доля (ее часть) в уставном (складочном) капитале общества, заключается в письменной форме;
получать информацию о деятельности общества в порядке, установленном учредительным документом.
2. Участники хозяйственного общества могут также иметь другие права, установленные учредительным документом общества и законом.

Статья 117. Обязанности участников хозяйственного общества
1. Участники хозяйственного общества обязаны:
придерживаться учредительного документа общества и выполнять решения общего собрания;
выполнять свои обязательства перед обществом, в том числе, связанные с имущественным участием, а также делать вклады (оплачивать акции) в размере, в порядке и средствами, предусмотренными учредительным документом;
не разглашать коммерческую тайну и конфиденциальную информацию о деятельности общества.
2. Участники хозяйственного общества могут также иметь другие обязанности, установленные учредительным документом общества и законом.

Статья 118. Зависимое хозяйственное общество
1. Хозяйственное общество (общество с ограниченной или дополнительной ответственностью, акционерное общество) является зависимым, если другому (главному) хозяйственному обществу принадлежат двадцать или более процентов уставного капитала общества с ограниченной или дополнительной ответственностью либо двадцать или более процентов простых акций акционерного общества.
2. Хозяйственное общество, которое купило или иным образом приобрело двадцать или больше процентов уставного капитала общества с ограниченной или дополнительной ответственностью либо двадцать или более процентов простых акций акционерного общества, обязано сделать достоянием гласности эту информацию в порядке, установленному законом.
2. Полное общество

Статья 119. Понятие полного общества
1. Полным является общество, участники которого в соответствии с заключенным между ними договором осуществляют предпринимательскую деятельность от лица общества и солидарно несут дополнительную (субсидиарную) ответственность по его обязательствам всем имуществом, которое им принадлежит.
2. Лицо может быть участником только одного полного общества.
3. Участник полного общества не имеет права без согласия других участников совершать от своего имени и в своих интересах или в интересах третьих лиц сделки, идентичные тем, которые составляют предмет деятельности общества.
В случае нарушения этого правила общество имеет право по своему выбору требовать от такого участника или возмещения причиненных обществу убытков, или передачи обществу всей выгоды, приобретенной по таким сделкам.
4. Наименование полного общества может содержать имена (наименование) всех его участников, слова "полное общество" или содержать имя (наименование) одного или нескольких участников с добавлением слов "и компания", а также слова "полное общество".

Статья 120. Учредительный договор полного общества
1. Полное общество создается и действует на основании учредительного договора. Учредительный договор подписывается всеми его участниками.
2. Учредительный договор полного общества кроме сведений, предусмотренных статьей 88 Гражданского кодекса Украины, может содержать сведения про: размер и состав составленного капитала общества; размер и порядок изменения долей любого из участников в составленном капитале; размер, состав и сроки внесения ими вкладов.

Статья 121. Управление полным обществом
1. Управление деятельностью полного общества осуществляется по общему согласию всех участников. Учредительским договором общества могут быть предусмотрены случаи, когда решение принимается большинством голосов участников.
2. Каждый участник полного общества имеет один голос, если учредительским договором не предусмотрен другой порядок определения количества голосов.
3. Каждый участник полного общества, независимо от того, уполномоченный ли он вести дела общества, имеет право ознакомляться с всей документацией относительно ведения дел общества. Отказ от этого права ли его ограничение, в частности по договоренности участников общества, является ничтожным.

Статья 122. Ведение дел полного общества
1. Каждый участник полного общества имеет право действовать от лица общества, если учредительским договором не определено, что все участники ведут дела совместно или что ведение дел поручено отдельным участникам.
В случае общего ведения дел участниками общества для совершения любой сделки необходимо согласие всех участников общества. Если ведение дел поручено отдельным участникам полного общества, другие участники могут совершать сделки от лица общества при наличии у них доверенности, выданной участниками, которым поручено ведения дел общества.
В отношениях с третьими лицами полное общество не может ссылаться на положение учредительского договора, которые ограничивают полномочия участников полного общества относительно права действовать от лица общества, кроме случаев, если будет доказано, что третье лицо в момент совершения сделки знало или могло знать об отсутствии у участника общества права действовать от лица общества.
2. Участник полного общества, которое действовало в общих интересах, но не имел на это полномочий, имеет право в случае, если его действия не были одобрены другими участниками, требовать от общества возмещения осуществленных им затрат, если он докажет, что в связи с его действиями общество сохранило или приобрело имущество, которое по стоимости превышает эти затраты.
3. В случае спора между участниками полного общества полномочия на ведение дел общества, предоставленные одному или нескольким участникам, могут быть прекращены судом по требованию одного или нескольких других участников общества при наличии для этого достаточных оснований, в частности вследствие грубого нарушения участником, уполномоченным на ведение дел общества, своих обязанностей или выявления его неспособности к разумному ведению дел. На основании решения суда в учредительный договор общества вносятся необходимые изменения.

Статья 123. Распределение прибыли и убытков полного общества
1. Прибыль и убытки полного общества распределяются между его участниками пропорционально их долям в составленном капитале, если другое не предусмотрено учредительным договором или договоренностью участников.
2. Лишение участника полного общества права на участие в распределении прибыли или убытков не допускается.

Статья 124. Ответственность участников полного общества по его обязательствам
1. В случае недостаточности у полного общества имущества для удовлетворения требований кредиторов в полном объеме участники полного общества солидарно отвечают по обязательствам общества всем своим имуществом, на которое может быть обращено взыскание.
2. Участник полного общества отвечает по долгам общества независимо от того, возникли эти долги до или после его вступления в общество.
3. Участник полного общества, который выбыл из общества, отвечает по обязательствам общества, которые возникли к моменту его убытия, в равной мере с участниками, которые остались, на протяжении трех лет со дня утверждения отчета о деятельности общества за год, в котором он выбыл из общества.
4. Участник полного общества, которое уплатило полностью долги общества, имеет право обратиться с регрессным требованием в соответствующей части к другим участникам, которые несут перед ним ответственность пропорционально своим долям в уставном капитале общества.

Статья 125. Изменения в составе участников полного общества
1. Изменения в составе участников полного общества могут быть в связи с:
выходом участника полного общества из его состава по собственной инициативе;
исключением из состава участников;
убытием из состава участников по причине, которая не зависит от участника.
2. Порядок и особенности выхода, исключение и убытие участников из состава полного общества определяются этим Кодексом, другим законом и учредительским договором.

Статья 126. Выход из полного общества
1. Участник полного общества, которое было создано на неопределенный срок, может в любой момент выйти из общества, заявив об этом не позднее чем за три месяца до фактического выхода из общества. Подлинность подписи на заявлении о выходе из общества подлежит нотариальному удостоверению.
Досрочный выход участника из полного общества, которое основано на определенный срок, допускается лишь по уважительной причине.
2. Отказ от права выйти из полного общества является ничтожным.

Статья 127. Передача участником доли (ее части) в составленном капитале полного общества
1. Участник полного общества имеет право по согласию других его участников передать свою частицу в составленном капитале или ее часть другому участнику общества или третьему лицу.
2. В случае передачи доли (ее части) новому участнику к нему переходят полностью или в соответствующей части права, которые принадлежали участнику, который передал долю (ее часть). Лицо, которому передана доля (ее часть), отвечает по обязательствам общества соответственно части второй статьи 124 Гражданского кодекса Украины.
3. В случае передачи участником общества всей доли другому лицу участие этого участника в полном обществе прекращается и для него наступают следствия, предусмотренные частью третьей статьи 124 Гражданского кодекса Украины.

Статья 128. Исключение из состава участников полного общества
1. Участник полного общества, которое систематически не выполняет или выполняет ненадлежащим образом обязанности, возложенные на него обществом, или что препятствует своими действиями (бездеятельностью) достижению целей общества, может быть исключен из общества в порядке, установленном учредительным договором.
2. Решение об исключении из состава участников полного общества может быть обжаловано в суде.

Статья 129. Убытие из полного общества
1. Полное общество может принять решение о признании участника полного общества, выбывшим из его состава, в случае:
смерти участника или объявлении его умершим - из-за отсутствия наследников;
ликвидации юридического лица - участника общества, в том числе в связи с признанием его банкротом;
признание участника недееспособным, ограничение его гражданской дееспособности или признания безвестно отсутствующим;
назначение по решению суда принудительной реорганизации юридического лица - участника общества, в частности в связи с его неплатежеспособностью;
обращение взыскания на часть имущества полного общества, которое соответствует доле участника в составленном капитале общества.
2. Решение о признании участника полного общества, выбывшим из его состава, может быть обжаловано заинтересованными лицами в суде.
3. В случае убытия участника из полного общества на основаниях, предусмотренных частью первой этой статьи, общество может продолжить свою деятельность, если другое не установлено учредительским договором общества или договоренностью между участниками, которые остаются.

Статья 130. Расчеты в случае выхода, исключение и убытие с полного общества
1. Участнику, который вышел, который исключен или который выбыл из полного общества на основаниях, установленных в статьях 126, 128 и 129 Гражданского кодекса Украины, выплачивается стоимость части имущества общества, пропорционально доле этого участника в составленном капитале общества, если другое не установлено учредительским договором.
2. Если наследник участника полного общества - физического лица или правопреемник юридического лица не вступил в полное общество, расчеты с ним осуществляются соответственно части первой этой статьи.
3. Порядок определения стоимости доли участника в имуществе полного общества и сроки ее выплаты устанавливаются учредительским договором и законом.

Статья 131. Обращение взыскания на часть имущества полного общества, пропорциональную частице участника общества в составленном капитале
1. Обращение взыскания на частицу участника в составленном капитале полного общества по его личным обязательствам допускается только в случае недостаточности другого имущества для удовлетворения требований кредиторов. В случае недостаточности имущества участника полного общества для выполнения его обязательств перед кредиторами они могут требовать в установленном порядке выделения части имущества полного общества, пропорциональной доле участника-должника в составленном капитале общества.
2. Часть имущества полного общества, пропорциональная частице участника-должника в составленном капитале, выделяется в денежной форме или в натуре соответственно балансу, составленного на момент убытия такого участника из общества.

Статья 132. Ликвидация полного общества
1. Полное общество ликвидируется на основаниях, установленных статьей 110 Гражданского кодекса Украины, а также в случае, если в обществе остается один участник. Этот участник имеет право на протяжении шести месяцев с момента, когда он стал единым участником общества, превратить такое общество в другое хозяйственное общество в порядке, установленному этим Кодексом.
2. В случае выхода участника из полного общества, исключение одного из его участников из общества, смерти участника общества, ликвидации юридического лица - участника общества или обращение кредитором одного из участников взыскания на часть имущества, пропорциональную его доле в уставном капитале, общество может продолжить свою деятельность, если это предусмотрено учредительским договором общества или договоренностью между участниками, которые остаются.
3. Коммандитное общество

Статья 133. Основные положения о коммандитном обществе
1. Коммандитным обществом является общество, в котором вместе с участниками, которые осуществляют от лица общества предпринимательскую деятельность и солидарно несут дополнительную (субсидиарную) ответственность по обязательствам общества всем своим имуществом (полными участниками), есть одних или несколько участников (вкладчиков), которые несут риск убытков, связанных с деятельностью общества, в границах сумм сделанных ими вкладов и не берут участия в деятельности общества.
2. Наименование коммандитного общества может содержать имена (наименование) всех полных участников, слова "коммандитное общество" или содержать имени (наименование) хотя бы одного полного участника с приданием слов "и компания", а также слова "коммандитное общество".
Если в название коммандитного общества включено имя вкладчика, такой вкладчик становится полным участником общества.
3. К коммандитному обществу применяются положения о полном обществе, если другое не установлено Гражданским кодексом Украины, или другим законом.

Статья 134. Учредительский договор коммандитного общества
1. Коммандитное общество создается и действует на основании учредительского договора. Учредительский договор подписывается всеми полными участниками.
2. Учредительский договор коммандитного общества кроме сведений, предусмотренных статьей 88 Гражданского кодекса Украины, может содержать сведения про: размер и состав уставного капитала общества; размер и порядок изменения долей любого из полных участников в уставном капитале; совокупный размер вкладов вкладчиков.
3. Если вследствие выхода, исключения или убытие в коммандитном обществе остался один полный участник, учредительский договор переоформляется в единоличное заявление, подписанное полным участником. Если коммандитное общество создается одним полным участником, то учредительным документом является единоличное заявление (меморандум), которое содержит все сведения, установленные этой статьей для коммандитного общества.

Статья 135. Участники коммандитного общества
1. Правовой статус полных участников коммандитного общества и их ответственность по обязательствам общества устанавливаются положениями Гражданского кодекса Украины об участниках полного общества.
2. Лицо может быть полным участником только в одном коммандитном обществе.
Полный участник коммандитного общества не может быть участником полного общества.
Полный участник коммандитного общества не может быть вкладчиком этого самого общества.
3. Совокупный размер вкладов вкладчиков не должен превышать пятидесяти процентов уставного капитала полного общества.
На момент государственной регистрации коммандитного общества любой из вкладчиков должен сделать вклад в размере, установленном законом.

Статья 136. Управление коммандитным обществом
1. Управление деятельностью коммандитного общества осуществляется полными участниками в порядке, установленном Гражданским кодексом Украины для полного общества.
2. Вкладчики не имеют права брать участия в управлении деятельностью коммандитного общества и возражать против действий полных участников относительно управления деятельностью общества. Вкладчики коммандитного общества могут действовать от лица общества только по доверенности.

Статья 137. Права и обязанности вкладчика коммандитного общества
1. Вкладчик коммандитного общества обязан сделать вклад в уставный капиталу. Внесение вкладов заверяется свидетельством об участии в коммандитном обществе.
2. Вкладчик коммандитного общества имеет право:
получать часть прибыли общества соответственно его частице в уставном капитале общества в порядке, установленном учредительским договором (меморандумом);
действовать от лица общества в случае выдачи ему доверенности и соответственно ей;
преимущественно перед третьими лицами приобретать отчуждаемую долю (ее часть) в уставном капитале общества соответственно положениям статьи 147 Гражданского кодекса Украины.
Если желание выкупить частицу (ее часть) выразили несколько вкладчиков, указанная доля распределяется между ними соответственно их долям в уставном капитале общества;
требовать первоочередного возвращения вклада в случае ликвидации общества;
ознакомляться с годовыми отчетами и балансами общества;
после окончания финансового года выйти из общества и получить свой вклад в порядке, установленном учредительским договором (меморандумом);
передать свою долю (ее часть) в уставном капитале другому вкладчику или третьему лицу, сообщив об этом обществу.
Передача вкладчиком всей своей доли другому лицу прекращает его участие в коммандитном обществе.
3. Учредительским договором (меморандумом) коммандитного общества могут быть предусмотрены также другие права вкладчика.

Статья 138. Ответственность вкладчика коммандитного общества
1. Если вкладчик коммандитного общества совершает сделку от лица и в интересах общества без соответствующих полномочий, то в случае одобрения его действий коммандитным обществом он освобождается от ответственности перед кредиторами за совершенную сделку.
Если одобрение коммандитного общества не будет получено, вкладчик отвечает перед третьими лицами за совершенную им сделку всем своим имуществом, на которое соответственно закону может быть обращено взыскание.
2. Вкладчик коммандитного общества, которое не внесло предусмотренного учредительским договором (меморандумом) вклада, несет ответственность перед обществом в порядке, установленному учредительским договором (меморандумом).

Статья 139. Ликвидация коммандитного общества
1. Коммандитное общество ликвидируется при убытии всех вкладчиков. Полные участники имеют право в случае убытия всех вкладчиков превратить коммандитное общество в полное общество. Коммандитное общество ликвидируется также на основаниях, установленных статьей 132 Гражданского кодекса Украины. Коммандитное общество не обязано ликвидироваться, если в нем остаются хотя бы один полный участник и один вкладчик.
2. В случае ликвидации коммандитного общества, после расчетов с кредиторами, вкладчики имеют преобладающее право перед полными участниками на получение вкладов в порядке и на условиях, установленных этим Кодексом, другим законом и учредительским договором (меморандумом). При недостаточности средств общества для полного возвращения вкладчикам их вкладов, имеющиеся средства распределяются между вкладчиками пропорционально к их долям в уставном капитале общества.
4. Общество с ограниченной ответственностью
Название подраздела 4 § 1 главы 8 "4. Общество с ограниченной ответственностью" исключено на основании Закона № 2275-VIII от 06.02.2018

Статья 140. Понятие общества с ограниченной ответственностью
1. Обществом с ограниченной ответственностью является основанное одним или несколькими лицами общество, уставной капитал которого разделен на доли, размер которых устанавливается уставом.
2. Участники общества с ограниченной ответственностью не отвечают по его обязательствам и несут риск убытков, связанных с деятельностью общества, в границах стоимости своих вкладов. Участники общества, которые не полностью внесли вклады, несут солидарную ответственность по его обязательствам в границах стоимости невнесенной части вклада любого из участников.
3. Наименование общества с ограниченной ответственностью может содержать наименования общества, а также слова "общество с ограниченной ответственностью".

Статья 140 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 141. Участники общества с ограниченной ответственностью
1. Максимальное количество участников общества с ограниченной ответственностью устанавливается законом. При превышении этого количества общество с ограниченной ответственностью подлежит преобразованию в акционерное общество на протяжении одного года, а по истечении этого срока - ликвидации в судебном порядке, если количество его участников не уменьшится в установленных пределах.
2. Общество с ограниченной ответственностью не может иметь единым участником другое хозяйственное общество, участником которого является одно лицо. Лицо может быть участником лишь одного общества с ограниченной ответственностью, которое имеет одного участника.

Статья 141 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 142. Договор об учреждении общества с ограниченной ответственностью
1. Если общество с ограниченной ответственностью основывается несколькими лицами, эти лица в случае необходимости определить взаимоотношения между собою относительно создания общества заключают договор в письменной форме, который устанавливает порядок учреждения общества, условия осуществления совместной деятельности относительно создания общества, размер уставного капитала, долю в уставном капитале любого из участников, сроки и порядок внесения вкладов и прочие условия.
2. Договор об учреждении общества с ограниченной ответственностью не является учредительным документом. Представление настоящего договора при государственной регистрации общества не является обязательным.

Статья 142 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 143. Устав общества с ограниченной ответственностью
1. Учредительным документом общества с ограниченной ответственностью является устав.
Устав общества с ограниченной ответственностью кроме сведений, предусмотренных статьей 88 Гражданского кодекса Украины, может содержать сведения про: размер уставного капитала, с определением доли каждого участника; состав и компетенцию органов управления и порядок принятия ими решений; размер и порядок формирования резервного фонда; порядок передачи (перехода) долей в уставном фонде.
2. Устав общества с ограниченной ответственностью со всеми следующими изменениями сохраняется в органе, который осуществил государственную регистрацию общества, и является открытым для ознакомления.

Статья 143 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 144. Уставной капитал общества с ограниченной ответственностью
1. Уставной капитал общества с ограниченной ответственностью состоит из стоимости вкладов его участников.
Соответственно уставному капиталу определяется минимальный размер имущества общества, которое гарантирует интересы его кредиторов. Размер уставного капитала общества не может быть меньше размера, установленного законом.
2. Не допускается увольнение участника общества с ограниченной ответственностью от обязанности внесения вклада в уставной капитал общества, в том числе путем зачисления требований к обществу.
3. Уставной капитал общества с ограниченной ответственностью подлежащей уплате участниками общества до окончания первого года с дня государственной регистрации общества.
Если участники до окончания первого года со дня государственной регистрации общества не внесли (не полностью внесли) свои вклады, Общее собрание участников принимает одно из следующих решений:
об исключении из состава общества тех участников, которые не внесли (не полностью внесли) свои вклады, и об определении порядка перераспределения долей в уставном капитале;
об уменьшении уставного капитала и об определении порядка перераспределения долей в уставном капитале;
о ликвидации общества.
Изменения в устав, связанные с изменением размера уставного капитала и / или с изменением состава участников, подлежат государственной регистрации в установленном законом порядке.
Решение об уменьшении уставного капитала общества направляется почтовым отправлением всем кредиторам общества не позднее трехдневного срока со дня его принятия.
4. Если после окончания второго или каждого следующего финансового года стоимость чистых активов общества с ограниченной ответственностью окажется меньше уставного капитала, общество обязано объявить об уменьшении своего уставного капитала и зарегистрировать соответствующие изменения в устав в установленном порядке, если участники не приняли решения о внесении дополнительных вкладов. Если стоимость чистых активов общества становится меньше определенного законом минимального размера уставного капитала, общество подлежит ликвидации.
5. Уменьшение уставного капитала общества с ограниченной ответственностью допускается после сообщения в порядке, установленном законом, всех его кредиторов. В этом случае кредиторы имеют право требовать досрочного прекращения или выполнения соответствующих обязательств общества и возмещения им убытков.
6. Увеличение уставного капитала общества с ограниченной ответственностью допускается после внесения всеми его участниками вкладов в полном объеме. Порядок внесения дополнительных вкладов устанавливается законом и уставом общества.

Статья 144 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 145. Управление обществом с ограниченной ответственностью
1. Вышестоящим органом общества с ограниченной ответственностью являются общие сборы его участников.
2. В обществе с ограниченной ответственностью создается исполнительный орган (коллегиальный или единоличный), осуществляющий текущее руководство за его деятельностью и является подотчетным общим сборам его участников. Исполнительный орган общества может быть избран также и не из состава участников общества.
3. Компетенция исполнительного органа общества с ограниченной ответственностью, порядок принятия им решений и порядок совершения действий от лица общества устанавливаются этим Кодексом, другим законом и уставом общества.
4. К исключительной компетенции общих сборов участников общества с ограниченной ответственностью относятся:
определение основных направлений деятельности общества, утверждение его планов и отчетов об их выполнении;
внесение изменений в устав общества, изменение размера его уставного капитала;
создание и отзыв исполнительного органа общества;
определение форм контроля за деятельностью исполнительного органа, создание и определение полномочий соответствующих контрольных органов;
утверждение годовых отчетов и бухгалтерских балансов, распределение прибыли и убытков общества;
решение вопроса о приобретении обществом долей участников;
исключение участника из общества;
принятие решения о ликвидации общества, назначение ликвидационной комиссии, утверждение ликвидационного баланса.
Уставом общества и законом к исключительной компетенции общего собрания может быть также отнесено решение других вопросов.
Вопросы, отнесенные к исключительной компетенции общих сборов участников общества, не могут быть переданы ими для решения исполнительному органу общества.
Очередность и порядок созыва общего собрания устанавливаются уставом общества и законом.

Статья 145 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 146. Контроль за деятельностью исполнительного органа общества с ограниченной ответственностью
1. Контроль за деятельностью исполнительного органа общества с ограниченной ответственностью осуществляется в порядке, установленном уставом и законом.
2. Общие сборы общества с ограниченной ответственностью могут формировать органы, которые осуществляют постоянный контроль за финансово-хозяйственной деятельностью исполнительного органа. Порядок создания и полномочия контрольного органа устанавливаются общими сборами участников общества.
3. Для осуществления контроля за финансовой деятельностью общества с ограниченной ответственностью в соответствии с решением его общего собрания, а также в других случаях, установленных уставом и законом общества, может назначаться аудиторская проверка.
4. Порядок проведения аудиторских проверок деятельности и отчетности общества с ограниченной ответственностью устанавливается уставом общества и законом.
По требованию кого-нибудь из участников общества может быть проведена аудиторская проверка годовой финансовой отчетности общества с привлечением профессионального аудитора, не связанного имущественными интересами с обществом или с его участниками.
Затраты, связанные с проведением такой проверки, возлагаются на участника, по требованию которого проводится аудиторская проверка, если другое не установлено уставом общества.
5. Публичная отчетность общества с ограниченной ответственностью о результатах его деятельности не требуется, кроме случаев, установленных законом.

Статья 146 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 147. Переход доли (ее части) участника в уставном капитале общества с ограниченной ответственностью к другому лицу
1. Участник общества с ограниченной ответственностью имеет право продать ли иным образом отчуждать свою долю (ее часть) в уставном капитале один или нескольким участникам этого общества.
2. Отчуждение участником общества с ограниченной ответственностью своей доли (ее части) третьим лицам допускается, если другое не установлено уставом общества.
Участники общества пользуются преобладающим правом покупки доли (ее части) участника пропорционально к размерам своих долей, если уставом общества или договоренностью между участниками не установлен другой порядок осуществления этого права. Покупка осуществляется по цене и прочим условиям, при которых доля (ее часть) предлагалась для продажи третьим лицам. Если участники общества не воспользуются своим преобладающим правом в течение месяца со дня сообщения о намерении участника продать долю (ее часть) или на протяжении другого срока, установленного уставом общества или договоренностью между его участниками, доля (ее часть) участника может быть отчуждена третьему лицу.
3. Доля участника общества с ограниченной ответственностью может быть отчуждена к полной ее уплате лишь в той части, в которой за нее уже уплачено.
4. В случае приобретения доли (ее части) участника самим обществом с ограниченной ответственностью оно обязано реализовать ее другим участникам или третьим лицам на протяжении срока и в порядке, установленных уставом и законом, или уменьшить свой уставной капитал соответственно статье 144 Гражданского кодекса Украины.
5. Доля в уставном капитале общества с ограниченной ответственностью переходит к наследнику физического лица или правопреемника юридического лица - участника общества, если уставом общества не предусмотрено, что такой переход допускается лишь по согласию других участников общества.
Расчеты с наследниками (правопреемниками) участника, которые не вступили в общество, осуществляются в соответствии с положениями статьи 148 Гражданского кодекса Украины.

Статья 147 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 148. Выход участника из общества с ограниченной ответственностью
1. Участник общества с ограниченной ответственностью вправе выйти из общества, заявив об этом не позднее чем за три месяца до выхода, если иной срок не установлен уставом. Подлинность подписи на заявлении о выходе из общества подлежит нотариальному удостоверению.
2. Участник, который выходит из общества с ограниченной ответственностью, имеет право получить стоимость части имущества, пропорциональную его доли в уставном капитале общества. По договоренности между участником и обществом выплата стоимости части имущества общества может быть заменена передачей имущества в натуре.
Если вклад в уставный капитал был осуществлен путем передачи права пользования имуществом, соответствующее имущество возвращается участнику без выплаты вознаграждения.
Порядок и способ определения стоимости части имущества, пропорциональны доле участника в уставном капитале, а также порядок и сроки ее выплаты устанавливаются уставом и законом.
3. Споры, которые возникают в связи с выходом участника из общества с ограниченной ответственностью, в том числе споры относительно порядка определения доли в уставном капитале, ее размера и сроков выплаты, решаются судом.

Статья 148 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 149. Обращение взыскания на часть имущества общества с ограниченной ответственностью, пропорциональную доле участника общества в уставном капитале
1. Обращение взыскания на часть имущества общества с ограниченной ответственностью, пропорциональную доле участника общества в уставном капитале, за его личными долгами допускается лишь в случае недостаточности у него другого имущества для удовлетворения требований кредиторов. Кредиторы такого участника имеют право требовать от общества выплаты стоимости части имущества общества, пропорциональной доле должника в уставном капитале общества, или выделения соответствующей части имущества для обращения на него взыскания. Часть имущества, подлежащего выделению, или объем средств, которые составляют его стоимость, устанавливается в соответствии с балансом, который складывается на дату предъявления требований кредиторами.
2. Обращение взыскания на всю долю участника в уставном капитале общества с ограниченной ответственностью прекращает его участие в обществе.

Статья 149 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 150. Ликвидация общества с ограниченной ответственностью
1. Общество с ограниченной ответственностью может быть ликвидировано по решению общих сборов его участников, в том числе в связи с истечением срока, на который общество было создано, а также по решению суда - в случаях, установленных законом.
2. Общество с ограниченной ответственностью может быть преобразовано в акционерное общество или в производственный кооператив.

Статья 150 исключена на основании Закона № 2275-VIII от 06.02.2018

Статья 151. Понятие общества с дополнительной ответственностью
1. Обществом с дополнительной ответственностью является общество, основанное одним или несколькими лицами, Уставной капитал которого разделен на доли, размер которых определен уставом.
2. Участники общества с дополнительной ответственностью солидарно несут дополнительную (субсидиарную) ответственность по его обязательствам своим имуществом в размере, который устанавливается уставом общества и является одинаково кратным для всех участников к стоимости внесенного каждым участником вклада. В случае признания банкротом одного из участников его ответственность по обязательствам общества распределяется между другими участниками общества пропорционально их долям в уставном капитале общества.
3. Наименование общества с дополнительной ответственностью должно содержать наименование общества, а также слова "общество с дополнительной ответственностью".
4. К обществу с дополнительной ответственностью применяются положения Гражданского кодекса Украины об обществе с ограниченной ответственностью, если другое не установлено уставом общества и законом.

Статья 151 исключена на основании Закона № 2275-VIII от 06.02.2018
5. Акционерное общество

Статья 152. Понятие акционерного общества
1. Акционерное общество - хозяйственное общество, уставный капитал которого разделен на определенное количество долей одинаковой номинальной стоимости, корпоративные права по которым удостоверяются акциями.
2. Акционерное общество самостоятельно отвечает по своим обязательствам всем своим имуществом. Акционеры не отвечают по обязательствам общества и несут риск убытков, связанных с деятельностью общества, в пределах стоимости акций, которые им принадлежат (кроме случаев, установленных законом).
Акционеры, которые не полностью оплатили акции, в случаях, установленных уставом, отвечают по обязательствам общества в пределах неоплаченной части стоимости принадлежащих им акций.
Гарантии защиты имущественных прав акционеров устанавливаются законом.
3. Наименование акционерного общества должно содержать его наименование и указание того, что общество является акционерным.
4. Особенности правового статуса акционерных обществ, созданных в процессе приватизации государственных предприятий, устанавливаются законом.
Порядок создания, деятельности и прекращения корпоративных инвестиционных фондов регулируется законодательством об институтах совместного инвестирования.
5. Акционерное общество, которое осуществляет публичное размещение акций, обязано ежегодно публиковать для всеобщего сведения годовой отчет, бухгалтерский баланс, сведения о доходах и убытки, а также другую информацию, предусмотренную законом.
6. Акционерные общества по типу разделяются на публичные общества и частные общества. Особенности правового статуса публичных и частных акционерных обществ устанавливаются законом.

Статья 153. Создание акционерного общества
1. Акционерное общество может быть создано юридическими и (или) физическими лицами, а также государством в лице уполномоченного органа, территориальной общиной в лице уполномоченного органа.
2. Если акционерное общество создается несколькими людьми, они заключают между собой договор, который определяет порядок осуществления ими общей деятельности относительно создания общества.
Настоящий договор не является учредительным документом общества.
Договор о создании акционерного общества заключается в письменной форме, а если общество создается физическими лицами, договор подлежит нотариальному удостоверению.
3. Лица, которые создают акционерное общество, несут солидарную ответственность по обязательствам, которые возникли при государственной регистрации общества.
Акционерное общество отвечает по обязательствам участников, связанных с его созданием, лишь в случае следующего одобрения их действий общим собранием акционеров.
4. Акционерное общество может быть создано одним человеком или может состоять из одного человека в случае приобретения одним акционером всех акций общества. Ведомости об этом подлежат регистрации и опубликованию для общего известная.
Акционерное общество не может иметь единым участником другое предпринимательское общество, участником которого является один человек.
5. Порядок и сроки совершения действий относительно создания акционерного общества, в том числе порядок проведения учредительного собрания и их компетенция, устанавливаются законом.

Статья 154. Устав акционерного общества
1. Учредительным документом акционерного общества является его устав.
2. Устав акционерного общества кроме ведомостей, предусмотренных статьей 88 Гражданского кодекса Украины, должны содержать ведомости о: размере уставного капитала; сведения о категориях акций, которые выпускаются обществом, и их нарицательную стоимость и количество; права акционеров; состав и компетенцию органов управления обществом и о порядке принятия ими решений. В уставе акционерного общества должны также содержаться другие ведомости, предусмотренные законом.

Статья 155. Уставной капитал акционерного общества
1. Уставной капитал акционерного общества образовывается из стоимости вкладов акционеров, внесенных вследствие приобретения ими акций.
Уставной капитал общества определяет минимальный размер имущества общества, который гарантирует интересы его кредиторов. Он не может быть меньшим размера, установленного законом.
2. В процессе создания акционерного общества его акции подлежат размещению исключительно среди учредителей путем частного размещения. Публичное размещение акций осуществляется после получения свидетельства о регистрации первого выпуска акций.
3. Если после истечения второго и каждого следующего финансового года стоимость чистых активов акционерного общества окажется меньше уставного капитала, общество обязано объявить об уменьшении своего уставного капитала и зарегистрировать соответствующие изменения в устав в установленном порядке. Если стоимость чистых активов общества становится меньше минимального размера уставного капитала, установленного законом, общество подлежит ликвидации.

Статья 156. Увеличение уставного капитала акционерного общества
1. Акционерное общество имеет право по решению общего собрания акционеров увеличить Уставной капитал путем увеличения нарицательной стоимости акций или дополнительного выпуска акций.
2. Увеличение уставного капитала акционерного общества допускается после его полной уплаты. Увеличение уставного капитала общества для покрытия убытков не допускается.
3. В случаях, установленных уставом общества и законом, может быть установлено преобладающее право акционеров на приобретение акций, которые дополнительно выпускаются обществом.

Статья 157. Уменьшение уставного капитала акционерного общества
1. Акционерное общество имеет право по решению общих сборов акционеров уменьшить Уставной капитал путем уменьшения нарицательной стоимости акций или путем покупки обществом части выпущенных акций с целью уменьшения их общего количества.
Уменьшение уставного капитала акционерного общества допускается после сообщения об этом всем его кредиторам в порядке, установленном законом. При этом кредиторы общества имеют право требовать досрочного прекращения или выполнения обществом соответствующих обязательств и возмещения убытков.
2. Уменьшение уставного капитала акционерного общества путем покупки и погашения части акций допускается, если такая возможность предусмотрена в уставе общества.
3. Уменьшение акционерным обществом уставного капитала ниже установленного законом размера ведет к ликвидации общества.

Статья 158. Ограничение относительно выпуска ценных бумаг и относительно выплаты дивидендов
1. Доля привилегированных акций в общем объеме уставного капитала акционерного общества не может превышать двадцати пяти процентов.
2. Часть вторая статьи 158 исключена на основании Закона N 3480 - IV от 23.02.2006./p>
3. Акционерное общество не имеет права объявлять и выплачивать дивиденды:
до полной уплаты всего уставного капитала;
при уменьшении стоимости чистых активов акционерного общества до размера, меньшего, чем размер уставного капитала и резервного фонда;
в других случаях, установленных законом.

Статья 159. Общее собрание акционеров
1. Вышестоящим органом акционерного общества является общее собрание акционеров. В общем собрании имеют право принимать участие все его акционеры независимо от количества и вида акций, которые им принадлежат.
Акционеры (их представители), которые принимают участие в общем собрании, регистрируются с указанием количества голосов, которые имеет каждый акционер, который принимает участие в собрании.
2. К исключительной компетенции общего собрания акционеров принадлежит:
внесение изменений в устав общества, в том числе изменение размера его уставного капитала;
образование и ликвидация наблюдательного совета и других органов общества, избрание и отзыв членов наблюдательного совета;
утверждение годового отчета общества;
решение о ликвидации общества.
К исключительной компетенции общих сборов уставом общества и законом может быть также отнесено решение других вопросов.
Вопросы, отнесенные законом к исключительной компетенции общего собрания акционеров, не могут быть переданы им для решения другим органам общества.
3. Порядок голосования на общем собрании акционеров устанавливается законом.
Акционер имеет право назначить своего представителя для участия в собрании. Представитель может быть постоянным или предназначенным на определенный срок. Акционер имеет право в любой момент заменить своего представителя в вышестоящем органе общества, сообщив об этом в исполнительный орган акционерного общества.
4. Решение общих собраниях акционеров принимаются большинством не менее чем в 3/4 голосов акционеров, которые принимают участие в собрании, относительно:
внесения изменений в устав общества;
ликвидации общества, кроме случаев, установленных законом;
вопросов, предусмотренных законом, регулирующим вопросы создания, деятельности и прекращения акционерных обществ.
По другим вопросам решения принимаются простым большинством голосов акционеров, которые принимают участие в собрании.
5. Общие собрания акционеров созываются не реже одного раза в год.
Внеочередные собрания акционеров созываются в случае неплатежеспособности общества, а также при наличии обстоятельств, определенных в уставе общества, и в любом другом случае, если этого требуют интересы акционерного общества в целом.
Порядок созыва и проведения общего собрания, а также условия созыва и проводка внеочередного собрания и сообщение акционеров устанавливаются уставом общества и законом.

Статья 160. Наблюдательный совет акционерного общества
1. В акционерном обществе может быть создан Наблюдательный совет акционерного общества, который осуществляет контроль за деятельностью его исполнительного органа и защиту прав акционеров общества.
Случаи обязательного создания в акционерном обществе наблюдательного совета устанавливаются законом.
2. Уставом акционерного общества и законом устанавливается исключительная компетенция наблюдательного совета. Вопросы, отнесенные уставом к исключительной компетенции наблюдательного совета, не могут быть переданы им для решения исполнительным органом общества.
3. Члены наблюдательного совета акционерного общества не могут быть членами его исполнительного органа.
4. Наблюдательный совет акционерного общества определяет формы контроля за деятельностью его исполнительного органа.

Статья 161. Исполнительный орган акционерного общества
1. Исполнительным органом акционерного общества, который осуществляет руководство его текущей деятельностью, является правление или другой орган, определенный уставом.
Исполнительный орган решает все вопросы деятельности акционерного общества, кроме отнесенных к компетенции общего собрания и наблюдательного совета общества.
Исполнительный орган является подотчетным общему собранию акционеров и надзорному совету акционерного общества и организовывает выполнение их решений. Исполнительный орган действует от лица акционерного общества в пределах, установленных уставом акционерного общества и законом.
2. Исполнительный орган акционерного общества может быть коллегиальным (правление, дирекция) или единоличным (директор, генеральный директор).

Статья 162. Аудиторская проверка
1. Акционерное общество, которое обязано согласно закону публиковать для общего ознакомления документы, предусмотренные статьей 152 Гражданского кодекса Украины, должно для проверки и подтверждения правильности годовой финансовой отчетности ежегодно привлекать аудитора, не связанного имущественными интересами с обществом или с его участниками.
2. Аудиторская проверка деятельности акционерного общества, в том числе, не обязаного публиковать для общего ознакомления документы, должна быть проведена в любое время по требованию акционеров, которые вместе владеют не менее чем десятью процентами акций.
Порядок проводки аудиторских проверок деятельности акционерного общества устанавливается уставом общества и законом.
Расходы, связанные с проводкой такой проверки, полагаются на лица, по требованию которых проводится аудиторская проверка, если общими собранием акционеров не будет принято решение о другом.
Параграф 2 - Производственный кооператив

Статья 163. Понятие производственного кооператива
1. Производственным кооперативом является добровольное объединение граждан на началах членства для общей производственной или другой хозяйственной деятельности, которая базируется на их личном трудовом участии и объединении его членами имущественных паевых взносов. Уставом кооператива и законом может быть предусмотрено участие в деятельности производственного кооператива на началах членства также других лиц.
2. Члены производственного кооператива несут субсидиарную ответственность по обязательствам кооператива в размерах и порядке, установленных уставом кооператива и законом.
3. Наименование кооператива должно содержать его название, а также слова "производственный кооператив".
4. Правовой статус производственных кооперативов, права и обязанности их членов устанавливаются этим Кодексом и другим законом.
5. Особенности создания и деятельности сельскохозяйственных кооперативов могут устанавливаться законом.

Статья 164. Учредительные документы производственного кооператива
1. Учредительным документом производственного кооператива является его устав, который утверждается общими сборами его членов.
2. Устав производственного кооператива должен содержать кроме ведомостей, предусмотренных статьей 88 Гражданского кодекса Украины, ведомости о: размере паевого взноса члена кооператива; состав и порядок внесения паевых взносов членами кооператива и их ответственность за нарушение обязательства относительно внесения паевых взносов; характер и порядок трудового участия его членов в деятельности кооператива и их ответственности за нарушение обязательств относительно личного трудового участия; порядок распределения прибыли и убытков кооператива; размер и условия субсидиарной ответственности его членов по обязательствам кооператива; состав и компетенцию органов управления кооператива и о порядке принятия ими решений.
3. Количество членов кооператива не может быть меньше, установленного законом.

Статья 165. Имущество производственного кооператива
1. Имущество, которое находится в собственности производственного кооператива, делится на паи его членов согласно уставу кооператива.
2. Член производственного кооператива обязан внести в день государственной регистрации кооператива не меньше десяти процентов паевого взноса, а часть, которая осталась, - на протяжении года со дня его государственной регистрации, если другой срок не установлен уставом кооператива.
Порядок внесения паевых взносов членами производственного кооператива устанавливается уставом кооператива и законом.
3. Производственный кооператив не имеет права выпускать акции.
4. Прибыль производственного кооператива распределяется между его членами согласно их трудовому участию, если другой порядок не установлен уставом кооператива.
5. Имущество, которое осталось после ликвидации производственного кооператива и удовлетворение требований его кредиторов, распределяется между его членами согласно их трудовому участию, если другой порядок не установлен уставом кооператива.

Статья 166. Прекращение членства в производственном кооперативе и переход пая
1. Член производственного кооператива имеет право на выход из кооператива. В этом случае ему выплачивается стоимость пая или выдается имущество, пропорциональное размеру его пая, а также осуществляются выплаты, установленные уставом кооператива.
Выдача пая, выплата стоимости пая и другие выплаты члену кооператива, который выходит из него, осуществляются в порядке, установленном уставом кооператива и законом.
2. Член производственного кооператива может быть исключен из кооператива по решению общего собрания в случае невыполнения или ненадлежащего выполнения обязанностей, возложенных на него уставом кооператива, а также в других случаях, установленных уставом кооператива и законом.
Член производственного кооператива, которого исключили из кооператива, имеет право на получение пая и других выплат, установленных уставом кооператива, согласно части первой этой статьи.
3. Член производственного кооператива имеет право передать свой пай или его часть другому члену кооператива, если другое не установлено уставом кооператива и законом.
Передача пая (его части) лицу, которое не является членом производственного кооператива, допускается лишь по согласию кооператива. В этом случае другие члены кооператива пользуются преобладающим правом покупки такого пая (его части). Порядок отчуждения пая или его части другому члену кооператива или третьему лицу устанавливается уставом кооператива и законом.
4. В случае смерти члена производственного кооператива его наследники могут быть приняты в члены кооператива, если другое не установлено уставом кооператива. За отказы принять наследников в члены кооператива кооператив выплачивает наследникам стоимость пая умершего члена кооператива.
5. Обращение взыскания на пай члена производственного кооператива по его собственным обязательствам допускается лишь в случае недостаточности у него другого имущества в порядке, установленном уставом кооператива и законом.
6. В случае обращения залогодержателем взыскания на пай члена производственного кооператива, который передан в залог, применяются положение части третьей этой статьи.
"""

GKU_g_9 = """ 
Глава 9 - Гражданского кодекса
Правовые формы участия государства, АР Крым, территориальных общин в гражданских отношениях

Статья 167. Правовые формы участия государства в гражданских отношениях
1. Государство действует в гражданских отношениях на равных правах с другими участниками этих отношений.
2. Государство может создавать юридические лица публичного права (государственные предприятия, учебные заведения и т.п.) в случаях и в порядке, установленных Конституцией Украины и законом.
3. Государство может создавать юридические лица частного права (предпринимательские общества и т.п.), принимать участие в их деятельности на общих основаниях, если другое не установлено законом

Статья 168. Правовые формы участия Автономной Республики Крым в гражданских отношениях
1. Автономная Республика Крым действует в гражданских отношениях на равных правах с другими участниками этих отношений.
2. Автономная Республика Крым может создавать юридические лица публичного права (учебные заведения и т.п.) в случаях и в порядке, установленных Конституцией Украины и законом.
3. Автономная Республика Крым может создавать юридические лица частного права (предпринимательские общества и т.п.), принимать участие в их деятельности на общих основаниях, если другое не установлено законом

Статья 169. Правовые формы участия территориальных общин в гражданских отношениях
1. Территориальные общины действуют в гражданских отношениях на равных правах с другими участниками этих отношений.
2. Территориальные общины могут создавать юридические лица публичного права (коммунальные предприятия, общие коммунальные предприятия, учебные заведения и т.п.) в случаях и в порядке, установленных Конституцией Украины и законом.
3. Территориальные общины могут создавать юридические лица частного права (предпринимательские общества и т.п.), принимать участие в их деятельности на общих основаниях, если другое не установлено законом.
"""

GKU_g_10 = """ 
Глава 10 - Гражданского кодекса
Органы и представители, через которых действуют государство, АР Крым, территориальные общины в гражданских отношениях

Статья 170. Органы, через которых действует государство в гражданских отношениях
1. Государство приобретает и осуществляет гражданские права и обязанности через органы государственной власти в границах их компетенции, установленной законом.

Статья 171. Органы, через которых действует Автономная Республика Крым в гражданских отношениях
1. Автономная Республика Крым приобретает и осуществляет гражданские права и обязанности через органы власти Автономной Республики Крым в границах их компетенции, установленной законом.

Статья 172. Органы, через которых действуют территориальные общины в гражданских отношениях
1. Территориальные общины приобретают и осуществляют гражданские права и обязанности через органы местного самоуправления в границах их компетенции, установленной законом.

Статья 173. Представители государства, Автономной Республики Крым, территориальных общин
1. В случаях и в порядке, установленных законом, другими нормативно-правовыми актами, от лица государства, Автономной Республики Крым, территориальных общин за специальными поручениями могут выступать физические и юридические лица, органы государственной власти, органы власти Автономной Республики Крым и органы местного самоуправления.
2. Государство приобретает и осуществляет гражданские права и обязанности через органы государственной власти в границах их компетенции, установленной законом.
3. Автономная Республика Крым приобретает и осуществляет гражданские права и обязанности через органы власти Автономной Республики Крым в границах их компетенции, установленной законом.
4. Территориальные общины приобретают и осуществляют гражданские права и обязанности через органы местного самоуправления в границах их компетенции, установленной законом.
5. В случаях и в порядке, установленных законом, другими нормативно-правовыми актами, от лица государства, Автономной Республики Крым, территориальных общин за специальными поручениями могут выступать физические и юридические лица, органы государственной власти, органы власти Автономной Республики Крым и органы местного самоуправления.
"""

GKU_g_11 = """ 
Глава 11 - Гражданского кодекса
Ответственность по обязательствам государства, АР Крым, территориальных общин

Статья 174. Ответственность по обязательствам государства
1. Государство отвечает по своим обязательствам своим имуществом, кроме имущества, на которое в соответствии с законом не может быть совершено взыскания.

Статья 175. Ответственность по обязательствам территориальных общин
1. Территориальные общины отвечают по своим обязательствам своим имуществом, кроме имущества, на которое в соответствии с законом не может быть совершено взыскания.

Статья 176. Размежевание ответственности по обязательствам государства, АР Крым, территориальных общин и созданных ими юридических лиц
1. Государство, Автономная Республика Крым, территориальные общины не отвечают по обязательствам созданных ими юридических лиц, кроме случаев, установленных законом.
2. Юридические лица, созданные государством, Автономной Республикой Крым, территориальными общинами, не отвечают по обязательствам соответственно государства, Автономной Республики Крым, территориальных общин.
3. Государство не отвечает по обязательствам Автономной Республики Крым и территориальных общин.
4. Автономная Республика Крым не отвечает по обязательствам государства и территориальных общин.
5. Территориальная община не отвечает по обязательствам государства, Автономной Республики Крым и других территориальных общин.
"""

GKU_g_12 = """ 
Глава 12 - Гражданского кодекса
Общие положения об объектах гражданских прав

Статья 177. Виды объектов гражданских прав
1. Объектами гражданских прав являются вещи, включая деньги и ценные бумаги, иное имущество, имущественные права, результаты работ, услуги, результаты интеллектуальной, творческой деятельности, информация, а также другие материальные и нематериальные блага.

Статья 178. Оборотоспособность объектов гражданских прав
1. Объекты гражданских прав могут свободно отчуждаться или переходить от одного лица к другому в порядке правопреемства или наследования или иным образом, если они не изъяты из гражданского оборота, или не ограничены в обороте, или не являются неотъемлемыми от физического или юридического лица.
2. Виды объектов гражданских прав, пребывание которых в гражданском обороте не допускается (объекты, изъятые из гражданского оборота), должны быть прямо установлены в законе.
Виды объектов гражданских прав, которые могут принадлежать лишь определенным участникам оборота или пребывание которых в гражданском обороте допускается при наличии специального разрешения (объекты, ограниченные в оборотоспособности), устанавливаются законом.
"""
GKU_g_13 = """ 
Глава 13 - Гражданского кодекса
Вещи. Имущество

Статья 179. Понятие вещи
1. Вещью является предмет материального мира, относительно которого могут возникать гражданские права и обязанности.

Статья 180. Животные
1. Животные являются особым объектом гражданских прав. На них распространяется правовой режим вещи, кроме случаев, установленных законом.
2. Правила обращения с животными устанавливаются законом.
3. Животные, занесенные в Красноую книгу Украины, могут быть предметом гражданского оборота лишь в случаях и порядке, установленных законом.

Статья 181. Недвижимое и движимое имущество
1. К недвижимым вещам (недвижимое имущество, недвижимость) принадлежат земельные участки, а также объекты, расположенные на земельном участке, перемещение которых является невозможным без их обесценения и изменения их назначения.
Режим недвижимой вещи может быть распространен законом на воздушные и морские судна, судна внутреннего плавания, космические объекты, а также другие вещи, права на которые подлежат государственной регистрации.
2. Движимыми вещами являются вещи, которые можно свободно перемещать в пространстве.

Статья 182. Государственная регистрация прав на недвижимость
1. Право собственности и прочие вещевые права на недвижимые вещи, ограничение этих прав, их возникновение, переход и прекращение подлежат государственной регистрации.
2. Государственная регистрация прав на недвижимость и сделок относительно недвижимости является публичной, осуществляется соответствующим органом, который обязан предоставлять информацию о регистрации и зарегистрированных правах в порядке, установленном законом.
3. Отказ в государственной регистрации права на недвижимость или сделок относительно недвижимости, уклонение от регистрации, отказ от предоставления информации о регистрации могут быть обжалованы в суде.
4. Порядок проведения государственной регистрации прав на недвижимость и основания отказа в ней устанавливаются законом.

Статья 183. Вещи делимые и неделимые
1. Делимой являетя вещь, которую можно поделить без потери ее целевого назначения.
2. Неделимой является вещь, которую нельзя поделить без потери ее целевого назначения.

Статья 184. Вещи, определенные индивидуальными или родственными признаками
1. Вещь обладает определенными индивидуальными признаками, если она наделена только ей присущими признаками, которые отличают ее от других однородных вещей, индивидуализируя ее.
Вещи, определенные индивидуальными признаками, являются незаменимыми.
2. Вещь обладает определенными родственными признаками, если она имеет признаки, присущие всем вещам того же рода, и измеряется числом, весом, мерой. Вещь, которая имеет лишь родственные признаки, является заменимой.

Статья 185. Вещи потребительские и непотребительские
1. Потребительской является вещь, которая вследствие одноразового ее использования уничтожается или прекращает существовать в первоначальном виде.
2. Непотребительской есть вещь, предназначенная для неоднократного использования, которая сохраняет при этом свой первоначальный вид на протяжении продолжительного времени.

Статья 186. Главная вещь и принадлежность
1. Вещь, предназначенная для обслуживания другой (главной) вещи и связанная с ней общим назначением, является ее принадлежностью.
2. Принадлежность следует за главной вещью, если другое не установлено договором или законом.

Статья 187. Составные части вещи
1. Составной частью вещи является все то, что не может быть отделено от вещи без ее повреждения или существенного обесценения.
2. При переходе права на вещь ее составные части не подлежат обособлению.

Статья 188. Сложные вещи
1. Если несколько вещей образовывают единое целое, которое дает возможность использовать его по назначению, они считаются одной вещью (сложная вещь).
2. Сделка, совершенная относительно сложной вещи, распространяется на все ее составные части, если другое не установлено договором.

Статья 189. Продукция, плоды и доходы
1. Продукцией, плодами и доходами является все то, что вырабатывается, добывается, получается из вещи или приносится вещью.
2. Продукция, плоды и доходы принадлежат собственнику вещи, если другое не установлено договором или законом.

Статья 190. Имущество
1. Имуществом как особым объектом считаются отдельная вещь, совокупность вещей, а также имущественные права и обязанности.
2. Имущественные права являются непотребляемой вещью. Имущественные права признаются вещественными правами.

Статья 191. Предприятие как единый имущественный комплекс
1. Предприятие является единым имущественным комплексом, который используется для осуществления предпринимательской деятельности.
2. В состав предприятия как единого имущественного комплекса входят все виды имущества, предназначенные для его деятельности, включая земельные участки, здания, сооружения, оборудование, инвентарь, сырье, продукцию, права требования, долги, а также право на торговую марку или другое обозначение и прочие права, если другое не установлено договором или законом.
3. Предприятие как единый имущественный комплекс является недвижимостью.
4. Предприятие или его часть могут быть объектом купли-продажи, залога, аренды и других сделок.

Статья 192. Деньги (денежные средства)
1. Законным платежным средством, обязательным к приему по нарицательной стоимости на всей территории Украины, является денежная единица Украины - гривна.
2. иностранная валюта может использоваться в Украине в случаях и в порядке, установленных законом.

Статья 193. Валютные ценности
1. Виды имущества, которые считаются валютными ценностями, и порядок совершения сделок с ними устанавливаются законом.
"""
GKU_g_14 = """ 
Глава 14 - Гражданского кодекса
Ценные бумаги

Статья 194. Понятие ценной бумаги
1. Ценной бумагой является документ установленной формы с соответствующими реквизитами, удостоверяющий денежное или другое имущественное право, определяет взаимоотношения эмитента ценной бумаги (лица, выдавшего ценную бумагу) и лица, имеющего права на ценную бумагу, и предусматривает выполнение обязательств по таким ценным бумагой, а также возможность передачи прав на ценную бумагу и прав по ценной бумаге другим лицам.
2. К лицу, которое приобрело право собственности на ценную бумагу, переходят в совокупности все права, которые им заверяются. (Часть вторую статьи 194 исключили на основании Закона № 5178-VI от 06.07.2012)

Статья 195. Группы и виды ценных бумаг
1. В Украине в гражданском обороте могут быть такие группы ценных бумаг:
долевые ценные бумаги, которые удостоверяют участие владельца таких ценных бумаг (инвестора) в уставном капитале и / или активах эмитента (в том числе активах, которые находятся в управлении эмитента) и предоставляют владельцу указанных ценных бумаг (инвестору) право на получение части прибыли (дохода ), в том числе в виде дивидендов и другие права, установленные законодательством, а также проспектом ценных бумаг или решением об эмиссии ценных бумаг;
долговые ценные бумаги, удостоверяющие отношения займа и предусматривают обязательства эмитента уплатить в определенный срок средства, передать товары или оказать услуги в соответствии с обязательством;
производные ценные бумаги, механизм размещения и обращения которых связан с правом на покупку или продажу в течение срока, установленного договором, ценных бумаг, других финансовых и / или товарных ресурсов;
товарораспорядительные ценные бумаги, которые предоставляют их держателю право распоряжаться имуществом, указанным в этих документах.
Законом могут определяться также другие группы ценных бумаг.
2. Виды ценных бумаг и порядок их оборота устанавливаются законом.
3. Ценные бумаги могут существовать в документарной и бездокументарной форме в соответствии с законом. (Часть третья статьи 195 исключена на основании Закона № 5178-VI от 06.07.2012)

Статья 196. Требования к ценной бумаге
1. Обязательные реквизиты ценных бумаг, требования относительно формы ценной бумаги и прочие необходимые требования устанавливаются законом.
2. Документ, который не содержит обязательных реквизитов ценных бумаг и не отвечает форме, установленной для ценных бумаг, не является ценной бумагой.

Статья 197. Права на ценную бумагу и права по ценной бумаге
1. К лицу, которое приобрело право на ценную бумагу, одновременно переходят в совокупности все права, которые им заверяются (права по ценной бумаге).
2. Ценные бумаги по форме выпуска могут быть на предъявителя, именные или ордерные.
Права на ценную бумагу и права по ценной бумаге, существующих в документарной форме, относятся:
предъявителю ценной бумаги (ценная бумага на предъявителя);
лицу, указанному в ценной бумаге (именная ценная бумага);
лицу, указанному в ценной бумаге, которая может сама реализовать такие права или назначить своим приказом другое уполномоченное лицо (ордерная ценная бумага).

Статья 198. Выполнение по ценной бумаге
1. Лицо, разместившее (выдавшее) ордерную ценную бумагу, и индоссанты по нему отвечают перед его законным владельцем солидарно, если иное не установлено законом. В случае удовлетворения требования законного владельца ценной бумаги об исполнении удостоверенного этой бумагой обязательства одним или несколькими лицами из числа тех, кто обязался по ценной бумаге они приобретают право обратного требования (регресса) в отношении других лиц, обязавшимся по ценной бумаге.
2. Отказ от выполнения обязательства, удостоверенного ценной бумагой, с ссылкой на отсутствие основания обязательства или на его недействительность не допускается.
Владелец незаконно изготовленной или подделанной ценной бумаги имеет право предъявить лицу, которое передало ему бумагу, требования о надлежащем выполнении обязательства, удостоверенного этой бумагой, и о возмещении убытков.
"""
GKU_g_15 = """ 
Глава 15 - Гражданского кодекса
Нематериальные блага

Статья 199. Результаты интеллектуальной, творческой деятельности
1. Результаты интеллектуальной, творческой деятельности и прочие объекты права интеллектуальной собственности создают гражданские права и обязанности соответственно Книге четвертой Гражданского Кодекса и других законов.

Статья 200. Информация
1. Информацией являются документированные или публично объявленные сведения о событиях и явлениях, которые имели или имеют место в обществе, государстве и окружающей среде.
2. Субъект отношений в сфере информации может требовать устранения нарушений его права и возмещения имущественного и морального вреда, причиненной такими правонарушениями.
3. Порядок использования информации и защиты права на нее устанавливается законом.

Статья 201. Личные неимущественные блага
1. Личными неимущественными благами, которые охраняются гражданским законодательством, являются: здоровье, жизнь; честь, достоинство и деловая репутация; имя (наименование); авторство; свобода литературного, художественного, научного и технического творчества, а также другие блага, которые предохраняются гражданским законодательством.
2. В соответствии с Конституцией Украины жизнь и здоровье человека, его честь и достоинство, неприкосновенность и безопасность признаются высочайшей социальной ценностью.
"""

GKU_g_16 = """ 
Глава 16 - Гражданского кодекса
Сделки

Параграф 1. Общие положения о сделках

Статья 202. Понятие и виды сделок
1. Сделками являются действия лица, направленные на обретение, изменение или прекращение гражданских прав и обязанностей.
2. Сделки могут быть односторонними и дво- ли многосторонними (договоры).
3. Односторонней сделкой является действие одной стороны, которое может быть представлено одним или несколькими лицами.
Односторонняя сделка может создавать обязанности лишь для лица, которое его совершило.
Односторонняя сделка может создавать обязанности для других лиц лишь в случаях, установленных законом, или по договоренности с этими лицами.
4. Двух или многосторонней сделкой является согласованное действие двух или более сторон.
5. К правовым действиям, которые возникли из односторонних сделок, применяются общие положения об обязательстве и о договорах, если это не противоречит актам гражданского законодательства или сути односторонней сделки.

Статья 203. Общие требования, соблюдение которых является необходимым для действительности сделки
1. Содержание сделки не может противоречить этому Кодексу, другим актам гражданского законодательства, а также интересам государства и общества, его моральным принципам
2. Лицо, совершающее сделку, должно иметь необходимый объем гражданской дееспособности.
3. Волеизъявление участника сделки должно быть свободным и отвечать его внутренней воле.
4. Сделка должна совершаться в форме, установленной законом.
5. Сделка должна быть направлена на реальное наступление правовых последствий, обусловленных ею.
6. Сделка, которая совершается родителями (усыновителями), не может противоречить правам и интересам их малолетних, несовершеннолетних или нетрудоспособных детей.

Статья 204. Презумпция правомерности сделки
1. Сделка является правомерной, если ее недействительность прямо не установлена законом или если она не признана судом недействительной.

Статья 205. Форма сделки. Способы волеизъявления
1. Сделка может совершаться устно или в письменной электронной форме. Стороны имеют право избирать форму сделки, если другое не установлено законом.
2. Сделка, для которой законом не установлена обязательная письменная форма, считается завершенной, если поведение сторон удостоверяет их волю к наступлению соответствующих правовых последствий.
3. В случаях, установленных договором или законом, воля стороны к совершению сделки может выражаться ее молчанием.

Статья 206. Сделки, которые могут совершаться устно
1. Устно могут совершаться сделки, которые полностью выполняются сторонами в момент их совершения, за исключением сделок, которые подлежат нотариальному удостоверению и (или) государственной регистрации, а также сделок, для которых несоблюдение письменной формы влечет за собой их недействительность.
2. Юридическому лицу, которое уплатило за товары и услуги на основании устной сделки со второй стороной, выдается документ, который подтверждает основание уплаты и сумму полученных денежных средств.
3. Сделки на выполнение договора, заключенного в письменной форме, могут по договоренности сторон совершаться устно, если это не противоречит договору или закону.

Статья 207. Требования к письменной форме сделки
1. Сделка считается совершенной в письменной форме, если ее содержание зафиксировано в одном или нескольких документах, в том числе электронных, в письмах, телеграммах, которыми обменялись стороны.
Сделка считается совершенной в письменной форме, если воля сторон выражена с помощью телетайпного, электронного или другого технического средства связи.
2. Сделка считается совершенной в письменной форме, если она подписана его стороной (сторонами).
Сделка, которую совершает юридическое лицо, подписывается лицами, уполномоченными на это ее учредительными документами, доверенностью, законом или другими актами гражданского законодательства, и скрепляется печатью.
3. Использование при совершении сделок факсимильного воспроизведения подписи с помощью средств механического, электронного или иного копирования, электронной подписи либо иного аналога собственноручной подписи допускается в случаях, установленных законом, другими актами гражданского законодательства, или по письменному соглашению сторон, в котором должны содержаться образцы соответствующего аналога их собственноручных подписей.
4. Если физическое лицо в связи с болезнью или физическим недостатком не может подписаться собственноручно, по его поручению текст сделки в его присутствии подписывает другое лицо.
Подпись другого лица в тексте сделки, которая заверяется нотариально, заверяется нотариусом или должностным лицом, которое имеет право на совершение такого нотариального действия, с указанием причин, из которых текст сделки не может быть подписан лицом, которое его совершает.
Подпись другого лица на тексте сделки, относительно которого не требуется нотариального удостоверения, может быть удостоверена соответствующим должностным лицом по месту работы, обучение, проживание или лечение лица, которое его совершает.

Статья 208. Сделки, которые необходимо совершать в письменной форме
1. В письменной форме должны совершаться:
сделки между юридическими лицами;
сделки между физическим и юридическим лицом, кроме сделок, предусмотренных частью первой статьи 206 Гражданского кодекса Украины;
сделки физических лиц между собою на сумму, которая превышает в двадцать и больше раз размер не облагаемого налогами минимума доходов граждан, кроме сделок, предусмотренных частью первой статьи 206 Гражданского кодекса Украины;
другие сделки, относительно которых законом установленная письменная форма.

Статья 209. Нотариальное удостоверение сделок
1. Сделка, совершенная в письменной форме, подлежит нотариальному удостоверению только в случаях, установленных законом или договоренностью сторон.
2. Нотариальное удостоверение сделки осуществляется нотариусом или другим должностным лицом, которое соответственно закону имеет право на совершение такого нотариального действия, путем совершения на документе, в котором изложен текст сделки, удостоверительной надписи.
3. Нотариальное удостоверение может быть в тексте лишь такой сделки, которая отвечает общим требованиям, установленным статьей 203 Гражданского кодекса Украины.
4. По требованию физического или юридического лица любая сделка с ее участием может быть нотариально удостоверена.

Статья 210. Государственная регистрация сделки
1. Сделка подлежит государственной регистрации лишь в случаях, установленных законом. Такая сделка является совершенной с момента его государственной регистрации.
2. Перечень органов, которые осуществляют государственную регистрацию, порядок регистрации, а также порядок ведения соответствующих реестров устанавливаются законом.

Статья 211. Место совершения сделки
1. Если в тексте сделки не указано место его совершения, то:
местом совершения односторонней сделки является место выражения воли сторон;
место совершения двух- или многосторонней сделки устанавливается соответственно статье 647 Гражданского кодекса Украины.

Статья 212. Сделки, относительно которых правовые последствия связываются с наступлением определенного обстоятельства
1. Лица, которые совершают сделку, имеют право обусловить наступление или изменение прав и обязанностей обстоятельством, относительно которого неизвестно, настанет оно или нет (отложное обстоятельство).
2. Лица, которые совершают сделку, имеют право обусловить прекращение прав и обязанностей обстоятельством, относительно которого неизвестно, настанет оно или нет (отменительное обстоятельство).
3. Если наступлению обстоятельства недобросовестно препятствовала сторона, которой это невыгодно, обстоятельство считается таковым, что наступило.
4. Если наступлению обстоятельства недобросовестно оказывала содействие сторона, которой это выгодно, обстоятельство считается таковым, что не наступило.

Статья 213. Толкование содержания сделки
1. Содержание сделки может быть истолковано стороной (сторонами).
2. По требованию одной или обеих сторон суд может постановить решение о толковании содержания сделки.
3. При толковании содержания сделки берутся во внимание одинаковое для всего содержания сделки значение слов и понятий, а также общепринятое в соответствующей сфере отношений значение сроков.
Если буквальный смысл слов и понятий, а также общепринятое в соответствующей сфере отношений значение сроков не дает возможности выяснить содержание отдельных частей сделки, их содержание устанавливается сравнением соответствующей части сделки с содержанием других ее частей, всем ее содержанием, намерениями сторон.
4. Если по правилам, установленным частью третьей этой статьи, нет возможности определить настоящую волю лица, которое совершило сделку, во внимание берутся цель сделки, содержание предшествующих переговоров, упроченная практика отношений между сторонами, обычаи делового оборота, дальнейшее поведение сторон, текст типичного договора и прочие обстоятельства, которые имеют важное значение.

Статья 214. Отказ от правового действия
1. Лицо, которое совершило одностороннюю сделку, имеет право отказаться от нее, если другое не установлен законом. Если таким отказом от сделки затронуты права другого лица, эти права подлежат защите.
2. Лица, которые совершили дву- или многостороннюю сделку, имеют право по взаимному согласию сторон, а также в случаях, предусмотренных законом, отказаться от нее, даже и в том случае, если ее условия полностью ими выполнены.
3. Отказ от сделки совершается в такой же самой форме, в которой была совершена сделка.
4. Правовые последствия отказа от сделки устанавливаются законом или договоренностью сторон.
Параграф 2. Правовые последствия несоблюдения сторонами при совершении сделки требований закона

Статья 215. Недействительность сделки
1. Основанием недействительности сделки является несоблюдение в момент совершения сделки стороной (сторонами) требований, установленных частями первой - третьей, пятой и шестой статьей 203 Гражданского кодекса Украины.
2. Недействительным является сделка, если ее недействительность установлена законом (ничтожная сделка). В этом случае признания такой сделки недействительной судом не требуется.
В случаях, установленных Гражданским кодексом Украины, ничтожная сделка может быть признана судом соответствующей действительности.
3. Если недействительность сделки прямо не установлена законом, но одна из сторон или другое заинтересованное лицо опротестовывает ее действительность на основаниях, установленных законом, такая сделка может быть признана судом недействительной (оспаримая сделка).

Статья 216. Правовые последствия недействительности сделки
1. Недействительная сделка не создает юридических последствий, кроме тех, что связаны с ее недействительностью.
В случае недействительности сделки любая из сторон обязаная возвратить второй стороне в натуре все, что она получила на выполнение этой сделки, а в случае невозможности такого возвращения, в частности тогда, если полученное состоит в пользовании имуществом, выполненной работе, предоставленной услуге, - возместить стоимость того, что получено, по ценам, которые существуют на момент возмещения.
2. Если в связи с совершением недействительной сделки второй стороне или третьему лицу причинен убыток и моральный ущерб, они подлежат возмещению виновной стороной.
3. Правовые последствия, предусмотренные частями первой и второй этой статьи, применяются, если законом не установлены особые условия их применения или особые правовые последствия отдельных видов недействительных сделок.
4. Правовые последствия недействительности ничтожной сделки, которые установлены законом, не могут изменяться по договоренности сторон.
5. Требование о применении последствий недействительности ничтожной сделки может быть предъявлено любым заинтересованным лицом.
Суд может применить последствия недействительности ничтожной сделки по собственной инициативе.

Статья 217. Правовые последствия недействительности отдельных частей сделки
1. Недействительность отдельной части сделки не ведет к недействительности других ее частей и сделки в целом, если можно предположить, что сделка была бы совершена и без включения в нее недействительной части.

Статья 218. Правовые последствия несоблюдения требования относительно письменной формы сделки
1. Несоблюдение сторонами письменной формы сделки, которая установлена законом, не влечет к ее недействительности, кроме случаев, установленных законом.
Возражение одной из сторон против факта совершения сделки или оспаривание отдельных ее частей может подтверждаться письменными доказательствами, средствами аудио-, видеозаписи и другими доказательствами. Решение суда не может основываться на показаниях свидетелей.
2. Если сделка, для которой законом установлена его недействительность в случае несоблюдения требования относительно письменной формы, заключена устно и одна из сторон совершила действие, а вторая сторона подтвердила ее совершение, в частности путем принятия выполнения, такая сделка в случае спора может быть признана судом соответствующей действительности.

Статья 219. Правовые последствия несоблюдения требования закона о нотариальном удостоверении односторонней сделки
1. В случае несоблюдения требования закона о нотариальном удостоверении односторонней сделки такая сделка является ничтожной.
2. Суд может признать такую сделку соответствующей действительности, если будет установлено, что она отвечала настоящей воле лица, которое ее совершило, а нотариальному удостоверению сделки препятствовало обстоятельство, которое не зависело от его воли.

Статья 220. Правовые последствия несоблюдения требования закона о нотариальном удостоверении договора
1. В случае несоблюдения сторонами требования закона о нотариальном удостоверении договора такой договор является ничтожным.
2. Если стороны договорились относительно всех важных условий договора, который подтверждается письменными доказательствами, и состоялось полное или частичное выполнения договора, но одна из сторон уклонилась от его нотариального удостоверения, суд может признать такой договор соответствующим действительности. В этом случае последующее нотариальное удостоверение договора не требуется.

Статья 221. Правовые последствия совершения сделки малолетним лицом за пределами его гражданской дееспособности
1. Сделка, совершенная малолетним лицом за пределами его гражданской дееспособности, может быть со временем одобрена его родителями (усыновителями) или одним из них, с кем он проживает, или опекуном.
Сделка считается одобренной, если эти лица, узнав о его совершении, на протяжении одного месяца не заявили претензии второй стороне.
2. В случае отсутствия одобрения сделки она является ничтожной.
По требованию заинтересованного лица суд может признать такую сделку соответствующей действительности, если будет установлено, что она совершена в пользу малолетнего лица.
3. Если сделку с малолетним лицом совершило физическое лицо с полной гражданской дееспособностью, то оно обязано возвратить лицам, указанным в части первой этой статьи, все то, что оно получило по такой сделке от малолетнего лица.
4. Дееспособная сторона обязана также возместить убытки, причиненные заключением недействительной сделки, если в момент совершения сделки она знала или могла знать о возрасте второй стороны. Родители (усыновители) или опекун малолетнего лица обязаны возвратить дееспособной стороне все полученное ею по этой сделке в натуре, а при невозможности возвратить полученное в натуре - возместить его стоимость по ценам, которые существуют на момент возмещения.
5. Если обоими сторонами сделки являются малолетние лица, то любая из них обязана возвратить второй стороне все, что получила по этой сделке, в натуре. В случае невозможности возвращение имущества возмещение его стоимости ведется родителями (усыновителями) или опекуном, если будет установлено, что совершению сделки или потере имущества, которое было предметом сделки, оказывало содействие их виновное поведение.
6. В случае совершения несовершеннолетним лицом сделки с малолетним лицом наступают следствия, установленные частью третьей статьи 222 Гражданского кодекса Украины.

Статья 222. Правовые последствия совершения сделки несовершеннолетним лицом за пределами его гражданской дееспособности
1. Сделка, совершенная несовершеннолетним лицом за пределами его гражданской дееспособности без согласия родителей (усыновителей), опекуна, может быть со временем одобренный ими в порядке, установленном статьей 221 Гражданского кодекса Украины.
2. Сделка, совершенная несовершеннолетним лицом за пределами его гражданской дееспособности без согласия родителей (усыновителей), опекунов, может быть признана судом недействительной по иску заинтересованного лица.
3. Если обеими сторонами недействительной сделки являются несовершеннолетние лица, то любая из них обязана возвратить второй стороне все полученное ею по этой сделке в натуре. В случае невозможности возвращение полученного в натуре возмещается его стоимость по ценам, которые существуют на момент возмещения.
Если у несовершеннолетнего лица отсутствуют средства, достаточные для возмещения, родители (усыновители) или опекун обязаны возместить причиненные убытки, если они своим виновным поведением оказывали содействие совершению сделки или потере имущества, которое было предметом сделки.

Статья 223. Правовые следствия совершения сделки физическим лицом, гражданская дееспособность которого ограничена, за пределами его гражданской дееспособности
1. Сделка, совершенная физическим лицом, гражданская дееспособность которого ограничена, за пределами его гражданской дееспособности без согласия опекуна, может быть со временем одобрена им в порядке, установленном статьей 221 Гражданского кодекса Украины.
2. В случае отсутствия такого одобрения сделка по иску опекуна может быть признана судом недействительной, если будет установлено, что она противоречит интересам самого подопечного, членов его семьи или лиц, которых он соответственно закону обязан содержать.

Статья 224. Правовые последствия совершения правового действия без разрешения органа опеки и попечительства
1. Правовое действие, совершенное без разрешения органа опеки и попечительства (статья 71 Гражданского кодекса Украины), является никчемной.
2. По требованию заинтересованного лица такая сделка может быть признана судом соответствующей действительности, если будет установлено, что она отвечает интересам физического лица, над которым установлена опека и попечительство.

Статья 225. Правовые последствия совершения сделки дееспособным физическим лицом, которое в момент его совершения не осознавало значения своих действий и (или) не могло руководить ими
1. Cделка, которую дееспособное физическое лицо совершило в момент, когда оно не осознавало значения своих действий и (или) не могло руководить ими, может быть признана судом недействительной по иску этого лица, а в случае его смерти – по иску других лиц, чьи гражданские права или интересы были затронуты.
2. В случае последующего признания физического лица, которое совершило сделку, недееспособным иск о признании сделки недействительной может предъявить его опекун.
3. Сторона, которая знала о состоянии физического лица на момент совершения сделки, обязана возместить ей моральный вред, причиненный в связи с совершением такой сделки.

Статья 226. Правовые последствия совершения сделки недееспособным физическим лицом
1. Опекун может одобрить мелкую бытовую сделку, совершенную недееспособным физическим лицом, в порядке, установленом статьей 221 Гражданского кодекса Украины.
В случае отсутствия такого одобрения эта сделка и прочие сделки, совершенные недееспособным физическим лицом, являются ничтожными.
2. По требованию опекуна сделка, совершенная недееспособным физическим лицом, может быть признана судом соответствующей действительности, если будет установлено, что она совершена в пользу недееспособного физического лица.
3. Дееспособная сторона обязана возвратить опекуну недееспособного физического лица все полученное ею по этой сделке, а в случае невозможности такого возвращения - возместить стоимость имущества по ценам, которые существуют на момент возмещения.
Опекун обязан возвратить дееспособной стороне все полученное недееспособным физическим лицом по ничтожной сделке. Если имущество не сохранилось, опекун обязан возместить его стоимость, если совершению сделки или потере имущества, которое было предметом сделки, оказывало содействие виновное поведение опекуна.
4. Дееспособная сторона обязана возместить опекуну недееспособного физического лица или членам его семьи моральный вред, если будет установлено, что она знала о психическом разладе или слабоумии второй стороны или могла предположить такое ее состояние.

Статья 227. Правовые последствия заключения юридическим лицом правового действия, которого оно не имела права совершать.
1. Сделка юридического лица, совершенная им без соответствующего разрешения (лицензии), может быть признана судом недействительным.
2. Если юридическое лицо ввело другу сторону в обман относительно своего права на совершение такой сделки, она обязана возместить ей моральный вред, причиненный такой сделкой.

Статья 228. Правовые последствия совершения сделки, которая нарушает публичный порядок, совершенной с целью, противоречащей интересам государства и общества
1. Сделка считается нарушающей общественный порядок, если она был направлена на нарушение конституционных прав и свобод человека и гражданина, уничтожение, повреждение имущества физического или юридического лица, государства, Автономной Республики Крым, территориальной общины, незаконное овладение им.
2. Сделка, нарушающая общественный порядок, является никчемной.
3. В случае несоблюдения требования о соответствии сделки интересам государства и общества, его нравственным принципам такая сделка может быть признана недействительной. Если признанная судом недействительная сделка была совершена с целью, заведомо противоречащей интересам государства и общества, то при наличии умысла у обеих сторон - в случае исполнения сделки обеими сторонами - в доход государства по решению суда взимается все полученное ими по сделке, а в случае выполнения сделки одной стороной с другой стороны по решению суда взыскивается в доход государства все полученное ею и все причитающееся - с нее первой стороне на возмещение полученного. При наличии умысла лишь у одной из сторон все полученное ею по сделке должно быть возвращено другой стороне, а полученное последней или принадлежащее ей на возмещение выполненного по решению суда взыскивается в доход государства

Статья 229. Правовые последствия сделки, совершенной под влиянием ошибки
1. Если лицо, совершившее сделку, ошиблось относительно обстоятельств, которые имеют важное значение, такая сделка может быть признана судом недействительной.
Важное значение имеет ошибка относительно природы сделки, прав и обязанностей сторон, таких свойств и качеств вещи, которые значительно снижают ее ценность или возможность использования по целевому назначению. Ошибка относительно мотивов сделки не имеет важного значения, кроме случаев, установленных законом.
2. В случае признания сделки недействительной лицо, которое ошиблось в результате своей собственной нерадивости, обязано возместить второй стороне причиненные ей убытки.
Сторона, которая своим неосторожным поведением оказывала содействие ошибке, обязана возместить второй стороне причиненные ей убытки.

Статья 230. Правовые последствия совершения сделки под влиянием обмана
1. Если одна из сторон сделки нарочно ввела другую сторону в заблуждение относительно обстоятельств, которые имеют важное значение (часть первая статьи 229 Гражданского кодекса Украины), такая сделка признается судом недействительной.
Обман имеет место, если сторона возражает наличие обстоятельств, которые могут воспрепятствовать совершению сделки, или если она замалчивает их существование.
2. Сторона, которая применила обман, обязанная возместить второй стороне убытки в двойном размере и моральный вред, которые причинены в связи с совершением этой сделки.

Статья 231. Правовые последствия сделки, совершенной под влиянием насилия
1. Сделка, совершенная лицом против его настоящей воли вследствие применения к нему физического или психического давления со стороны второй стороны или со стороны другого лица, признается судом недействительной.
2. Виновная сторона (другое лицо), которое применило физическое или психическое давление ко второй стороне, обязана возместить ей убытки в двойном размере и моральный вред, причиненный в связи с совершением этой сделки.

Статья 232. Правовые последствия сделки, совершенной в результате злонамеренной договоренности представителя одной стороны со второй стороной
1. Сделка, совершенная вследствие злонамеренной договоренности представителя одной стороны со второй стороной, признается судом недействительной.
2. Доверитель имеет право требовать от своего представителя и второй стороны солидарного возмещения убытков и морального вреда, которые причиненные ему в связи с совершением сделки вследствие злонамеренной договоренности между ними.

Статья 233. Правовые последствия сделки, совершенной под влиянием тяжелого обстоятельства
1. Сделка, совершенная лицом под влиянием тяжелого для нее обстоятельства и на крайне невыгодных условиях, может быть признана судом недействительной независимо от того, кто был инициатором такой сделки.
2. При признании такой сделки недействительной применяются последствия, установленные статьей 216 Гражданского кодекса Украины. Сторона, которая воспользовалась тяжелым обстоятельством, обязана возместить второй стороне убытки и моральный вред, причиненные ей в связи с совершением этой сделки.

Статья 234. Правовые последствия фиктивной сделки
1. Фиктивной является сделка, совершенная без намерения создания правовых последствий, которые обуславливались этой сделкой.
2. Фиктивная сделка признается судом недействительной.
3. Правовые последствия признания фиктивной сделки недействительной устанавливаются законами

Статья 235. Правовые следствия притворной сделки
1.Притворной является сделка, совершенная сторонами для сокрытия другой сделки, которую на самом деле совершили.
2. Если будет установлено, что сделка была совершена сторонами для сокрытия другой сделки, которую они на самом деле совершили, отношения сторон регулируются правилами относительно сделок, которые стороны на самом деле совершили.

Статья 236. Момент недействительности сделки
1. Ничтожная сделка или сделка, признанная судом недействительной, является недействительной с момента ее совершения.
2. Если по недействительной сделке права и обязанности предполагались лишь на будущее, возможность наступления их в будущем прекращается.
"""

GKU_g_17 = """ 
Глава 17 - Гражданского кодекса
Представительство

Статья 237. Понятие и основания представительства
1. Представительство - это правоотношение, в котором одна сторона (представитель) обязана или имеет право совершить сделку от лица второй стороны, которую она представляет.
2. Не является представителем лицо, которое хотя и действует в чужих интересах, но от собственного имени, а также лицо, уполномоченное на ведение переговоров относительно возможных в будущем сделок.
3. Представительство возникает на основании договора, закона, акта органа юридического лица и из других оснований, установленных актами гражданского законодательства.

Статья 238. Сделки, которые может совершать представитель
1. Представитель может быть уполномочен на совершение лишь тех сделок, право на совершение которых имеет лицо, которое он представляет.
2. Представитель не может совершать сделку, которая соответственно ее содержанию может быть содеяна лишь лично тем лицом, которое он представляет.
3. Представитель не может совершать сделку от имени лица, которое он представляет, в своих интересах или в интересах другого лица, представителем которого он одновременно является, за исключением коммерческого представительства, а также относительно других лиц, установленных законом.

Статья 239. Правовые последствия совершения сделки представителем
1. Сделка, совершенная представителем, создает, изменяет, прекращает гражданские права и обязанности лица, которое он представляет.

Статья 240. Передоверие
1. Представитель обязан совершать сделки по предоставленным ему полномочиям лично. Он может передать свое полномочие частично или в полном объеме другому лицу, если это установлено договором или законом между лицом, которое представляют, и представителем, или если представитель был вынужден к тому с целью охраны интересов лица, которое он представляет.
2. Представитель, который передал свое полномочие другому лицу, должен сообщить об этом лицу, которое он представляет, и предоставить ему необходимые сведения о лице, которому переданы соответствующие полномочия (заместителю). Невыполнение этой обязанности возлагает на лицо, передавшее полномочия, ответственность за действия заместителя как за свои собственные.
3. Сделка, совершенная заместителем, создает, изменяет, прекращает гражданские права и обязанности лица, которое он представляет.

Статья 241. Совершение сделок с превышением полномочий
1. Сделка, совершенная представителем с превышением полномочий, создает, изменяет, прекращает гражданские права и обязанности лица, которое он представляет, лишь в случае следующего одобрения сделки этим лицом. Сделка считается одобренной в частности в случае, если лицо, которое он представляет, совершило действия, которые свидетельствуют о принятии его к выполнению.
2. Следующее одобрение сделки лицом, которое представляют, создает, изменяет и прекращает гражданские права и обязанности из момента совершения этой сделки.

Статья 242. Представительство по закону
1. Родители (усыновители) являются законными представителями своих малолетних и несовершеннолетних детей.
2. Опекун является законным представителем малолетнего лица и физического лица, признанного недееспособным.
3. Законным представителем в случаях, установленных законом, может быть другое лицо.

Статья 243. Коммерческое представительство
1. Коммерческим представителем является лицо, которое постоянно и самостоятельно выступает представителем предпринимателей при заключении ими договоров в сфере предпринимательской деятельности.
2. Коммерческое представительство одновременно нескольких сторон сделки допускается по согласию этих сторон и в других случаях, установленных законом.
3. Полномочия коммерческого представителя могут быть подтверждены письменным договором между ним и лицом, которое он представляет, или доверенностью.
4. Особенности коммерческого представительства в отдельных сферах предпринимательской деятельности устанавливаются законом.

Статья 244. Представительство по доверенности
1. Представительство, которое основывается на договоре, может осуществляться по доверенности.
2. Представительство по доверенности может основываться на акте органа юридического лица.
3. Доверенностью является письменный документ, который выдается одним лицом другому лицу для представительства перед третьими лицами. Доверенность на совершение сделки представителем может быть предоставлена лицом, которое представляют (доверителем), непосредственно третьему лицу.

Статья 245. Форма доверенности
1. Форма доверенности должна отвечать форме, в которой соответственно закону может совершаться сделка.
2. Доверенность, которая выдается в порядке передоверия, подлежит нотариальному удостоверению, кроме случаев, установленных частью четвертой этой статьи.
3. Доверенность военнослужащего или другого лица, находится на лечении в госпитале, санатории и другом военно-лечебном учреждении, может быть удостоверена начальником этого учреждения, его заместителем по медицинской части, старшим или дежурным врачом.
Доверенность военнослужащего, а в пунктах дислокации воинской части, соединения, учреждения, военно-учебного учреждения, где нет нотариуса или органа, совершающего нотариальные действия, также доверенность работника, члена его семьи и члена семьи военнослужащего может быть удостоверена командиром (начальником) этой части, соединения, учреждения или заведения. 
Доверенность лица, держится в учреждении исполнения наказаний или следственном изоляторе, может быть удостоверена начальником учреждения исполнения наказаний или следственного изолятора.
Доверенность лица, проживающего в населенном пункте, где нет нотариусов, может быть удостоверена уполномоченным на это должностным лицом органа местного самоуправления, кроме доверенностей на право распоряжение недвижимым имуществом, доверенностей на управление и распоряжение корпоративными правами и доверенностей на пользование и распоряжение транспортными средствами.
Доверенность субъекта права на бесплатную вторичную правовую помощь, по обращению которого принято решение о предоставлении такой помощи, может быть удостоверена должностным лицом органа (учреждения), уполномоченного законом на предоставление бесплатной правовой помощи.
Доверенности, удостоверенные указанными должностными лицами, приравниваются к нотариально удостоверенным
4. Доверенность на получение заработной платы, стипендии, пенсии, алиментов, других платежей и почтовой корреспонденции (почтовых переводов, посылок и т.п.) может быть удостоверена должностным лицом организации, в которой доверитель работает, учится, находится на стационарном лечении, или по месту его проживания.
5. Доверенность на право участия и голосования на общем собрании, выданная физическим лицом, удостоверяется в порядке, определенном законодательством.

Статья 246. Доверенность юридического лица
1. Доверенность от имени юридического лица выдается его органом или другим лицом, уполномоченным на это его учредительными документами, и скрепляется печатью этого юридического лица.

Статья 247. Срок доверенности
1. Срок доверенности устанавливается в доверенности. Если срок доверенности не установлена, она сохраняет действие до прекращения ее действия.
2. Срок доверенности, выданной в порядке передоверия, не может превышать срока основной доверенности, на основании которой она выдана.
3. Доверенность, в который не указана дата ее совершения, есть ничтожной.

Статья 248. Прекращение представительства по доверенности
1. Представительство по доверенности прекращается в случае:
окончания срока доверенности;
отмены доверенности лицом, которое ее выдало;
отказа представителя от совершения действий, определенных доверенностью;
прекращение юридического лица, которое выдало доверенность;
прекращение юридического лица, которым выдана доверенность;
смерти лица, выдавшего доверенность, объявление его умершим, признание его недееспособным или безвестно отсутствующим, ограничение его гражданской дееспособности. В случае смерти лица, которое выдало доверенность, представитель сохраняет свои полномочия по доверенности для ведения неотложных дел или таких действий, невыполнение которых может привести к возникновению убытков;
смерти лица, которому выдана доверенность, объявление его умершим, признание его недееспособным или безвестно отсутствующим, ограничение его гражданской дееспособности.
2. С прекращением представительства по доверенности теряет действие передоверие.
3. В случае прекращения представительства по доверенности представитель обязан немедленно возвратить доверенность.

Статья 249. Отмена доверенности
1. Лицо, которое выдало доверенность, может в любое время отменить доверенность или передоверие. Отказ от этого права является ничтожным.
2. Лицо, которое выдало доверенность и со временем отменило ее, должно немедленно сообщить об этом представителю, а также известным ему третьим лицам, для представительства перед которыми была выдана доверенность.
3. Права и обязанности относительно третьих лиц, которые возникли вследствие совершения сделки представителем к тому, как он узнал или мог осведомиться об отмене доверенности, сохраняют действие для лица, которое выдало доверенность, и его правопреемников. Это правило не применяется, если третье лицо знало или могло знать, что действие доверенности прекратилось.
4. Законом может быть установлено право лица выдавать безотзывные доверенности на определенное время.

Статья 250. Отказ представителя от совершения действий, которые были определены доверенностью
1. Представитель имеет право отказаться от совершения действий, которые были определены доверенностью.
2. Представитель обязан немедленно сообщить лицу, которое он представляет, об отказе от совершения действий, которые были определены доверенностью.
3. Представитель не может отказаться от совершения действий, которые были определены доверенностью, если эти действия были неотложными или направленными на предотвращение нанесения убытков лицу, которое он представляет, или другим лицам.
4. Представитель отвечает перед лицом, которое выдало доверенность, за причиненные ему убытки в случае несоблюдения им требований, установленных частями второй и третьей этой статьи.
"""

GKU_g_18 = """ 
Глава 18 - Гражданского кодекса
Определение и исчисление сроков

Статья 251. Понятие срока и даты
1. Сроком является определенный период во времени, с истечением которого связано действие или событие, которое имеет юридическое значение.
2. Датой является определенный момент во времени, с наступлением которого связано действие или событие, которое имеет юридическое значение.
3. Срок и дата могут быть определены актами гражданского законодательства, сделкой решением суда.

Статья 252. Определение срока и даты
1. Срок определяется годами, месяцами, неделями, днями или часами.
2. Срок определяется календарной датой или указанием на событие, которое должно неминуемо наступить.

Статья 253. Начало истечение срока
1. Истечение срока начинается со следующего дня после соответствующей календарной даты или наступления события, с которым связано его начало.

Статья 254. Окончание срока
1. Срок, определеный годами, истекает в соответствующие месяц и число последнего года срока.
2. К сроку, определеному полугодием или кварталом года, применяются правила о сроках, которые определены месяцами. При этом отсчет кварталов ведется с начала года.
3. Срок, определеный месяцами, истекает в соответствующее число последнего месяца срока.
Срок, определенный в полумесяца, равняется пятнадцати дням. Если окончание срока, определенного месяцем, приходится на такой месяц, в котором нет соответствующего числа, срок истекает в последний день этого месяца.
4. Срок, определеный неделями, уплывает в соответствующий день последней недели срока.
5. Если последний день срока приходится на исходный, праздничный или другой нерабочий день, который определен соответственно закону в месте совершения определенного действия, днем окончания срока есть первый за ним рабочий день.

Статья 255. Порядок совершения действий в последний день срока
1. Если срок установлен для совершения действия, оно может быть совершено до окончания последнего дня срока. В случае, если это действие должно быть совершено в учреждении, то срок истекает тогда, когда в этом учреждении по установленным правилам прекращаются соответствующие операции.
2. Письменные заявления и сообщения, сданные в учреждение связи до окончания последнего дня срока, считаются, сданными своевременно.
"""

GKU_g_19 = """ 
Глава 19 - Гражданского кодекса
Исковая давность

Статья 256. Понятие исковой давности
1. Исковая давность - это срок, в границах которого лицо может обратиться в суд с требованием о защите своего гражданского права или интереса.

Статья 257. Общая исковая давность
1. Общая исковая давность устанавливается продолжительностью в три года.

Статья 258. Специальная исковая давность
1. Для отдельных видов требований законом может устанавливаться специальная исковая давность: сокращенная или более продолжительная сравнительно с общей исковой давностью.
2. Исковая давность в один год применяется, в частности, к требованиям:
о взыскании неустойки (штрафа, пени);
об опровержении недостоверной информации, помещенной в средствах массовой информации.
В этом случае исковая давность вычисляется от дня размещения этих сведений в средствах массовой информации или со дня, когда лицо узнало ли могло узнать об этих сведениях;
о переводе на совладельца прав и обязанностей покупателя в случае нарушения преимущественного права покупки частицы в праве общей долевой собственности (статья 362 настоящего Кодекса);
в связи с недостатками проданного товара (статья 681 Гражданского кодекса Украины);
о разрыве договора дарения (статья 728 Гражданского кодекса Украины);
в связи с перевозкой груза, почты (статья 925 Гражданского кодекса Украины);
об обжаловании действий исполнителя завещания (статья 1293 Гражданского кодекса Украины).
о признании недействительным решения общего собрания общества.
3. (Часть третья статьи 258 исключена на основании Закона N 4176-VI от 20.12.2011)
4. (Часть четвертая статьи 258 исключена на основании Закона N 4176-VI от 20.12.2011)
5. Исковая давность в четыре года применяется по требованиям о признании необоснованными активов и их взыскания в доход государства.

Статья 259. Изменение продолжительности исковой давности
1. Исковая давность, установленная законом, может быть увеличена по договоренности сторон.
Договор об увеличении исковой давности укладывается в письменной форме.
2. Исковая давность, установленная законом, не может быть сокращена по договоренности сторон.

Статья 260. Вычисление исковой давности
1. Исковая давность исчисляется по общим правилам определения сроков, установленных статьями 253-255 Гражданского кодекса Украины.
2. Порядок вычисления исковой давности не может быть изменен по договоренности сторон.

Статья 261. Начало течения исковой давности
1. Течение исковой давности начинается со дня, когда лицо узнало или могло узнать о нарушении своего права или о лице, которое его нарушило.
2. Течение исковой давности по требованиям о признании недействительной сделки, совершенной под влиянием насилия, начинается со дня прекращения насилия.
3. Течение исковой давности по требованиям о применении следствий ничтожной сделки начинается со дня, когда началось ее выполнение.
4. В случае нарушения гражданского права или интереса несовершеннолетнего лица исковая давность начинается со дня достижения им совершеннолетия.
5. По обязательствам с определенным сроком выполнения течение исковой давности начинается с истечение срока выполнения.
По обязательствам, срок выполнения которых не определен или определен моментом требования, истечение исковой давности начинается со дня, когда у кредитора возникает право предъявить требование о выполнении обязательства. Если должнику предоставляется льготный срок для выполнения такого требования, течение исковой давности начинается с истечением этого срока.
6. По регрессным обязательствам истечение исковой давности начинается со дня выполнения основного обязательства.
7. Течение исковой давности по требованиям о признании необоснованными активов и их взыскания в доход государства начинается со дня вступления в оспариваемых активов ответчиком.
8. Исключения из правил, установленные частями первой и второй этой статьи, могут быть установлены законом.

Статья 262. Исковая давность в случае замены сторон в обязательстве
1. Замена сторон в обязательстве не изменяет порядка исчисления и хода исковой давности.

Статья 263. Приостановление течения исковой давности
1. Течение исковой давности останавливается:
если предъявлению иска препятствовало чрезвычайное или неотвратимое при данных условиях события (непреодолимая сила);
в случае отсрочки выполнения обязательств (мораторий) на основаниях, установленных законом;
в случае остановки действия закона или другого нормативно-правового акта, который регулирует соответствующие отношения;
если истец или ответчик находится в составе Вооруженных Сил Украины или в других созданных соответственно закону воинских формированиях, которые переведены на военное состояние.
2. В случае возникновения обстоятельств, установленных частью первой этой статьи, течение исковой давности останавливается на все время существования этих обстоятельств.
3. Со дня прекращения обстоятельств, которые были основанием для остановки течения исковой давности, течение исковой давности продолжается с учетом времени, которое прошло до его остановки.

Статья 264. Прерывание течения исковой давности
1. Течение исковой давности перерывается совершением лицом действия, которое свидетельствует о признании им своего долга или другой обязанности.
2. Исковая давность перерывается в случае предъявления лицом иска против одного из нескольких должников, а также если предметом иска является лишь часть требования, право на которое имеет истец.
3. После прерыва течение исковой давности начинается снова.
Время, которое прошло до прерывания течения исковой давности, к новому сроку не зачисляется.

Статья 265. Истечение исковой давности в случае оставления иска без рассмотрения
1. Оставление иска без рассмотрения не останавливает течения исковой давности.
2. Если суд оставил без рассмотрения иск, предъявленный в криминальном процессе, время от дня предъявления иска против вступления в законную силу решения суда, которым иск был оставлен без рассмотрения, не зачисляется к исковой давности.
Если часть срока, что осталась, есть меньшей чем шесть месяцев, она удлиняется до шести месяцев.

Статья 266. Применение исковой давности к дополнительным требованиям
1. С истечением исковой давности основного требования считается, что исковая давность истекла и по дополнительному требованию (взыскание неустойки, наложение взыскания на заложенное имущество и т.п.).

Статья 267. Последствия истечения исковой давности
1. Лицо, которое выполнило обязательства после истечения исковой давности, не имеет права требовать возвращения выполненного, даже если оно в момент выполнения не знало об истечении исковой давности.
2. Заявление о защите гражданского права или интереса может быть принято судом к рассмотрению независимо от истечения исковой давности.
3. Исковая давность применяется судом лишь по заявлению стороны в споре, сделанному до вынесения им решения.
4. Истечение исковой давности, о применении которой заявлено стороной в споре, является основанием для отказа в иске.
5. Если суд признает уважительными причины пропуска срока исковой давности, затронутое право подлежит защите.

Статья 268. Требования, на которые исковая давность не распространяется
1. Исковая давность не распространяется:
на требование, которое вытекает из нарушения личных неимущественных прав, кроме случаев, установленных законом;
на требование вкладчика в банк (финансового учреждения) о выдаче вклада;
на требование о возмещении вреда, причиненного увечьем, другим повреждением здоровья или смертью;
на требование собственника или другого лица о признании незаконным правового акта органа государственной власти, органа власти Автономной Республики Крым или органа местного самоуправления, которым затронуто его право собственности или другое вещное право; (Пункт четыре статьи 268 исключен на основании Закона N 4176-VI от 20.12.2011)
на требование страхователя (застрахованного лица) к страхователю об осуществлении страховой выплаты (страхового возмещения);
по требованию центрального органа исполнительной власти, осуществляет управление государственным резервом, относительно выполнения обязательств, вытекающих из Закона Украины "О государственном материальном резерве".
по требованию о признании недействительной сделки, предметом которой является отчуждение общежития как объекта недвижимого имущества и/или его части, на которую распространяется действие Закона Украины "Об обеспечении реализации жилищных прав жителей общежитий", о признании недействительным свидетельства о праве собственности на такое общежитие как объект недвижимого имущества и/или его части, о признании недействительным акта передачи такого общежития как объекта недвижимого имущества и/или его части в уставный капитал (фонд) общества (организации), созданного в процессе приватизации (корпоратизации) бывших государственных (коммунальных) предприятий
2. Законом могут быть установленные также другие требования, на которые не распространяется исковая давность.
"""
GKU_g_20 = """ 
Книга вторая - Личные неимущественные права физического лица
Глава 20 - Гражданского кодекса
Общие положения про личные неимущественные права физического лица

Статья 269. Понятие личного неимущественного права
1. Личные неимущественные права принадлежат каждому физическому лицу от рождения или по закону.
2. Личные неимущественные права физического лица не имеют экономического содержания.
3. Личные неимущественные права тесно связаны с физическим лицом. Физическое лицо не может отказаться от личных неимущественных прав, а также не может быть лишено этих прав.
4. Личными неимущественными правами физическое лицо владеет пожизненно.

Статья 270. Виды личных неимущественных прав
1. Согласно Конституции Украины физическое лицо имеет право на жизнь, право на здравоохранение, право на безопасную для жизни и здоровья окружающую среду, право на свободу и личную неприкосновенность, право на неприкосновенность личной и семейной жизни, право на уважение достоинства и чести, право на тайну переписки, телефонных разговоров, телеграфной и другой корреспонденции, право на неприкосновенность жилья, право на свободный выбор местожительства и на свободу передвижения, право на свободу литературного, художественного, научного и технического творчества.
2. Гражданским кодексом Украины и другим законом могут быть предусмотрены и прочие личные неимущественные права физического лица.
3. Перечень личных неимущественных прав, установленных Конституцией Украины ( 254к/96-ВР ), этим Кодексом и другим законом, не является исчерпывающей.

Статья 271. Содержание личного неимущественного права
1. Содержание личного неимущественного права составляет возможность физического лица свободно, на собственное усмотрение определять свое поведение в сфере своей частной жизни.

Статья 272. Осуществление личных неимущественных прав
1. Физическое лицо осуществляет личные неимущественные права самостоятельно. В интересах малолетних, несовершеннолетних, а также совершеннолетних физических лиц, которые по возрасту или по состоянию здоровья не могут самостоятельно осуществлять свои личные неимущественные права, их права осуществляют родители (усыновители), опекуны, попечители.
2. Физическое лицо имеет право требовать от должностных и служебных лиц совершения соответствующих действий, направленных на обеспечение осуществления им личных неимущественных прав.

Статья 273. Обеспечение осуществления личных неимущественных прав
1. Органы государственной власти, органы власти Автономной Республики Крым, органы местного самоуправления в границах своих полномочий обеспечивают осуществление физическим лицом личных неимущественных прав.
2. Юридические лица, их работники, отдельные физические лица, профессиональные обязанности которых касаются личных неимущественных прав физического лица, обязаны воздерживаться от действий, которыми эти права могут быть затронуты.
3. Деятельность физических и юридических лиц не может нарушать личные неимущественные права.

Статья 274. Ограничение личных неимущественных прав
1. Ограничение личных неимущественных прав физического лица, установленных Конституцией Украины, возможно лишь в случаях, предусмотренных ею.
2. Ограничение личных неимущественных прав физического лица, установленных Гражданским кодексом Украины и другим законом, возможно лишь в случаях, предусмотренных ими.

Статья 275. Защита личного неимущественного права
1. Физическое лицо имеет право на защиту своего личного неимущественного права от противоправных посягательств других лиц. Защита личного неимущественного права осуществляется способами, установленными главой 3 Гражданского кодекса Украины.
2. Защита личного неимущественного права может осуществляться также другим способом соответственно содержанию этого права, способа его нарушения и следствий, которые повлекло это нарушение.

Статья 276. Возобновление затронутого личного неимущественного права
1. Орган государственной власти, орган власти Автономной Республики Крым, орган местного самоуправления, физическое лицо или юридическое лицо, решениями, действиями или бездеятельностью которых затронуто личное неимущественное право физического лица, обязаны совершить необходимые действия для его немедленного возобновления.
2. Если действия, необходимые для немедленного возобновления затронутого личного неимущественного права физического лица, не совершаются, суд может вынести решение относительно возобновления затронутого права, а также возмещение морального вреда, причиненного его нарушением.

Статья 277. Опровержение недостоверной информации
1. Физическое лицо, личные неимущественные права которого затронуты вследствие распространения о нем и (или) членах его семьи недостоверной информации, имеет право на возражение, а также на опровержение этой информации.
2. Право на возражение, а также на опровержение недостоверной информации относительно умершего лица, принадлежит членам его семьи, близким родственникам и другим заинтересованным лицам.
3. Опровержение недостоверной информации осуществляется лицом, которое распространило информацию.
Распространителем информации, которую подает должностное или служебное лицо при выполнении своих должностных (служебных) обязанностей, считается юридическое лицо, в котором оно работает.
Если лицо, распространившее недостоверную информацию, неизвестно, физическое лицо, право которого нарушено, может обратиться в суд с заявлением об установлении факта недостоверности этой информации и ее опровержение.
4. Если недостоверная информация помещается в документе, который принят (выдан) юридическим лицом, этот документ может быть отозван.
5. Физическое лицо, личного неимущественного права которой затронут в печатных или інших средствах массовой информации, имеет право на ответ, а также на опровержение недостоверной информации в том же средстве массовой информации в порядке, установленном законом.
Если ответ и опровержение в том же средстве массовой информации являются невозможными в связи с его прекращением, такой ответ и опровержение должны быть опубликованы в другом средстве массовой информации, за счет лица, распространившего недостоверную информацию.
Опровержение недостоверной информации осуществляется независимо от вины лица, которое ее распространило.
Физическое лицо, личные неимущественные права которого нарушены вследствие сообщения обличителем информации о возможных фактах коррупционных или связанных с коррупцией правонарушений, других нарушений Закона Украины "О предотвращении коррупции" через внешние каналы сообщения в порядке, предусмотренном Законом Украины "О предотвращении коррупции", имеет право на ответ.
6. Опровержение недостоверной информации осуществляется тем же способом, которым она была распространена.

Статья 278. Запрет распространения информации, которой нарушаются личные неимущественные права
1. Если личное неимущественное право физического лица поднятый в газете, книге, кинофильме, телепередаче и т.п., готовятся к выпуску в свет, суд может запретить распространение соответствующей информации.
2. Если личное неимущественное право физического лица нарушено в номере (выпуске) газеты, книге, кинофильме, телепередаче т.д., которые выпущены в свет, суд может запретить (прекратить) их распространение к устранению этого нарушения, а если устранение нарушения невозможно, - изъять тираж газеты, книги и т.п. с целью его уничтожения.

Статья 279. Правовые последствия невыполнения решения суда о защите личного неимущественного права
1. Если лицо, которому суд вменил в обязанность совершить соответствующие действия для устранения нарушения личного неимущественного права, уклоняется от выполнения судебного решения, на него может быть наложен штраф соответственно Гражданскому процессуальному кодексу Украины.
2. Уплата штрафа не освобождает лицо от обязанности выполнить решение суда.

Статья 280. Право физического лица, личное неимущественное право которого нарушено, на возмещение вреда
1. Если физическому лицу вследствие нарушения его личного неимущественного права причинен имущественный и (или) моральный вреда, этот вред подлежит возмещению, кроме случая непреднамеренного сообщение обличителем недостоверной информации о возможных фактах коррупционных или связанных с коррупцией правонарушений, других нарушений Закона Украины "О предотвращения коррупции "в порядке, предусмотренном указанным Законом, подлежащей опровержению.
"""

GKU_g_21 = """ 
Глава 21 - Гражданского кодекса
Личные неимущественные права, которые обеспечивают естественное существование физического лица

Статья 281. Право на жизнь
1. Физическое лицо имеет неотъемлемое право на жизнь.
2. Физическое лицо не может быть лишен жизни.
Физическое лицо имеет право защищать свою жизнь и здоровье, а также жизнь и здоровье другого физического лица от противоправных посягательств любыми средствами, не запрещенными законом.
3. Клинические испытания лекарственных средств проводятся в соответствии с законом
4. Запрещается удовлетворение просьбы физического лица о прекращении его жизни.
5. Стерилизация может произойти только по желанию совершеннолетнего физического лица.
Стерилизация недееспособного физического лица при наличии медицинских показаний может быть произведена только с согласия его опекуна, с соблюдением требований, установленных законом.
6. Искусственное прерывание беременности, если она не превышает двенадцати недель, может осуществляться по желанию женщины.
В случаях, установленных законодательством, искусственное прерывание беременности может быть проведено при беременности от двенадцати до двадцати двух недель.
Перечень обстоятельств, позволяющих прерывания беременности после двенадцати недель беременности, устанавливается законодательством.
7. Совершеннолетние женщина имеет право по медицинским показаниям на них лечебных программ вспомогательных оплодотворение порядком и условиями, установленными законодательством.

Статья 282. Право на устранение опасности, которая угрожает жизни и здоровью
1. Физическое лицо имеет право требовать устранения опасности, созданной вследствие предпринимательской или другой деятельности, которое угрожает жизни и здоровью.

Статья 283. Право на здравоохранение
1. Физическое лицо имеет право на охрану его здоровья.
2. Здравоохранение обеспечивается систематической деятельностью государственных и других организаций, предусмотренной Конституцией Украины и законом.

Статья 284. Право на медпомощь
1. Физическое лицо имеет право на предоставление ему медпомощи.
2. Физическое лицо, которое достигло четырнадцати лет и которое обратилось за предоставлением ему медпомощи, имеет право на выбор врача и выбор методов лечения соответственно его рекомендациям.
3. Предоставление медпомощи физическому лицу, которое достигло четырнадцати лет, ведется при его согласии.
4. Совершеннолетнее дееспособное физическое лицо, которое сознает значение своих действий и может руководить ими, имеет право отказаться от лечения.
5. В неотложных случаях, при наличии реальной угрозы жизни физического лица, медпомощь предоставляется без согласия физического лица или его родителей (усыновителей), опекуна, попечителя.
6. Предоставление физическому лицу психиатрической помощи осуществляется соответственно закону.

Статья 285. Право на информацию о состоянии своего здоровья
1. Совершеннолетнее физическое лицо имеет право на достоверную и полную информацию о состоянии своего здоровья, в том числе на ознакомление с соответствующими медицинскими документами, которые касаются его здоровья.
2. Родители (усыновители), опекун, попечитель имеют право на информацию о состоянии здоровья ребенка или подопечного.
3. Если информация о болезни физического лица может ухудшить состояние его здоровья или ухудшить состояние здоровья физических лиц, определенных частью второй этой статьи, повредить процессу лечения, медицинские работники имеют право дать неполную информацию о состоянии здоровья физического лица, ограничить возможность их ознакомления с отдельными медицинскими документами.
4. В случае смерти физического лица члены его семьи или другие физические лица, уполномоченные ими, имеют право присутствовать при исследовании причин его смерти и ознакомиться с выводами относительно причин смерти, а также имеют право на обжалование этих выводов в суде.

Статья 286. Право на тайну о состоянии здоровья
1. Физическое лицо имеет право на тайну о состоянии своего здоровья, факт обращения за медпомощью, диагноз, а также о сведениях, полученных при его медицинском обследовании.
2. Запрещается требовать и подавать по месту работы или обучению информацию о диагнозе и методах лечения физического лица.
3. Физическое лицо обязано воздержаться от распространения информации, указанной в части первой этой статьи, ставшей известной ему в связи с выполнением служебных обязанностей или из других источников.
4. Физическое лицо может быть обязано к прохождению медицинского обследования в случаях, установленных законодательством.

Статья 287. Права физического лица, которое находится на стационарном лечении в учреждении здравоохранения
1. Физическое лицо, которое находится на стационарном лечении в учреждении здравоохранения, имеет право на допуск к нему других медицинских работников, членов семьи, опекуна, попечителя, нотариуса и адвоката.
2. Физическое лицо, которое находится на стационарном лечении в учреждении здравоохранения, имеет право на допуск к нему священнослужителя для отправления богослужения и религиозного обряда.

Статья 288. Право на свободу
1. Физическое лицо имеет право на свободу.
2. Запрещаются любые формы физического или психического давления на физическое лицо, втягивание ее к употреблению спиртных напитков, наркотических и психотропных средств, совершение других действий, которые поднимают право на свободу.

Статья 289. Право на личную неприкосновенность
1. Физическое лицо имеет право на личную неприкосновенность.
2. Физическое лицо не может быть подвергнуто пыткам, жестокому, нечеловеческому или унижающему его достоинство, обращению или наказанию.
3. Физическое наказание родителями (усыновителями), опекунами, попечителями, воспитателями малолетних, несовершеннолетних детей и подопечных не допускается.
В случае жестокого, аморального поведения физического лица относительно другого лица, которое находится в беспомощном состоянии, применяются меры, установленные Гражданским кодексом Украины и другим законом.
4. Физическое лицо имеет право распорядиться относительно передачи после его смерти органов и других анатомических материалов его тела научным, медицинским или учебным заведениям.

Статья 290. Право на донорство
1. Совершеннолетнее дееспособное физическое лицо имеет право быть донором крови, ее компонентов, а также органов и других анатомических материалов и репродуктивных клеток. Лицо в возрасте до 18 лет может быть живым донором гемопоэтических стволовых клеток в соответствии с законом.
Донорство крови, ее компонентов, органов и других анатомических материалов, репродуктивных клеток осуществляется соответственно закону.
2. Взятие органов и других анатомических материалов из тела физического лица, которое умерло, не допускается, кроме случаев и в порядке, установленных законом.
3. Физическое лицо может дать письменное согласие на донорство ее органов и других анатомических материалов на случай своей смерти или запретить его.
Личность донора не должна быть известной реципиенту, а личность реципиента - семье донора, кроме случаев, когда реципиент и донор состоят в браке или являются близкими родственниками.

Статья 291. Право на семью
1. Физическое лицо независимо от возраста и состояния здоровья имеет право на семью.
2. Физическое лицо не может быть против его воли разведено с семьей, кроме случаев, установленных законом.
3. Физическое лицо имеет право на поддержание связей с членами своей семьи и родственниками независимо от того, где оно находится.
4. Никто не имеет права вмешиваться в семейную жизнь физического лица, кроме случаев, предусмотренных Конституцией Украины

Статья 292. Право на опеку или попечительство
1. Малолетнее, несовершеннолетнее лицо, а также физическое лицо, признанное недееспособным или ограниченное в гражданской дееспособности, имеет право на опеку или попечительство.

Статья 293. Право на безопасную для жизни и здоровья окружающую среду
1. Физическое лицо имеет право на безопасную для жизни и здоровья окружающую среду, право на достоверную информацию о состоянии окружающей среды, о качестве пищевых продуктов и предметов быта, а также право на ее сбор и распространение.
2. Деятельность физического и юридического лица, которое приводит к уничтожению, порчи, загрязнению окружающей среды, является незаконной. Каждый имеет право требовать прекращения такой деятельности.
Деятельность физического и юридического лица, которое наносит ущерб окружающей среде, может быть прекращена по решению суда.
3. Физическое лицо имеет право на безопасные для него продукты потребления (пищевые продукты и предметы быта).
4. Физическое лицо имеет право на надлежащие, безопасные и здоровые условия работы, проживание, обучение и т.п.
"""

GKU_g_22 = """ 
Глава 22 - Гражданского кодекса
Личные неимущественные права, которые обеспечивают социальное существование физического лица

Статья 294. Право на имя
1. Физическое лицо имеет право на имя.
2. Физическое лицо имеет право на транскрибированную запись его фамилии и имени соответственно своей национальной традиции.
3. В случае искажения имени физического лица оно должно быть исправлено. Если искажение имени было осуществлено в документе, такой документ подлежит замене. Если искажение имени осуществлено в средстве массовой информации, оно должно быть исправлено в том же средстве массовой информации.

Статья 295. Право на смену имени
1. Физическое лицо, которое достигло шестнадцати лет, имеет право на своему усмотрению изменить свою фамилию и (или) собственное имя.
2. Физическое лицо, которое достигло четырнадцати лет, имеет право изменить свою фамилию и (или) собственное имя по согласию родителей или одного из них в случае, если второй из родителей умер, признан безвестно отсутствующим, объявлен умершим, признан ограниченно дееспособным, недееспособным, лишен родительских прав относительно этого ребенка, а также если сведения об отце (матери) ребенка исключены из актовой записи о его рождении или если сведения о мужчины как отца ребенка внесены в актовую запись о ее рождении по заявлению матери.
В случае если над физическим лицом, которое достигло четырнадцати лет, установлена опека, изменение фамилии и (или) собственного имени такого лица осуществляется с согласия попечителя.
3. Физическое лицо, которое достигло четырнадцати лет, имеет право на смену отчества в случае изменения его отцом своего собственного имени или исключения сведений о нем как отца ребенка из актовой записи о его рождении.
4. Фамилия, имя и отчество физического лица могут быть изменены в случае его усыновления, признания усыновления недействительным или его отмены в соответствии с законом.
5. Фамилия физического лица может быть изменено в случае регистрации брака, расторжения брака или признания его недействительным.
6. Основаниями для отказа в изменении имени являются:
пребывание заявителя под следствием, судом, административным надзором;
осуществление в отношении заявителя уголовного производства или его пребывания под административным надзором;
официальное обращение правоохранительных органов иностранных государств об объявлении розыска заявителя;
представления заявителем неправдивых сведений о себе.
7. Порядок рассмотрения заявлений об изменении имени (фамилии, собственного имени, отчества) физического лица устанавливается Кабинетом Министров Украины.

Статья 296. Право на использование имени
1. Физическое лицо имеет право использовать свое имя во всех сферах своей деятельности.
2. Использование имени физического лица в литературных и других произведениях, кроме произведений документального характера, как персонажа (действующего лица) допускается только с его согласия, а после ее смерти - С согласия его детей, вдовы (вдовца), а если их нет, - родителей, братьев и сестер..
3. Использование имени физического лица с целью освещения его деятельности или деятельности организации, в которой оно работает или учится, основанное на соответствующих документах (отчеты, стенограммы, протоколы, аудио-, видеозаписи, архивные материалы и т.п.), допускается без его согласия.
4. Имя физического лица, задержана, подозревается или обвиняется в совершении уголовного преступления, или лица, совершившего административное правонарушение, может быть использовано (обнародовано) лишь в случае вступления в законную силу обвинительного приговора суда в отношении него или вынесения постановления по делу об административном правонарушении и в других случаях, предусмотренных законом.
5. Имя пострадавшего от правонарушения может быть обнародовано лишь при его согласии.
6. Имя участника гражданского спора, который касается личной жизни сторон, может быть использовано другими лицами лишь при его согласии.
7. Использование начальной буквы фамилии физического лица в средствах массовой информации, литературных произведениях не является нарушением его права.

Статья 297. Право на уважение достоинства и чести
1. Каждый имеет право на уважение его достоинства и чести.
2. Достоинство и честь физического лица являются неприкосновенными.
3. Физическое лицо имеет право обратиться в суд с иском о защите его достоинства и чести.

Статья 298. Уважение к человеку, который является умершим
1. Каждый обязан почтительно относиться к телу умершего человека.
2. Каждый обязан почтительно относиться к месту погребения человека.
3. В случае надругательства над телом умершего человека, или над местом его погребения члены его семьи, близкие родственники имеют право на возмещение имущественного и морального ущерба.

Статья 299. Право на неприкосновенность деловой репутации
1. Физическое лицо имеет право на неприкосновенность своей деловой репутации.
2. Физическое лицо может обратиться в суд с иском о защите своей деловой репутации.

Статья 300. Право на индивидуальность
1. Физическое лицо имеет право на индивидуальность.
2. Физическое лицо имеет право на сохранение своей национальной, культурной, религиозной, языковой самобытности, а также право на свободный выбор форм и способов проявления своей индивидуальности, если они не запрещены законом и не противоречат моральным основам общества.

Статья 301. Право на личную жизнь и ее тайну
1. Физическое лицо имеет право на личную жизнь.
2. Физическое лицо само определяет свою личную жизнь и возможность ознакомления с ним других лиц.
3. Физическое лицо имеет право на сохранение в тайне обстоятельств своей личной жизни.
4. Обстоятельства личной жизни физического лица могут быть разглашены другими лицами лишь при условии, что они содержат признаки правонарушения, что подтверждено решением суда, а также за ее согласию.

Статья 302. Право на информацию
1. Физическое лицо имеет право свободно собирать, сохранять, использовать и распространять информацию.
Собирание, сохранение, использование и распространение информации о личной жизни физического лица без его согласия не допускаются, кроме случаев, определенных законом, и лишь в интересах национальной безопасности, экономического благосостояния и прав человека. Не допускается также собирание информации, которая является государственной тайной или конфиденциальной информацией юридического лица.
2. Физическое лицо, которое распространяет информацию, обязано убедиться в ее достоверности.
3. Считается, что информация, которая подается должностным, служебным лицом при выполнении им своих служебных обязанностей, а также информация, которая помещается в официальных источниках (отчеты, стенограммы, сообщение средств массовой информации, основателями которых являются соответствующие государственные органы или органы местного самоуправления), является достоверной.
Физическое лицо, которое распространяет такую информацию, не обязано проверять ее достоверность и не отвечает в случае ее опровержения.

Статья 303. Право на личные бумаги
1. Личные бумаги (документы, фотографии, дневники, другие записи, личные архивные материалы и т.п.) физического лица являются его собственностью.
2. Ознакомление с личными бумагами, их использование, в частности путем опубликования, допускаются лишь по согласию физического лица, которому они принадлежат.
3. Если личные бумаги физического лица касаются личной жизни другого лица, для их использования, в том числе путем опубликования, нужно согласие этого лица.
4. В случае смерти физических лиц, определенных частями второй и третьей этой статьи, личные бумаги могут быть использованы, в том числе путем опубликования, лишь по согласию их детей, вдовы (вдовца), а если их нет, - родителей, братьев и сестер.

Статья 304. Распоряжение личными бумагами
1. Физическое лицо, которому принадлежат личные бумаги, может устно или в письменной форме распорядиться ими, в том числе и на случай своей смерти.

Статья 305. Право на ознакомление с личными бумагами, переданными в фонд библиотек или архивов
1. Физическое лицо имеет право свободно ознакомляться и использовать, в частности путем опубликования, любые личные бумаги, переданные в фонд библиотек или архивов, с соблюдением прав физических лиц, определенных частями третьей и четвертой статьи 303 Гражданского кодекса Украины, если другое не установлено договором, на основании которого были переданы личные бумаги.

Статья 306. Право на тайну корреспонденции
1. Физическое лицо имеет право на тайну переписки, телеграмм, телефонных разговоров, телеграфных сообщений и других видов корреспонденции.
Письма, телеграммы и т.п. являются собственностью адресата.
2. Письма, телеграммы и прочие виды корреспонденции могут использоваться, в частности путем опубликования, лишь по согласию лица, которое направило их, и адресата.
Если корреспонденция касается личной жизни другого физического лица, для ее использования, в частности путем опубликования, нужно согласие этого лица.
3. В случае смерти физического лица, которое направило корреспонденцию, и адресата использования корреспонденции, в частности путем ее опубликования, возможно лишь по согласию физических лиц, определенных частью четвертой статьи 303 Гражданского кодекса Украины.
В случае смерти физического лица, которое направило корреспонденцию, и адресата, а также в случае смерти физических лиц, определенных частью четвертой статьи 303 Гражданского кодекса Украины, корреспонденция, которая имеет научную, художественную, историческую ценность, может быть опубликована в порядке, установленном законом.
4. Корреспонденция, которая касается физического лица, может быть приобщена к судебному делу лишь в случае, если в ней помещаются доказательства, которые имеют значение для решения дела. Информация, которая помещается в такой корреспонденции, не подлежит разглашению.
5. Нарушение тайны корреспонденции может быть разрешено судом в случаях, установленных законом, с целью предотвращения преступления или выяснения истины во время расследования уголовного дела, если другими способами получить информацию невозможно.

Статья 307. Защита интересов физического лица при проведении фото-, кино-, теле- и видеосъемок
1. Физическое лицо может быть снято на фото-, кино-, теле- ли видеопленку лишь при его согласии. Согласие лица на снятие его на фото-, кино-, теле- ли видеопленку предполагается, если съемки проводятся открыто на улице, на собрании, конференциях, митингах и других мероприятиях публичного характера.
2. Физическое лицо, которое согласилось на снятие его на фото-, кино-, теле- ли видеопленку, может требовать прекращения их публичного показа в той части, которая касается его личной жизни. Затраты, связанные с демонтажем выставки или записи, возмещаются этим физическим лицом.
3. Снятие физического лица на фото-, кино-, теле- ли видеопленку, в том числе тайное, без согласия лица может быть проведено лишь в случаях, установленных законом.

Статья 308. Охрана интересов физического лица, которое изображено на фотографиях и в других художественных произведениях
1. Фотография, другие художественные произведения, на которых изображено физическое лицо, могут быть публично показаны, воспроизведены, распространены лишь по согласию этого лица, а в случае его смерти - по согласию лиц, определенных частью четвертой статьи 303 Гражданского кодекса Украины.
Согласие, которое дало физическое лицо, изображенное на фотографии, другом художественном произведении, может быть после его смерти отозвано лицами, определенными частью четвертой статьи 303 Гражданского кодекса Украины. Затраты лица, которое осуществляло публичный показ, воспроизведение или распространение фотографии, другого художественного произведения, возмещаются этими лицами.
2. Если физическое лицо позировало автору за плату, фотография, другое художественное произведение может быть публично показано, воспроизведено или распространено без его согласия.
Физическое лицо, которое позировало автору фотографии, другого художественного произведения за плату, а после его смерти - его дети и вдовья (вдовец), родители, братья и сестры могут требовать прекращения публичного показа, воспроизведения или распространения фотографии, другого художественного произведения при условии возмещения автору или другому лицу связанных с этим убытков.
3. Фотография может быть распространена без разрешения физического лица, изображенного на ней, если это вызвано необходимостью защиты его интересов или интересов других лиц.

Статья 309. Право на свободу литературного, художественного, научного и технического творчества
1. Физическое лицо имеет право на свободу литературного, художественного, научного и технического творчества.
2. Физическое лицо имеет право на свободный выбор сфер, содержания и форм (способов, приемов) творчества.
Цензура процесса творчества и результатов творческой деятельности не допускается.

Статья 310. Право на местожительство
1. Физическое лицо имеет право на местожительство.
2. Физическое лицо имеет право на свободный выбор местожительства и его изменения, кроме случаев, установленных законом.

Статья 311. Право на неприкосновенность жилья
1. Жилье физического лица является неприкосновенным.
2. Проникновение в жилье или другое владение физического лица, проведение в нем осмотра или обыска может состояться лишь по мотивированному решению суда.
3. В неотложных случаях, связанных со спасением жизни людей и имущества или с непосредственным преследованием лиц, которые подозреваются в совершении преступления, законом может быть установлен другой порядок проникновения в жилье или в другое владение физического лица, проведение в них осмотре и обыска.
4. Физическое лицо не может быть выдворена или иным образом принудительно лишено жилья, кроме случаев, установленных законом.

Статья 312. Право на выбор рода занятий
1. Физическое лицо имеет право на выбор и изменение рода занятий.
2. Физическому лицу может быть запрещено выполнять определенную работу или занимать определенные должности в случаях и в порядке, установленных законом.
3. Использование принудительной работы запрещается.
Не считаются принудительной работой воинская или альтернативная (невоенная) служба, работа или служба, которая выполняется лицом по приговору или другим решениям суда, а также работа или служба соответственно законам о военном и о чрезвычайном положении.

Статья 313. Право на свободу передвижения
1. Физическое лицо имеет право на свободу передвижения.
2. Физическое лицо, которое достигло четырнадцати лет, имеет право на свободное самостоятельное передвижение по территории Украины и на выбор места пребывания.
Физическое лицо, которое не достигло четырнадцати лет, имеет право передвигаться по территории Украины лишь по согласию родителей (усыновителей), опекунов и в их сопровождении или в сопровождении лиц, уполномоченных ими.
3. Физическое лицо, являющееся гражданином Украины, имеет право на беспрепятственное возвращение в Украину.
Физическое лицо, которое достигло шестнадцати лет, имеет право на свободный самостоятельный выезд за пределы Украины.
Физическое лицо, не достигшее шестнадцати лет, имеет право на выезд за пределы Украины только с согласия родителей (усыновителей), опекунов и в их сопровождении или в сопровождении лиц, уполномоченных ими, кроме случаев, предусмотренных законом.
4. Физическое лицо может быть ограничено в осуществлении права на передвижение лишь в случаях, установленных законом.
5. Физическое лицо не может быть выдворено из избранного им места пребывания, доступ к которому не запрещен законом.
6. Законом могут быть установлены особые правила доступа на отдельные территории, если этого требуют интересы государственной безопасности, охраны общественного порядка, жизнь и здоровье людей.

Статья 314. Право на свободу объединения
1. Физические лица имеют право на свободу объединения в политические партии и общественные организации.
2. Принадлежность или непринадлежность физического лица к политической партии или общественной организации не является основанием для ограничения его прав, предоставления ему льгот или преимуществ.

Статья 315. Право на мирные собрания
1. Физические лица имеют право свободно собираться на мирные сборы, конференции, заседания, фестивали и т.п.
2. Ограничение относительно реализации права на мирные собрания может устанавливаться судом в соответствии с законом.
"""

GKU_g_23 = """ 
Книга третья - Право собственности и прочие вещные права
Глава 23 - Гражданского кодекса
Общие положения о праве собственности

Статья 316. Понятие права собственности
1. Правом собственности является право лица на вещь (имущество), которое оно осуществляет в соответствии с законом по своей воле, независимо от воли других лиц.
2. Особым видом права собственности является право доверительной собственности, возникающее вследствие закона или договора.

Статья 317. Содержание права собственности
1. Собственнику принадлежат права владения, пользования и распоряжения своим имуществом.
2. На содержание права собственности не влияют местожительство собственника и местонахождение имущества.

Статья 318. Субъекты права собственности
1. Субъектами права собственности является Украинский народ и прочие участники гражданских отношений, определенные статьей 2 Гражданского кодекса Украины.
2. Все субъекты права собственности являются равными перед законом.

Статья 319. Осуществление права собственности
1. Собственник владеет, пользуется, распоряжается своим имуществом по своему усмотрению.
2. Собственник имеет право совершать относительно своего имущества любые действия, которые не противоречат закону.
При осуществлении своих прав и исполнении обязанностей собственник обязан соблюдать нравственные начала общества.
3. Всем собственникам обеспечиваются равные условия осуществления своих прав.
4. Собственность обязывает.
5. Владелец не может использовать право собственности во вред правам, свободам и достоинству граждан, интересам общества, ухудшать экологическую ситуацию и природные качества земли.
6. Государство не вмешивается в осуществление владельцем права собственности.
7. Деятельность собственника может быть ограничена или прекращена или владелец может быть обязан допустить к пользованию его имуществом других лиц лишь в случаях и в порядке, установленных законом.
8. Особенности осуществления права собственности на культурные ценности устанавливаются законом.

Статья 320. Использование собственником своего имущества для осуществления предпринимательской деятельности
1. Собственник имеет право использовать свое имущество для осуществления предпринимательской деятельности, кроме случаев, установленных законом.
2. Законом могут быть установлены условия использования собственником своего имущества для осуществления предпринимательской деятельности.

Статья 321. Нерушимость права собственности
1. Право собственности является нерушимым. Никто не может быть противоправно лишен этого права или ограничен в его осуществлении.
2. Лицо может быть лишено права собственности или ограничено в его осуществлении лишь в случаях и в порядке, установленном законом.
3. Принудительное отчуждение объектов права собственности может быть применено лишь в порядке исключения из мотивов общественной необходимости на основании и в порядке, установленных законом, и при условии предшествующего и полного возмещения их стоимости, кроме случаев, установленных частью второй статьи 353 Гражданского кодекса Украины.

Статья 322. Бремя содержания имущества
1. Собственник обязан содерживать имущество, которое ему принадлежит, если другое не установлено договором или законом.

Статья 323. Риск случайного уничтожения и случайного повреждения имущества
1. Риск случайного уничтожения и случайного повреждения (порчи) имущества несет его собственник, если другое не установлено договором или законом.

Статья 324. Право собственности Украинского народа
1. Земля, ее недра, атмосферный воздух, водные и прочие естественные ресурсы, которые находятся в границах территории Украины, естественные ресурсы ее континентального шельфа, исключительной (морской) экономической зоны являются объектами права собственности Украинского народа.
2. От лица Украинского народа права собственника осуществляют органы государственной власти и органы местного самоуправления в границах, установленных Конституцией Украины
3. Каждый гражданин имеет право пользоваться естественными объектами права собственности Украинского народа в соответствии с законом.

Статья 325. Право частной собственности
1. Субъектами права частной собственности являются физические и юридические лица.
2. Физические и юридические лица могут быть собственниками любого имущества, за исключением отдельных видов имущества, которые соответственно закону не могут им принадлежать.
3. Состав, количество и стоимость имущества, которое может быть в собственности физических и юридических лиц, не являются ограниченными.
Законом могут быть установлены ограничения размера земельного участка, который может быть в собственности физического и юридического лица.

Статья 326. Право государственной собственности
1. В государственной собственности находится имущество, в том числе денежные средства, которые принадлежат государству Украина.
2. От лица и в интересах государства Украина право собственности осуществляют соответственные органы государственной власти.
3. Управление имуществом, находящимся в государственной собственности, осуществляется государственными органами, а в случаях, предусмотренных законом, может осуществляться иными субъектами.

Статья 327. Право коммунальной собственности
1. В коммунальной собственности находится имущество, в том числе денежные средства, которые принадлежат территориальной общине.
2. Управление имуществом, которое находится в коммунальной собственности, осуществляют непосредственно территориальная община и образованные ею органы местного самоуправления.
"""
GKU_g_24 = """ 
Глава 24 - Гражданского кодекса
Приобретение права собственности

Статья 328. Основания приобретения права собственности
1. Право собственности приобретается на основаниях, которые не запрещены законом, в частности со сделок.
2. Право собственности считается приобретенным правомерно, если иное прямо не вытекает из закона или незаконность приобретения права собственности или необоснованность активов, находящихся в собственности, не установлены судом.

Статья 329. Приобретение права собственности юридическим лицом публичного права
1. Юридическое лицо публичного права приобретает право собственности на имущество, переданное ему в собственность, и на имущество, приобретенное им в собственность на основаниях, не запрещенных законом.

Статья 330. Приобретение добросовестным приобретателем права собственности на имущество, отчужденное лицом, которое не имело на это права
1. Если имущество отчуждено лицом, которое не имело на это права, добросовестный приобретатель приобретает право собственности на него, если согласно статье 388 настоящего Кодекса имущество не может быть истребовано у него.

Статья 331. Приобретение права собственности на вновь созданное имущество и объекты незавершенного строительства
1. Право собственности на новую вещь, изготовленную (создана) лицом, приобретается им, если иное не установлено договором или законом.
Лицо, изготовила (создала) вещь из своих материалов на основании договора, является собственником этой вещи.
2. Право собственности на вновь созданное недвижимое имущество (жилые здания, строения, сооружения и т.п.) возникает с момента завершения строительства (создания имущества).
Если договором или законом предусмотрено принятие недвижимого имущества в эксплуатацию, право собственности возникает с момента его принятия в эксплуатацию.
Если право собственности на недвижимое имущество согласно закону подлежит государственной регистрации, право собственности возникает с момента государственной регистрации.
3. До завершения строительства (создания имущества) лицо считается собственником материалов, оборудования и т.п., которые были использованы в процессе этого строительства (создания имущества).
В случае необходимости лицо, указанное в абзаце первом настоящей части, может заключить договор относительно объекта незавершенного строительства после проведения государственной регистрации права собственности на него в соответствии с законом.
Часть четвертая статьи 331 исключена на основании Закона N 3201-IV от 15.12.2005.

Статья 332. Обретение права собственности на переработанную вещь
1. Переработкой является использование одной вещи (материала), в результате чего создается новая вещь.
2. Лицо, которое самовольно переработало чужую вещь, не приобретает право собственности на новую вещь и обязано возместить собственнику материала его стоимость.
3. Право собственности на движимую вещь, созданную лицом путем переработки из материала, что ему не принадлежит, приобретается собственником материала по его желанию, если другое не установлено договором или законом.
4. Если стоимость переработки и созданной новой вещи существенным образом превышает стоимость материала, право собственности на новую вещь приобретает по ее желанию лицо, которое осуществило такую переработку. В этом случае лицо, которое осуществило переработку, обязано возместить собственнику материала моральный ущерб.
5. Собственник материала, который приобрел право собственности на изготовленную из него вещь, обязан возместить стоимость переработки лицу, которое ее осуществило, если другое не установлено договором.

Статья 333. Присвоение общедоступных даров природы
1. Лицо, собравшее ягоды, врачебные растения, поймавшее рыбу или получившее другую вещь в лесу, водоеме и т.п., является их собственником, если оно действовало согласно закону, местному обычаю или общему разрешению собственника соответствующего земельного участка.

Статья 334. Момент обретения права собственности по договору
1. Право собственности у приобретателя имущества по договору возникает с момента передачи имущества, если другое не установлено договором или законом.
2. Передачей имущества считается вручение его приобретателю или перевозчику, организации связи и т.п. для отправления, пересылки приобретателю имущества, отчужденного без обязательства доставки.
К передаче имущества приравнивается вручение коносамента или другого товарно-распорядительного документа на имущество.
3. Право собственности на имущество по договору, который подлежит нотариальному удостоверению, возникает у приобретателя с момента такого удостоверения или с момента обретения законной силы решением суда о признании договора, не удостоверенного нотариально, действительным.
4. Если договор об отчуждении имущества подлежит государственной регистрации, право собственности у приобретателя возникает с момента такой регистрации.

Статья 335. Обретение права собственности на бесхозную вещь
1. Бесхозной является вещь, которая не имеет собственника или собственник которой неизвестен.
2. Бесхозные недвижимые вещи берутся на учет органом, который осуществляет государственную регистрацию прав на недвижимое имущество, по заявлению органа местного самоуправления, на территории которого они размещены. О взятии бесхозной недвижимой вещи на учет делается объявление в печатных средствах массовой информации.
После истечения одного года со дня взятия на учет бесхозной недвижимой вещи она по заявлению органа, уполномоченного управлять имуществом соответствующей территориальной общины, может быть передана по решению суда в коммунальную собственность.
3. Бесхозные движимые вещи могут приобретаться в собственность по приобретательской давности, кроме случаев, установленных статьями 336, 338, 341 и 343 Гражданского кодекса Украины.

Статья 336. Обретение права собственности на подвижную вещь, от которой собственник отказался
1. Лицо, которое завладело подвижной вещью, от которой собственник отказался (статья 347 Гражданского кодекса Украины), приобретает право собственности на эту вещь с момента завладения ею.

Статья 337. Находка
1. Лицо, которое нашло утерянную вещь, обязано немедленно сообщить об этом лицу, которое ее потеряло, или собственнику вещи и возвратить найденную вещь этому лицу.
Лицо, которое нашло утерянную вещь в помещении или транспортном средстве, обязано передать его лицу, которое представляет владельца этого помещения или транспортного средства. Лицо, которому передана находка, приобретает права и обязанности лица, которое нашло утерянную вещь.
2. Если лицо, которое имеет право требовать возвращения утерянной вещи, или место его пребывания неизвестны, лицо, которое нашло утерянную вещь, обязано сообщить о находке Национальной полиции или органу местного самоуправления.
3. Лицо, которое нашло утерянную вещь, имеет право сохранять ее у себя или сдать на хранение Национальной полиции, или органу местного самоуправления, или передать находку лицу, которое они указали.
Вещь, которая быстро портится, или вещь, затраты на сохранение которой являются непропорционально большими сравнительно с ее стоимостью, может быть продана лицом, которое ее нашло, с получением письменных доказательств, которые подтверждают сумму выручки. Сумма денег, полученная от продажи найденной вещи, подлежит возвращению лицу, которое имеет право требовать ее возвращения.
4. Лицо, которое нашло утерянную вещь, отвечает за ее потерю, уничтожение или повреждение в границах ее стоимости лишь в случае своего умысла или грубой неосторожности.

Статья 338. Обретение права собственности на находку
1. Лицо, которое нашло утерянную вещь, приобретает право собственности на нее поистечению шести месяцев с момента заявления о находке в Национальную полицию или орган местного самоуправления, если:
не будет установлен собственник или другое лицо, которое имеет право требовать возвращения утерянной вещи;
собственник или другое лицо, которое имеет право требовать возвращения утерянной вещи, не заявит о своем праве на вещь лицу, которое ее нашло, Национальной полиции или органу местного самоуправления.
2. Если лицо, которое нашло утерянную вещь, подаст органу местного самоуправления письменное заявление об отказе от приобретения права собственности на нее, эта вещь переходит в собственность территориальной общины.
3. Найденные транспортные средства передаются на сохранение в Национальную полицию, о чем делается объявление в печатных средствах массовой информации.
Если на протяжении шести месяцев со дня опубликования этого объявления собственник или другое лицо, которое имеет право требовать возвращения транспортного средства, не будут выявлены или они не заявят о своих правах на транспортное средство, Национальная полиция имеет право продать его, а сумму выручки внести на специальный счет в банке. Если на протяжении трех лет бывший собственник транспортного средства не будет требовать передачи ему суммы выручки, эта сумма переходит в собственность территориальной общины, на территории которой было найдено транспортное средство.

Статья 339. Право лица, которое нашло утерянную вещь, на вознаграждение и возмещение затрат, связанных с находкой
1. Лицо, которое нашло утерянную вещь, имеет право требовать от лица, которому она возвращена, или лица, которое приобрело право собственности на нее, возмещение необходимых затрат, связанных с находкой (сохранение, поиск собственника, продажа вещи и т.п.).
2. Лицо, которое нашло утерянную вещь, имеет право требовать от ее собственника (владельца) вознаграждение за находку в размере до двадцати процентов стоимости вещи.
3. Если собственник (владелец) публично обещал вознаграждение за находку, вознаграждение выплачивается на условиях публичного обещания.
4. Право на получение вознаграждения не возникает, если лицо, которое нашло утерянную вещь, не заявило о находке или совершило попытку припрятать ее.

Статья 340. Безнадзорное домашнее животное
1. Лицо, которое задержало безнадзорное домашнее животного, обязано немедленно сообщить об этом собственнику и возвратить его. Если собственник безнадзорного домашнего животного или место его пребывания неизвестны, лицо, которое задержало животное, обязано на протяжении трех дней заявить об этом органу местного самоуправления, который принимает меры относительно поиска собственника.
2. Лицо, которое задержало безнадзорное домашнее животное, может на время поиска собственника оставить его у себя на содержании и в пользовании или передать другому лицу, если это лицо может обеспечить содержание и уход за животным с соблюдением ветеринарных правил, или передать его в орган местного самоуправления.
3. Лицо, у которого оставлено безнадзорное домашнее животное, отвечает за его гибель или повреждение в границах его стоимости лишь в случае своего умысла или грубой неосторожности.

Статья 341. Обретение права собственности на безнадзорное домашнее животное
1. Если на протяжении шести месяцев с момента заявления о задержании безнадзорного домашнего или крупного рогатого скота и на протяжении двух месяцев - относительно других домашних животных не будет выявлен их собственник или он не заявит о своем праве на них, право собственности на этих животных переходит к лицу, у которого они были на иждивении и в пользовании.
2. В случае отказа лица, у которого безнадзорное домашнее животное было на иждивении и в пользовании, от приобретения права собственности на него это животное переходит в собственность территориальной общины, на территории которой оно было выявлено.

Статья 342. Возмещение затрат на содержание безнадзорного домашнего животного и выплата вознаграждения
1. В случае возвращения безнадзорного домашнего животного собственнику лицо, которое задержало животное, и лицо, которому оно было передано на содержание и в пользование, имеют право на возмещение затрат, связанных с содержанием животного, за вычетом выгод, полученных от пользования им.
2. Лицо, которое задержало безнадзорное домашнее животного, имеет право на вознаграждение соответственно статье 339 Гражданского кодекса Украины

Статья 343. Обретение права собственности на клад
1. Кладом является закопаные в земле или скрытые иным способом деньги, валютные ценности, другие ценные вещи, собственник которых неизвестен или по закону утратил на них право собственности.
2. Лицо, которое обнаружило клад, приобретает право собственности на него.
Если клад был сокрыт в имуществе, принадлежащем на праве собственности другому лицу, лицо, обнаружившее его, и собственник имущества, в которой клад был сокрыт, приобретают в равных долях право общей долевой собственности на него.
3. В случае обнаружения клада лицом, осуществлявшим раскопки или поиск ценностей без согласия собственника имущества, в котором он был скрытый, право собственности на клад приобретает владелец этого имущества.
4. В случае обнаружения клада, что составляет культурную ценность согласно закону, право собственности на него приобретает государство.
Лицо, изъявившее такой клад, имеет право на получение от государства вознаграждения в размере до двадцати процентов от его стоимости на момент обнаружения, если оно немедленно сообщило Национальной полиции или органу местного самоуправления о кладе и передало его соответствующему государственному органу или органу местного самоуправления.
Если клад, представляющий культурную ценность, был обнаружен в имуществе, принадлежащем другому лицу, это лицо, а также лицо, обнаружившее клад, имеют право на вознаграждение в размере до десяти процентов от стоимости клада каждое.
5. Положения настоящей статьи не распространяются на лиц, нашедших клад во время раскопок, поисков, проводившихся в соответствии с их трудовыми или договорными обязательствами.

Статья 344. Приобретательная давность
1. Лицо, которое добросовестно завладело чужим имуществом и продолжает открыто, беспрерывно владеть недвижимым имуществом на протяжении десяти лет или движимым имуществом - на протяжении пяти лет, приобретает право собственности на это имущество (приобретательная давность), если другое не установлено этим Кодексом.
Обретение права собственности на земельный участок по приобретательной давности регулируется законом.
Право собственности на недвижимое имущество, которое подлежит государственной регистрации, возникает по приобретательной давности с момента государственной регистрации.
2. Лицо, которое заявляет о давности владения, может присоединить к времени своего владения все время, на протяжении которого этим имуществом владело лицо, чьим наследником (правопреемником) оно является.
3. Если лицо завладело имуществом на основании договора с его собственником, который после окончания срока договора не предъявил требования о его возвращении, оно приобретает право собственности по приобретательной давности на недвижимое имущество через пятнадцать, а на движимое имущество - через пять лет со времени итечения исковой давности.
Потеря не из своей воли имущества его владельцем не перерывает приобретательной давности в случае возвращения имущества на протяжении одного года или предъявления на протяжении этого срока иска про его истребование.
4. Право собственности по приобретательной давности на недвижимое имущество, транспортные средства, ценные бумаги приобретается по решению суда.

Статья 345. Обретение права собственности в случае приватизации государственного имущества и имущества, которое находится в комунальной собственности
1. Физическое или юридическое лицо может приобрести право собственности в случае приватизации государственного имущества и имущества, находящегося в коммунальной собственности.
В результате приобретения единого имущественного комплекса государственного (коммунального) предприятия в процессе приватизации к покупателю переходят все его права и обязанности.
2. Приватизация осуществляется в порядке, установленном законом.
"""
GKU_g_25 = """ 
Глава 25 - Гражданского кодекса
Прекращение права собственности

Статья 346. Основания прекращения права собственности
1. Право собственности прекращается в случае:
отчуждения собственником своего имущества;
отказа собственника от права собственности;
прекращение права собственности на имущество, которое по закону не может принадлежать этому лицу;
уничтожение имущества;
выкупа памятников культурного наследия;
принудительного отчуждения земельных участков частной собственности, других объектов недвижимого имущества, размещенных на них, с мотивов общественной необходимости в соответствии с законом;
Пункт 7 части первой статьи 346 исключено на основании Закона N 1559-VI от 17.11.2009
обращение взыскания на имущество по обязательствам собственника;
реквизиции;
конфискации;
прекращения юридического лица или смерти собственника.
признание необоснованными активов и их взыскания в доход государства.
2. Право собственности может быть прекращено в других случаях, установленных законом.

Статья 347. Отказ от права собственности
1. Лицо может отказаться от права собственности на имущество, заявив об этом или совершив другие действия, которые свидетельствуют про его отказ от права собственности.
2. В случае отказа от права собственности на имущество, права на которое не подлежат государственной регистрации, право собственности на него прекращается из момента совершения действия, которое свидетельствует о таком отказе.
3. В случае отказа от права собственности на имущество, права на которое подлежат государственной регистрации, право собственности на него прекращается с момента внесения по заявлению собственника соответствующей записи в государственный реестр.

Статья 348. Прекращение права собственности лица на имущество, которое не может ему принадлежать
1. Если по основаниям, не запрещенным законом, лицо приобрело право собственности на имущество, которое по закону, принятому позже, не может ему принадлежать, это имущество может быть отчуждено собственником на протяжении срока, установленного законом.
Если имущество не отчуждено собственником в установленные законом сроки, это имущество с учетом его характера и назначения по решению суда на основании заявления соответствующего органа государственной власти подлежит принудительной продаже. В случае принудительной продажи имущества его бывшему собственнику передается сумма выручки за вычетом затрат, связанных с отчуждением имущества.
Если имущество не было продано, оно по решению суда передается в собственность государства. В этом случае бывшему собственнику имущества выплачивается сумма, определенная по решению суда.
2. Если по основаниям, не запрещенным законом, лицо приобрело право собственности на имущество, на обретение которого по закону, принятому позже, требуется особое разрешение, а в его выдаче этому лицу было отказано, это имущество подлежит отчуждению в порядке, установленному частью первой этой статьи.

Статья 349. Прекращение права собственности вследствие уничтожения имущества
1. Право собственности на имущество прекращается в случае его уничтожения.
2. В случае уничтожения имущества, права на которое подлежат государственной регистрации, право собственности на это имущество прекращается с момента внесения по заявлению собственника изменений в государственный реестр.

Статья 350. Выкуп земельных участков, других объектов недвижимого имущества, размещенных на них, частной собственности для общественных потребностей или их принудительное отчуждения по мотивам общественной необходимости
Выкуп земельных участков, других объектов недвижимого имущества, на них, частной собственности для общественных потребностей или их принудительное отчуждение по мотивам общественной необходимости осуществляются в порядке, установленном законом.

Статья 351. Прекращение права собственности на недвижимое имущество в связи с выкупом для общественных нужд или принудительным отчуждением по мотивам общественной необходимости земельного участка, на котором оно размещено
1. Право собственности на жилой дом, другие здания, сооружения, многолетние насаждения может быть прекращено по соглашению собственника в случае выкупа земельного участка, на котором они размещены, для общественных нужд или по решению суда в случае ее принудительного отчуждения по мотивам общественной необходимости с обязательным предварительным и полным возмещением их стоимости.
2. Лицо, право собственности которого подлежит прекращению, имеет право требовать предоставления ему в пределах территории, на которую распространяются полномочия соответствующего органа местного самоуправления или органа исполнительной власти, иного земельного участка, стоимость которой учитывается при определении выкупной цены.
3. В случае если владелец земельного участка, подлежащего принудительному отчуждению по мотивам общественной необходимости, является собственником жилого дома, других зданий, сооружений, многолетних насаждений, на ней размещены, требование о принудительном отчуждении земельного участка по мотивам общественной необходимости рассматривается вместе с требованием о прекращении права собственности на такие объекты.
4. В случае если владелец земельного участка, подлежащего принудительному отчуждению по мотивам общественной необходимости, не является собственником жилого дома, других зданий, сооружений, многолетних насаждений, на ней размещены, вопрос об отчуждении рассматривается с каждым собственником отдельно.
5. До вступления в законную силу решения суда о принудительном отчуждения земельного участка по мотивам общественной необходимости собственник вправе по своему усмотрению распоряжаться жилым домом, другими строениями, сооружениями, многолетними насаждениями, размещенных на таком земельном участке.
6. Владелец земельного участка в случае его отчуждения в пользу другого лица обязан предупредить такое лицо о решении, принятое органом исполнительной власти или органом местного самоуправления о выкупе земельного участка, других объектов недвижимого имущества, на ней размещены, для общественных нужд, и в десятидневный срок уведомить орган, принявший такое решение, о отчуждения земельного участка в пользу другого лица. Решение о выкуп земельного участка для общественных нужд сохраняет свою действие для нового владельца земельного участка.

Статья 352. Выкуп памятники культурного наследия
1. Если в результате действий или бездействия владельца памятника культурного наследия ему угрожает повреждение или уничтожение, соответствующий орган охраны культурного наследия делает владельцу памятники соответствующее предупреждение.
2. Если владелец памятника культуры не примет меры по его сохранению, в частности в связи с невозможностью создания необходимых для этого условий, суд по иску соответствующего органа охраны культурного наследия может постановить решение о его выкупе.
3. В случае неотложной необходимости обеспечения условий для сохранению памятника культурного наследия иск о его выкупе может быть предъявлен без предупреждения.
4. Выкуплена памятник культурного наследия переходит в собственность государства.
5. Выкупная цена памятника культурного наследия определяется по согласию сторон, а в случае спора - судом.

Статья 353. Реквизиция
1. В случае стихийного бедствия, аварии, эпидемии, эпизоотии и при других чрезвычайных обстоятельств, с целью общественной необходимости имущество может быть принудительно отчуждено у собственника на основании и в порядке, установленных законом, при условии предшествующего и полного возмещения его стоимости (реквизиция).
2. В условиях военного или чрезвычайного положения имущество может быть принудительно отчуждено у собственника с последующим полным возмещением его стоимости.
3. Реквизированное имущество переходит в собственность государства или уничтожается.
4. Оценка, по которой прежнему собственнику была возмещена стоимость реквизированного имущества, может быть обжалована в суде.
5. В случае реквизиции имущества его прежний собственник может требовать взамен предоставления ему другого имущества, если это возможно.
6. Если после прекращения чрезвычайного обстоятельства реквизированное имущество сохранилось, лицо, которому оно принадлежало, имеет право требовать его возвращения в судовом порядке.
В случае возвращения имущества лицу у него возобновляется право собственности на это имущество, одновременно оно обязуется возвратить денежную сумму или вещь, которое было им получено в связи с реквизицией, за вычетом умной платы за использование этого имущества.

Статья 354. Конфискация
1. К лицу может быть применено лишение права собственности на имущество по решению суда как санкция за совершение правонарушения (конфискация) в случаях, установленных законом.
Конфискованное имущество переходит в собственность государства безвозмездно.
2. Объем и порядок конфискации имущества устанавливаются законом.
"""
GKU_g_26 = """ 
Глава 26 - Гражданского кодекса
Право общей собственности

Статья 355. Понятие и виды права общей собственности
1. Имущество, которое находится в собственности двух или больше лиц (совладельцев), принадлежит им на праве общей собственности (общее имущество).
2. Имущество может принадлежать лицам на праве общей долевой или на праве общей совместной собственности.
3. Право общей собственности возникает на основаниях, не запрещенных законом.
4. Общая собственность считается частичной, если договором или законом не установлена общая совместная собственность на имущество.

Статья 356. Право общей долевой собственности
1. Собственность двух или больее лиц с определением долей любого из них в праве собственности и общей частичной собственности.
2. Субъектами права общей долевой собственности могут быть физические лица, юридические лица, государство, территориальные общины.

Статья 357. Определение частиц в праве общей долевой собственности
1. Доли в праве общей долевой собственности считаются равными, если другое не установлено по договоренности совладельцев или законом.
2. Если размер долей в праве общей частичной собственности не установлен по договоренности совладельцев или законом, он определяется с учетом вклада любого из совладельцев в приобретение (изготовление, сооружение) имущества.
3. Совладелец имеет право на соответствующее увеличение своей доли в праве общей долевой собственности, если улучшение общего имущества, которые нельзя отделить, произведены им своими средствами по согласию всех совладельцев, с соблюдением установленного порядка использования общего имущества.
4. Совладелец жилого дома, другого здания, сооружения может сделать в установленном законом порядке за свой счет достройку (пристройку) без согласия других совладельцев, если это не нарушает их прав. Такая достройка (пристройка) является собственностью совладельца, который ее сделал, и не изменяет размера долей совладельцев в праве общей долевой собственности.
5. Улучшение общего имущества, которое можно отделить, является собственностью того из совладельцев, который их сделал, если другое не установлено договоренностью совладельцев.

Статья 358. Осуществление права общей долевой собственности
1. Право общей долевой собственности осуществляется совладельцами с их согласия.
2. Совладельцы могут договориться о порядке владения и пользования имуществом, которое является их общей долевой собственностью.
3. Каждый из совладельцев имеет право на предоставление ему во владение и пользование той части общего имущества в натуре, которая отвечает его доле в праве общей долевой собственности. В случае невозможности этого он имеет право требовать от других совладельцев, которые владеют и пользуются общим имуществом, соответствующей материальной компенсации.
4. Если договор между совладельцами о порядке владения и пользование общим имуществом соответственно их долям в праве общей частичной собственности удостоверенный нотариально, он является обязательным и для лица, которое приобретет впоследствии долю в праве общей долевой собственности на это имущество.

Статья 359. Плоды, продукция и доходы от использования имущества, которое является общей долевой собственности
1. Плоды, продукция и доходы от использования имущества, которое находится в общей долевой собственности, поступают в состав общего имущества и распределяются между совладельцами соответственно их долям в праве общей долевой собственности, если другое не установлено договоренностью между ними.

Статья 360. Удержание имущества, которое находится в общей долевой собственности
1. Совладелец соответственно своей доле в праве общей долевой собственности обязан принимать участие в затратах на управление, удержание и сохранение общего имущества, в уплате налогов, сборах (обязательных платежей), а также нести ответственность перед третьими лицами по обязательствам, связанными с общим имуществом.

Статья 361. Право совладельца распорядиться своей долей в праве общей долевой собственности
1. Совладелец имеет право самостоятельно распорядиться своей долей в праве общей долевой собственности.

Статья 362. Преобладающее право покупки доли в праве общей долевой собственности
1. В случае продажи доли в праве общей долевой собственности совладелец имеет преобладающее право перед другими лицами на ее покупку по цене, объявленной для продажи, и на других равных условиях, кроме случая продажи с публичных торгов.
2. Продавец доли в праве общей долевой собственности обязан письменно сообщить другим совладельцам о намерении продать свою долю, указав цену и прочие условия, при которых он ее продает.
Если другие совладельцы отказались от осуществления преобладающего права покупки или не осуществят этого права относительно недвижимого имущества на протяжении одного месяца, а относительно движимого имущества - на протяжении десяти дней со дня получения ими сообщения, продавец имеет право продать свою долю другому лицу.
3. Если желание приобрести долю в праве общей частичной собственности обнаружили несколько совладельцев, продавец имеет право выбора покупателя.
4. В случае продажи доли в праве общей долевой собственности с нарушением преобладающего права покупки совладелец может предъявить в суд иск о переводе на него прав и обязанностей покупателя. Одновременно истец обязан внести на депозитный счет суда денежную сумму, которую по договору должен уплатить покупатель.
К таким требованиям применяется исковая давность в один год.
5. Передача совладельцем своего преобладающего права покупки доли в праве общей долевой собственности другому лицу не допускается.

Статья 363. Момент перехода доли в праве общей долевой собственности к приобретателю по договору
1. Доля в праве общей долевой собственности переходит к приобретателю по договору с момента заключения договора, если другое не установлено договоренностью сторон.
2. Доля в праве общей долевой собственности по договору, который подлежит нотариальному удостоверению и (или) государственной регистрации, переходит к приобретателю соответственно статье 334 Гражданского кодекса Украины.

Статья 364. Выделение доли из имущества, находящегося в общей долевой собственности
1. Совладелец имеет право на выделение в натуре доли из имущества, находящегося в общей долевой собственности.
2. Если выделение в натуре доли из общего имущества не допускается согласно закону или является невозможным (часть 2 статьи 183 Гражданского кодекса Украины), совладелец, который желает выдела, имеет право на получение от других совладельцев денежной или другой материальной компенсации стоимости его доли.
Компенсация совладельцу может быть предоставлена лишь за его согласием.
3. Договор о выделе в натуре доли из недвижимого общего имущества составляется в письменной форме и подлежит нотариальному удостоверению.

Статья 365. Прекращение права на часть в общем имуществе по требованию других совладельцев
1. Право лица на долю в общем имуществе может быть прекращено по решению суда на основании иска других совладельцев, если:
доля является незначительной и не может быть выделена в натуре;
вещь является неделимой;
общее владение и пользование имуществом является невозможным;
такое прекращение не причинит существенного ущерба интересам совладельца и членам его семьи.
2. Суд постановляет решение о прекращении права лица на долю в общем имуществе при условии предшествующего внесения истцом стоимости этой частицы на депозитный счет суда.

Статья 366. Обращение взыскания на долю в имуществе, находящегося в общей долевой собственности
1. Кредитор совладельца имущества, находящегося в общей долевой собственности, в случае недостаточности у него другого имущества, на которое может быть обращено взыскание, может предъявить иск о выделе доли из общего имущества в натуре для обращения взыскания на нее.
Если выдел в натуре доли из общего имущества повлечет изменение его назначения или против этого возражают другие совладельцы, спор решается в суде.
2. В случае невозможности выдела в натуре доли из общего имущества или возражения других совладельцев против такого выделения кредитор имеет право требовать продажи должником своей доли в праве общей долевой собственности с направлением суммы выручки на погашение долга.
В случае отказа должника от продажи своей доли в праве общей долевой собственности или отказа других совладельцев от приобретения доли должника кредитор имеет право требовать продажи этой доли с публичных торгов или перевода на него прав и обязанностей совладельца-должника, с проведением соответствующего перерасчета.

Статья 367. Раздел имущества, находящегося в общей долевой собственности
1. Имущество, находящееся в общей долевой собственности, может быть разделено в натуре между совладельцами по договоренности между ними.
2. В случае деления общего имущества между совладельцами право общей долевой собственности на него прекращается.
3. Договор о делении недвижимого имущества, находящегося в общей долевой собственности, составляется в письменной форме и подлежит нотариальному удостоверению.

Статья 368. Право общей совместной собственности
1. Общая собственность двух или больше лиц без определения долей любого из них в праве собственности является общей совместной собственностью.
2. Субъектами права общей совместной собственности могут быть физические лица, юридические лица, а также государство, территориальные общины, если другое не установлено законом.
3. Имущество, приобретенное супругами за время брака, является их общей совместной собственностью, если другое не установлено договором или законом.
4. Имущество, приобретенное в результате общей работы и за общие денежные средства членов семьи, является их общей совместной собственностью, если другое не установлено договором, заключенным в письменной форме.

Статья 369. Осуществление права общей совместной собственности
1. Совладельцы имущества, находящегося в общей совместной собственности, владеют и пользуются им совместно, если другое не установлено договоренностью между ними.
2. Распоряжение имуществом, находящимся в общей совместной собственности, осуществляется по согласию всех совладельцев.
В случае совершения одним из совладельцев сделки относительно распоряжения общим имуществом считается, что она совершена по согласию всех совладельцев.
Согласие совладельцев на совершение сделки относительно распоряжения общим имуществом, которое подлежит нотариальному удостоверению и (или) государственной регистрации, может быть выражено письменно и нотариально удостоверено.
3. Совладельцы имеют право уполномочить одного из них на совершение сделок относительно распоряжения общим имуществом.
4. Сделки относительно распоряжения общим имуществом, совершенные одним из совладельцев, могут быть признаны судом недействительным по иску другого совладельца в случае отсутствия у совладельца, совершившего сделку, необходимых полномочий.

Статья 370. Выделение доли из имущества, находящегося в общей совместной собственности
1. Совладельцы имеют право на выделение в натуре доли из имущества, находящегося в общей совместной собственности.
2. В случае выдела доли из имущества, находящегося в общей совместной собственности, считается, что доли любого из совладельцев в праве общей совместной собственности являются равными, если другое не установлено договоренностью между ними, законом или решением суда.
3. Выделение доли из имущества, находящегося в общей совместной собственности, осуществляется в порядке, установленном статьей 364 Гражданского кодекса Украины.

Статья 371. Обращение взыскания на часть имущества, находящегося в общей совместной собственности
1. Кредитор совладельца имущества, находящегося в общей совместной собственности, в случае недостаточности у него другого имущества, на которое может быть обращено взыскание, может предъявить иск о выделении доли из общего имущества в натуре для обращения взыскания на нее.
2. Выделение доли из имущества, находящегося в общей совместной собственности, для обращения взыскания на нее осуществляется в порядке, установленном статьей 366 Гражданского кодекса Украины.

Статья 372. Раздел имущества, находящегося в общей совместной собственности
1. Имущество, находящееся в общей совместной собственности, может быть разделено между совладельцами по договоренности между ними.
2. В случае деления имущества, находящегося в общей совместной собственности, считается, что доли совладельцев в праве общей совместной собственности являются равными, если другое не установлено договоренностью между ними или законом.
По решению суда доля совладельца может быть увеличена или уменьшена с учетом обстоятельств, которые имеют важное значение.
3. В случае деления имущества между совладельцами право общей совместной собственности на него прекращается.
4. Договор о делении недвижимого имущества, находящегося в общей совместной собственности, составляется в письменной форме и подлежит нотариальному удостоверению.
"""
GKU_g_27 = """ 
Глава 27 - Гражданского кодекса
Право собственности на землю (земельный участок)

Статья 373. Земля (земельный участок) как объект права собственности
1. Земля является ценным национальным богатством, которое находится под особой охраной государства.
2. Право собственности на землю гарантируется Конституцией Украины. Право собственности на землю (земельный участок) приобретается и осуществляется соответственно закону.
3. Право собственности на земельный участок распространяется на поверхностный (грунтовый) пласт в границах этого участка, на водные объекты, леса, многолетние насаждения, которые на ней находятся, а также на пространство, находящееся над и под поверхностью участка, высотой и глубиной, необходимой для возведения жилых, производственных и других зданий и сооружений.
4. Собственник земельного участка имеет право использовать его на свое усмотрение соответственно его целевому назначению.
5. Собственник земельного участка может использовать на свое усмотрение все, что находится над и под поверхностью этого участка, если другое не установлено законом и если это не нарушает прав других лиц.

Статья 374. Субъекты права собственности на землю (земельный участок)
1. Субъектами права собственности на землю (земельный участок) являются физические лица, юридические лица, государство, территориальные общины.
2. Иностранцы, лица без гражданства могут приобретать право собственности на землю (земельные участки) соответственно закону.
3. Иностранные юридические лица, иностранные государства и международные организации могут быть субъектами права собственности на землю (земельный участок) в случаях, установленных законом.
4. Права и обязанности субъектов права собственности на землю (земельный участок) устанавливаются законом.

Статья 375. Право собственника на застройку земельного участка
1. Собственник земельного участка имеет право сооружать на нем здания и сооружения, создавать закрытые водоемы, осуществлять перестройку, а также разрешать строительство на своем участке другим лицам.
2. Собственник земельного участка приобретает право собственности на возведенные им здания, сооружения и прочее недвижимое имущество.
3. Право собственника на застройку осуществляется им при условии соблюдения архитектурных, строительных, санитарных, экологических и других норм и правил, а также при условии использования земельного участка по его целевому назначению.
4. Правовые последствия самовольной застройки, осуществленной собственником на его земельном участке, устанавливаются статьей 376 Гражданского кодекса Украины.

Статья 376. Самодеятельное строительство
1. Жилой дом, здание, сооружение, другое недвижимое имущество считаются самовольным строительством, если они построены или строятся на земельном участке, не отведенном для этой цели, или без соответствующего документа, который дает право выполнять строительные работы или надлежаще утвержденного проекта, или существенными нарушениями строительных норм и правил.
2. Лицо, которое осуществило или осуществляет самовольное строительство недвижимого имущества, не приобретает право собственности на него.
3. Право собственности на самовольно построенное недвижимое имущество может быть по решению суда признано за лицом, которое осуществило самовольное строительство на земельном участке, который не был ей отведен для этой цели, при условии предоставления земельного участка в установленном порядке лицу под уже построенное недвижимое имущество.
4. Если собственник (пользователь) земельного участка возражает против признания права собственности на недвижимое имущество за лицом, осуществившем (осуществляющим) самовольное строительство на его земельном участке, или если это нарушает права других лиц, имущество подлежит сносу лицом, которое осуществило (осуществляет) самовольное строительство, или за его счет.
5. По требованию собственника (пользователя) земельного участка суд может признать за ним право собственности на недвижимое имущество, которое самовольно построено на нем, если это не нарушает права других лиц.
6. Лицо, которое осуществило самовольное строительство, имеет право на возмещение затрат на строительство, если право собственности на недвижимое имущество признано за собственником (пользователем) земельного участка, на котором оно размещено.
7. В случае важного отклонения от проекта, который противоречит общественным интересам или нарушает права других лиц, важного нарушения строительных норм и правил суд за иском соответствующего органа государственной власти или органа местного самоуправления может постановить решение, вменяющее в обязанность лицо, которое осуществило (осуществляет) строительство, провести соответствующую перестройку.
Если проведение такой перестройки является невозможным или лицо, которое осуществило (осуществляет) строительство, отказывается от ее проведения, такое недвижимое имущество по решению суда подлежит сносу за счет лица, которое осуществило (осуществляет) строительство. Лицо, которое осуществило (осуществляет) самовольное строительство, обязано возместить затраты, связанные с приведением земельного участка к предыдущему состоянию.

Статья 377. Право на земельный участок при приобретении жилого дома, здания или сооружения, которые размещенные на нем
1. К лицу, которое приобрело право собственности на жилой дом (кроме многоквартирного), здание или сооружение, переходит право собственности, право пользования на земельный участок, на котором они размещены, без изменения его целевого назначения в объеме и на  условиях, установленных для предварительного землевладельца (землепользователя).
2. Размер и кадастровый номер земельного участка, право на который переходит в связи с переходом права собственности на жилой дом, здание или сооружение, являются существенными условиями договора, предусматривающего приобретение права собственности на эти объекты (кроме многоквартирных домов и объектов государственной собственности, подлежащих продаже путем приватизации).

Статья 378. Прекращение права собственности на земельный участок
1. Право собственности лица на земельный участок может быть прекращено по решению суда в случаях, установленных законом.
"""
GKU_g_28 = """ 
Глава 28 - Гражданского кодекса
Право собственности на жилье

Статья 379. Понятие жилья
1. Жильем физического лица является жилой дом, квартира, другое жилое помещение, предназначенные и пригодные для постоянного или временного проживания в них.

Статья 380. Жилой дом как объект права собственности
1. Жилым домом является здание капитального типа, сооруженное с соблюдением требований, установленных законом, другими нормативно-правовыми актами, и предназначенное для постоянного в нем проживания.

Статья 381. Усадьба как объект права собственности
1. Усадьбой является земельный участок вместе с расположенными на нем жилым домом, хозяйственно-бытовыми зданиями, наземными и подземными коммуникациями, многолетними насаждениями.
2. В случае отчуждения жилого дома считается, что отчуждается вся усадьба, если другое не установлено договором или законом.

Статья 382. Квартира как объект права собственности
1. Квартирой является изолированное помещение в жилом доме, предназначенное и пригодное для постоянного в нем проживания.
2. Собственникам квартиры в двух- или многоквартирном жилом доме принадлежат на праве общей совместной собственности помещения общего пользования, опорные конструкции дома, механическое, электрическое, сантехничное и прочие оснащения за пределами или внутри квартиры, которое обслуживает большее одной квартиры, а также сооружения, здания, которые предназначенные для обеспечения потребностей всех собственников квартир, а также собственников нежилых помещений, которые расположены в жилом доме.

Статья 383. Права собственника жилого дома, квартиры
1. Собственник жилого дома, квартиры имеет право использовать помещение для собственного проживания, проживания членов своей семьи, других лиц и не имеет права использовать его для промышленного производства.
2. Собственник квартиры может на свое усмотрение осуществлять ремонт и изменения в квартире, предоставленной ему для использования как единого целого, - при условии, что эти изменения не приведут к нарушениям прав собственников других квартир в многоквартирном жилом доме и не нарушат санитарно-технических требований и правил эксплуатации дома.

Статья 384. Права жилищно-строительного (жилого) кооператива и их членов на квартиру в дома кооператива
1. Дом, сооруженный или приобретенный жилищно-строительным (жилым) кооперативом, является его собственностью.
2. Член жилищно-строительного (жилого) кооператива имеет право владения и пользования, а по согласию кооператива - и распоряжения квартирой, которую он занимает в доме кооператива, если он не выкупил ее.
3. В случае выкупа квартиры член жилищно-строительного (жилого) кооператива становится ее собственником.

Статья 385. Объединение собственников жилых домов, квартир
1. Собственники квартир для обеспечения эксплуатации многоквартирного жилого дома, пользования квартирами и общим имуществом жилого дома могут создавать объединение собственников квартир (жилья).
Такое объединение может быть создано также собственниками жилых домов.

2. Объединение собственников квартир, жилых домов является юридическим лицом, которое создается и действует соответственно уставу и закону.
"""
GKU_g_29 = """ 
Глава 29 - Гражданского кодекса
Защита права собственности

Статья 386. Основы защиты права собственности
1. Государство обеспечивает равную защиту прав всех субъектов права собственности.
2. Собственник, имеющий основания предусматривать возможность нарушения своего права собственности другим лицом, может обратиться в суд с требованием о запрете совершения им действий, которые могут нарушить его право, или с требованием о совершении определенных действий для предотвращения такого нарушения.
3. Собственник, права которого нарушены, имеет право на возмещение причиненного ему имущественного и морального вреда.

Статья 387. Право собственника на истребование имущества из чужого незаконного владения
1. Собственник имеет право истребовать свое имущество от лица, которое незаконно, без соответствующего правового основания завладело им.

Статья 388. Право собственника на истребование имущества от добросовестного приобретателя
1. Если имущество по возмездному договору приобретено у лица, не имевшего права его отчуждать, о чем приобретатель не знал и не мог знать (добросовестный приобретатель), собственник имеет право истребовать это имущество от приобретателя лишь в случае, если имущество:
было утеряно собственником или лицом, которому он передал имущество во владение;
было похищено у собственника или лица, которому он передал имущество во владение;
выбыло из владения собственника или лица, которому он передал имущество во владение, не по их воле, иным путем.
2. Имущество не может быть истребовано у добросовестного приобретателя, если оно было продано в порядке, установленном для выполнения судебных решений.
3. Если имущество было приобретено безоплатно у лица, которое не имело права его отчуждать, собственник имеет право истребовать его у добросовестного приобретателя во всех случаях.

Статья 389. Истребование денег и ценных бумаг
1. Деньги, а также ценные бумаги на предъявителя, которые существуют в документарной форме, не могут быть истребованы от добросовестного приобретателя.

Статья 390. Расчеты при истребовании имущества из чужого незаконного владения
1. Собственник имущества имеет право требовать от лица, которое знало или могло знать, что он владеет имуществом незаконно (недобросовестного приобретателя), передача всех доходов от имущества, которые оно получило или могло получить за все время владения им.
2. Собственник имущества имеет право требовать от добросовестного приобретателя передачи всех доходов от имущества, которые он получил или мог получить с момента, когда узнал ли мог узнать о незаконности владения им, или с момента, когда ему была вручена повестка в суд в деле по иску собственника об истребовании имущества.
3. Добросовестный или недобросовестный приобретатель (владелец) имеет право требовать от собственника имущества возмещения необходимых затрат на содержание, сохранение имущества, осуществленных им со времени, с которого собственнику принадлежит право на возврат имущества или передачу доходов.
4. Добросовестный приобретатель (владелец) имеет право оставить себе осуществленные им улучшения имущества, если они могут быть отделены от имущества без причинения ему вреда. Если улучшения не могут быть отделены от имущества, добросовестный приобретатель (владелец) имеет право на возмещение осуществленных затрат в сумме, на которую увеличилась его стоимость.

Статья 391. Защита права собственности от нарушений, не связанных с лишением владения
1. Собственник имущества имеет право требовать устранения препятствий в осуществлении им права пользования и распоряжения своим имуществом.

Статья 392. Признание права собственности
1. Собственник имущества может предъявить иск о признании его права собственности, если это право оспаривается или не признается другим лицом, а также в случае утраты им документа, который удостоверяет его право собственности.

Статья 393. Признание незаконным правового акта, который нарушает право собственности
1. Правовой акт органа государственной власти, органа власти Автономной Республики Крым или органа местного самоуправления, не соответствующего закону и нарушает права собственника, по иску собственника имущества признается судом незаконным и отменяется.
2. Если иное не установлено законом, собственник имущества, права которого нарушены вследствие издания правового акта органом государственной власти, органом власти Автономной Республики Крым или органом местного самоуправления, вправе требовать восстановления того положения, существовавшего до издания этого акта. В случае невозможности восстановления прежнего положения собственник имеет право на возмещение имущественного и морального вреда.

Статья 394. Возмещение вреда, причиненного собственнику земельного участка, жилого дома, других зданий в связи со снижением их ценности
1. Собственник земельного участка, жилого дома, других зданий имеет право на компенсацию в связи со снижением ценности этих объектов в результате деятельности, которая привела к снижению уровня экологической, шумовой защищенности территории, ухудшению естественных свойств земли
"""
GKU_g_30 = """ 
Раздел II - Вещные права на чужое имущество
Глава 30 - Гражданского кодекса

Общие положения о вещных правах на чужое имущество

Статья 395. Виды вещных прав на чужое имущество
1. Вещными правами на чужое имущество являются:
право владения;
право пользования (сервитут);
право пользования земельным участком для сельскохозяйственных потребностей (емфитевзис);
право застройки земельного участка (суперфиций).
2. Законом могут быть установлены другие вещные права на чужое имущество.

Статья 396. Защита вещных прав на чужое имущество
1. Лицо, которое имеет вещное право на чужое имущество, имеет право на защиту этого права, в том числе и от собственника имущества, соответственно положениям главы 29 Гражданского кодекса Украины.
"""
GKU_g_31 = """ 
Глава 31 - Гражданского кодекса
Право владения чужим имуществом

Статья 397. Субъекты права владения чужим имуществом
1. Владельцем чужого имущества является лицо, которое фактически держит его у себя.
2. Право владения чужим имуществом может принадлежать одновременно двум или более лицам.
3. Фактическое владение имуществом считается правомерным, если другое не вытекает из закона или не установлено решением суда.

Статья 398. Возникновение права владения
1. Право владения возникает на основании договора с собственником или лицом, которому имущество было передано собственником, а также на других основаниях, установленных законом.

Статья 399. Прекращение права владения
1. Право владения прекращается в случае:
отказа владельца от владения имуществом;
истребование имущества от владельца собственником имущества или другим лицом;
уничтожения имущества.
2. Право владения прекращается также в других случаях, установленных законом.

Статья 400. Обязанность недобросовестного владельца немедленно возвратить имущество лицу, которое имеет на него право собственности или другое право или которое является добросовестным владельцем
1. Недобросовестный владелец обязан немедленно возвратить имущество лицу, которое имеет на него право собственности или другое право соответственно договору или закону, или которое является добросовестным владельцем этого имущества. В случае невыполнения недобросовестным владельцем этой обязанности заинтересованное лицо имеет право предъявить иск об истребовании этого имущества.
"""
GKU_g_32 = """ 
Глава 32 - Гражданского кодекса
Право пользования чужим имуществом

Статья 401. Понятие пользования чужим имуществом
1. Право пользования чужим имуществом (сервитут) может быть установлено относительно земельного участка, других естественных ресурсов (земельный сервитут) или другого недвижимого имущества для удовлетворения потребностей других лиц, которые не могут быть удовлетворены другим способом.
2. Сервитут может принадлежать собственнику (владельцу) соседнего земельного участка, а также другому, конкретно определенному лицу (личный сервитут).

Статья 402. Установление сервитута
1. Сервитут может быть установлен договором, законом, завещанием или решением суда.
2. Земельный сервитут может быть установлен договором между лицом, которое требует его установления, и собственником (владельцем) земельного участка.
Договор об установлении земельного сервитута подлежит государственной регистрации в порядке, установленном для государственной регистрации прав на недвижимое имущество.
3. В случае недостижения договоренности об установлении сервитута и про его условия спор решается судом по иску лица, которое требует установления сервитута.

Статья 403. Содержание сервитута
1. Сервитут определяет объем прав относительно пользования лицом чужим имуществом.
2. Сервитут может быть установлен на определенный срок или без определения срока.
3. Лицо, которое пользуется сервитутом, обязано вносить плату за пользование имуществом, если другое не установлено договором, законом, завещанием или решением суда.
4. Сервитут не подлежит отчуждению.
5. Сервитут не лишает собственника имущества, относительно которого он установлен, права владения, пользования и распоряжения этим имуществом.
6. Сервитут сохраняет действие в случае перехода к другим лицам права собственности на имущество, относительно которого он установлен.
7. Убытки, причиненные собственнику (владельцу) земельного участка или другого недвижимого имущества, лицом, которое пользуется сервитутом, подлежат возмещению на общих основаниях.

Статья 404. Право пользования чужим земельным участком или другим недвижимым имуществом
1. Право пользования чужим земельным участком или другим недвижимым имуществом состоит в возможности прохода, проезда через чужой земельный участок, прокладывании и эксплуатации линий электропередач, связи и трубопроводов, обеспечение водоснабжения, мелиорации и т.п..
2. Лицо имеет право требовать от собственника (владельца) соседнего земельного участка, а в случае необходимости - от собственника (владельца) другого земельного участка предоставления земельного сервитута.
3. Право пользования чужим имуществом может быть установлено относительно другого недвижимого имущества (здания, сооружения и т.п.).

Статья 405. Право членов семьи собственника жилья на пользование этим жильем
1. Члены семьи собственника жилья, которые проживают вместе с ним, имеют право на пользование этим жильем соответственно закону.
Жилое помещение, которое они имеют право занимать, определяется его собственником.
2. Член семьи собственника жилья теряет право на пользование этим жильем в случае отсутствия члена семьи без уважительных причин свыше одного года, если другое не установлено договоренностью между ним и собственником жилья или законом.

Статья 406. Прекращение сервитута
1. Сервитут прекращается в случае:
объединение в одном лице лица, в интересах которого установлен сервитут, и собственника имущества, отягощенного сервитутом;
отказа от него лица, в интересах которого установлен сервитут;
истечения срока, на который был установлен сервитут;
прекращения обстоятельства, которое было основанием для установления сервитута;
неиспользование сервитута на протяжении трех лет подряд;
смерти лица, в пользу которого был установлен личный сервитут.
2. Сервитут может быть прекращен по решению суда по требованию собственника имущества при наличии обстоятельств, которые имеют важное значение.
3. Собственник земельного участка имеет право требовать прекращения сервитута, если он препятствует использованию этого земельного участка по его целевому назначению.
4. Сервитут может быть прекращен в других случаях, установленных законом.
"""
GKU_g_33 = """ 
Глава 33 - Гражданского кодекса
Право пользования чужим земельным участком для сельскохозяйственных потребностей

Статья 407. Основания возникновения права пользования чужим земельным участком для сельскохозяйственных потребностей
1. Право пользования чужим земельным участком устанавливается договором между собственником земельного участка и лицом, обнаружила желание пользоваться этим земельным участком для сельскохозяйственных нужд (далее - землепользователь).
2. Право пользования чужим земельным участком для сельскохозяйственных нужд (эмфитевзис) может отчуждаться и передаваться в порядке наследования, за исключением случаев, предусмотренных частью третьей настоящей статьи.
3. Право пользования земельным участком государственной или коммунальной собственности для сельскохозяйственных потребностей не может быть отчуждено ее землепользователем другим лицам, внесено в уставный фонд, передано в залог.

Статья 408. Срок договора о предоставлении права пользования чужим земельным участком для сельскохозяйственных потребностей
1. Срок договора о предоставлении права пользования чужим земельным участком для сельскохозяйственных нужд устанавливается договором и для земельных участков государственной или коммунальной собственности не может превышать 50 лет.
2. Если договор о предоставлении права пользование чужим земельным участком для сельскохозяйственных потребностей заключен на неопределенный срок, любая из сторон может отказаться от договора, предварительно предупредив об этом другую сторону не менее чем за один год.

Статья 409. Права и обязанности собственника земельного участка, предоставленного в пользование для сельскохозяйственных потребностей
1. Собственник земельного участка имеет право требовать от землепользователя использования его по назначению, установленному в договоре.
2. Собственник земельного участка имеет право на получение платы за пользование им. Размер платы, ее форма, условия, порядок и сроки его выплаты устанавливаются договором.
3. Собственник земельного участка обязан не препятствовать землепользователю в осуществлении его прав.

Статья 410. Права и обязанности землепользователя
1. Землепользователь имеет право пользоваться земельным участком в полном объеме, соответственно договору.
2. Землепользователь обязан вносить плату за пользование земельным участком, а также другие платежи, установленные законом.
3. Землепользователь обязан эффективно использовать земельный участок соответственно его целевому назначению, повышать его плодородие, применять природоохранные технологии производства, воздерживаться от действий, которые могут привести к ухудшению экологической ситуации.

Статья 411. Право землепользователя на отчуждение права пользования земельным участком
1. Землепользователь имеет право на отчуждение права пользования земельным участком для сельскохозяйственных потребностей, если другое не установлено законом.
2. В случае продажи права пользования земельным участком собственник этого земельного участка имеет преобладающее перед другими лицами право на его приобретение, по цене, объявленной для продажи, и на других равных условиях.
3. Землепользователь обязан письменно сообщить собственнику земельного участка о продаже права пользование им. Если на протяжении одного месяца собственник не пришлет письменного согласия на покупку, право пользования земельным участком может быть продано другому лицу.
4. В случае нарушения права преобладающей покупки наступают последствия, предусмотренные статьей 362 Гражданского кодекса Украины.
5. В случае продажи землепользователем права пользования земельным участком для сельскохозяйственных потребностей другому лицу собственник земельного участка имеет право на получение процентов от цены продажи (стоимости права), установленных договором.

Статья 412. Прекращение права пользования земельным участком для сельскохозяйственных потребностей
1. Право пользования земельным участком для сельскохозяйственных потребностей прекращается в случае:
объединения в одном лице собственника земельного участка и землепользователя;
истечения срока, на который было предоставлено право пользования;
выкупа земельного участка в связи с общественной необходимостью.
2. Право пользования земельным участком для сельскохозяйственных потребностей может быть прекращено по решению суда и в других случаях, установленных законом.
"""
GKU_g_34 = """ 
Глава 34 - Гражданского кодекса
Право пользования чужим земельным участком для застройки

Статья 413. Основания возникновения права пользования чужим земельным участком для застройки
1. Собственник земельного участка имеет право предоставить его в пользование другому лицу для строительства промышленных, бытовых, социально-культурных, жилых и других сооружений и зданий (Суперфиций). Такое право возникает на основании договора или завещания.
2. Право пользования земельным участком, предоставленным для застройки, может отчуждаться или передаваться землепользователем в порядке наследования, за исключением случаев, предусмотренных частью третьей настоящей статьи.
3. Право пользования земельным участком государственной или коммунальной собственности для застройки не может быть отчуждено ее землепользователем другим лицам (кроме случаев перехода права собственности на здания и сооружения, расположенные на таком земельном участке), внесены в уставный фонд, передано в залог.
4. Право пользования чужим земельным участком для застройки может быть установлено на определенный или на неопределенный срок, кроме случаев, предусмотренных частью пятой настоящей статьи.
5. Срок пользования земельным участком государственной или коммунальной собственности для застройки не может превышать 50 лет.

Статья 414. Права и обязанности собственника земельного участка, предоставленного для застройки
Собственник земельного участка, предоставленного для застройки, имеет право на получение платы за пользование им.
Если на земельном участке построены промышленные объекты, договором может быть предусмотрено право собственника земельного участка на получение доли от дохода землепользователя.
2. Собственник земельного участка имеет право владеть, пользоваться им в объеме, установленном договором с землепользователем.
Переход права собственности на земельный участок к другому лицу не влияет на объем права собственника здания (сооружения) относительно пользования земельным участком.

Статья 415. Права и обязанности землепользователя
1. Землепользователь имеет право пользоваться земельным участком в объеме, установленном договором.
2. Землепользователь имеет право собственности на здания (сооружения), сооруженные на земельном участке, переданном ему для застройки.
3. Лицо, к которому перешло право собственности на здания (сооружения), приобретает право пользования земельным участком на тех же условиях и в том же объеме, что и прежний собственник здания (сооружения).
4. Землепользователь обязан вносить плату за пользование земельным участком, предоставленным ему для застройки, а также другие платежи, установленные законом.
5. Землепользователь обязан использовать земельный участок соответственно его целевому назначению.

Статья 416. Прекращение права пользования земельным участком для застройки
1. Право пользования земельным участком для застройки прекращается в случае:
объединения в одном лице собственника земельного участка и землепользователя;
истечения у срока права пользование;
отказа землепользователя от права пользования;
неиспользование земельного участка для застройки на протяжении трех лет подряд.
2. Право пользования земельным участком для застройки может быть прекращено по решению суда в других случаях, установленных законом.

Статья 417. Правовые последствия прекращения права пользования земельным участком
1. В случае прекращения права пользования земельным участком, на которой было сооружено здание (сооружение), собственник земельного участка и собственник этого здания (сооружения) определяют правовые последствия такого прекращения.
В случае недостижения договоренности между ними собственник земельного участка вправе требовать от собственника здания (сооружения) ее снос и приведения земельного участка в состояние, в котором она был до предоставления его в пользование.
2. Если снос здания (сооружения), размещенного на земельном участке, запрещен законом (жилые дома, памятники культурного наследия и т.п.) или нецелесообразно в связи с явным превышением стоимости здания (сооружения) по сравнению со стоимостью земельного участка, суд может с учетом оснований прекращения права пользования земельным участком постановить решение о выкупе собственником здания (сооружения) земельного участка, на котором она размещена, или о выкупе собственником земельного участка здания (сооружения), или определить условия пользования земельным участком собственником здания (сооружения) на новый срок.
"""
GKU_g_35 = """ 
Книга четвертая - Право интеллектуальной собственности
Глава 35 - Общие положения о праве интеллектуальной собственности
Статья 418. Понятие права интеллектуальной собственности
1. Право интеллектуальной собственности - это право лица на результат интеллектуальной, творческой деятельности или на другой объект права интеллектуальной собственности, определенный Гражданским Кодексом и другим законом.
2. Право интеллектуальной собственности составляют личные неимущественные права интеллектуальной собственности и (или) имущественные права интеллектуальной собственности, содержание которых относительно определенных объектов права интеллектуальной собственности определяется Гражданским Кодексом и другим законом.
3. Право интеллектуальной собственности является незыблемым. Никто не может быть лишен права интеллектуальной собственности или ограничен в его осуществлении, кроме случаев, предусмотренных законом.

Статья 419. Соотношение права интеллектуальной собственности и права собственности
1. Право интеллектуальной собственности и право собственности на вещь не зависят одно от одного.
2. Переход права на объект права интеллектуальной собственности не означает перехода права собственности на вещь.
3. Переход права собственности на вещь не означает перехода права на объект права интеллектуальной собственности.

Статья 420. Объекты права интеллектуальной собственности
1. К объектам права интеллектуальной собственности, в частности, принадлежат:
литературные и художественные произведения;
компьютерные программы;
компиляции данных (базы данных);
исполнение;
фонограммы, видеограми, передачи (программы) организаций вещания;
научные открытия;
изобретения, полезные модели, промышленные образцы;
компоновки полупроводниковых изделий;
рационализаторские предложения;
сорта растений, породы животных;
коммерческие (фирменные) наименование, торговые марки (знаки для товаров и услуг), географические указания;
коммерческие тайны.

Статья 421. Субъекты права интеллектуальной собственности
1. Субъектами права интеллектуальной собственности являются: создатель (создатели) объекта права интеллектуальной собственности (автор, исполнитель, изобретатель и т.п.) и прочие лица, которым принадлежат личные неимущественные и (или) имущественные права интеллектуальной собственности в соответствии с этим Кодексом, другим законом или договором.

Статья 422. Основания возникновения (приобретения) права интеллектуальной собственности
1. Право интеллектуальной собственности возникает (приобретается) на основаниях, установленных этим Кодексом, другим законом или договором.

Статья 423. Личные неимущественные права интеллектуальной собственности
1. Личными неимущественными правами интеллектуальной собственности являются:
право на признание человека создателем (автором, исполнителем, изобретателем и т.п.) объекта права интеллектуальной собственности;
право препятствовать любому посягательству на право интеллектуальной собственности, способному нанести ущерб чести или репутации создателя объекта права интеллектуальной собственности;
другие личные неимущественные права интеллектуальной собственности, установленные законом.
2. Личные неимущественные права интеллектуальной собственности принадлежат создателю объекта права интеллектуальной собственности. В случаях, предусмотренных законом, личные неимущественные права интеллектуальной собственности могут принадлежать другим лицам.
3. Личные неимущественные права интеллектуальной собственности не зависят от имущественных прав интеллектуальной собственности.
4. Личные неимущественные права интеллектуальной собственности не могут отчуждаться (передаваться), за исключениями, установленными законом.

Статья 424. Имущественные права интеллектуальной собственности
1. Имущественными правами интеллектуальной собственности являются:
право на использование объекта права интеллектуальной собственности;
исключительное право разрешать использование объекта права интеллектуальной собственности;
исключительное право препятствовать неправомерному использованию объекта права интеллектуальной собственности, в том числе запрещать такое использование;
другие имущественные права интеллектуальной собственности, установленные законом.
2. Законом могут быть установлены исключения и ограничение в имущественных правах интеллектуальной собственности при условии, что такие ограничения и исключения не создают важных препятствий для нормальной реализации имущественных прав интеллектуальной собственности и осуществления законных интересов субъектов этих прав.
3. Имущественные права интеллектуальной собственности могут соответственно закону быть вкладом в уставной капитал юридического лица, предметом договора залога и других обязательств, а также использоваться в других гражданских отношениях.

Статья 425. Срок действия прав интеллектуальной собственности
1. Личные неимущественные права интеллектуальной собственности являются действующими бессрочно, если другое не установлено законом.
2. Имущественные права интеллектуальной собственности являются действующими на протяжении сроков, установленных Гражданским кодексом Украины, другим законом или договором.
3. Имущественные права интеллектуальной собственности могут быть прекращены досрочно в случаях, установленных Гражданским кодексом Украины, другим законом или договором.

Статья 426. Использование объекта права интеллектуальной собственности
1. Способы использования объекта права интеллектуальной собственности определяются Гражданским кодексом Украины и другим законом.
2. Лицо, которое имеет исключительное право разрешать использование объекта права интеллектуальной собственности, может использовать этот объект по собственному усмотрению, с соблюдением при этом прав других лиц.
3. Использование объекта права интеллектуальной собственности другим лицом осуществляется с разрешения лица, которое имеет исключительное право разрешать использование объекта права интеллектуальной собственности, кроме случаев правомерного использования без такого разрешения, предусмотренных этим Кодексом и другим законом.
4. Условия предоставления разрешения (выдачи лицензии) на использование объекта права интеллектуальной собственности могут быть определены лицензионным договором, который укладывается с соблюдением требований Гражданского кодекса Украины и другого закона.

Статья 427. Передача имущественных прав интеллектуальной собственности
1. Имущественные права интеллектуальной собственности могут быть переданы соответственно закону полностью или частично другому лицу.
2. Условия передачи имущественных прав интеллектуальной собственности могут быть определены договором, который составляются в соответствии с Гражданским кодексом Украины и другим законом.

Статья 428. Осуществление права интеллектуальной собственности, которое принадлежит нескольким лицам
1. Право интеллектуальной собственности, которое принадлежит нескольким лицам совместно, может осуществляться по договору между ними. В случае отсутствия такого договора право интеллектуальной собственности, которое принадлежит нескольким лицам, осуществляется совместно.

Статья 429. Права интеллектуальной собственности на объект, созданный в связи с выполнением трудового договора
1. Личные неимущественные права интеллектуальной собственности на объект, созданный в связи с выполнением трудового договора, принадлежат работнику, который создал этот объект. В случаях, предусмотренных законом, отдельные личные неимущественные права интеллектуальной собственности на такой объект могут принадлежать юридическому или физическому лицу, где или у которого работает работник.
2. Имущественные права интеллектуальной собственности на объект, созданный в связи с выполнением трудового договора, принадлежат работнику, который создал этот объект, и юридическому или физическому лицу, где или у которого он работает, совместно, если другое не установлено договором.
3. Особенности осуществления имущественных прав интеллектуальной собственности на объект, созданный в связи с выполнением трудового договора, могут быть установлены законом.

Статья 430. Права интеллектуальной собственности на объект, созданный по заказу
1. Личные неимущественные права интеллектуальной собственности на объект, созданный по заказу, прнадлежат создателю этого объекта.
В случаях, предусмотренных законом, отдельные личные неимущественные права интеллектуальной собственности на такой объект могут принадлежать заказчику.
2. Имущественные права интеллектуальной собственности на объект, созданный по заказу, принадлежат творцу этого объекта и заказчику совместно, если другое не установлено договором.

Статья 431. Следствия нарушения права интеллектуальной собственности
1. Нарушение права интеллектуальной собственности, в том числе непризнание этого права или посягательство на него, тянет за собою ответственность, установленную этим Кодексом, другим законом или договором.

Статья 432. Защита права интеллектуальной собственности судом
1. Каждое лицо имеет право обратиться в суд за защитой своего права интеллектуальной собственности в соответствии со статьей 16 настоящего Кодекса.
2. Суд в случаях и в порядке, установленных законом, может постановить решение, в частности, о:
применение неотложных мер по предотвращению нарушения права интеллектуальной собственности и сохранения соответствующих доказательств;
приостановления пропуска через таможенную границу Украины товаров, импорт или экспорт которых осуществляется с нарушением права интеллектуальной собственности;
изъятие из оборота товаров, изготовленных или введенных в гражданский оборот с нарушением права интеллектуальной собственности и уничтожения таких товаров;
изъятие из оборота материалов и орудий, которые использовались преимущественно для изготовления товаров с нарушением правообладателем или изъятия и уничтожения таких материалов и орудий;
применение разового денежного взыскания вместо возмещения убытков за неправомерное использование объекта права интеллектуальной собственности. Размер взыскания определяется соответствии с законом с учетом вины лица и других обстоятельств, имеющие существенное значение;
опубликование в средствах массовой информации сведений о нарушение права интеллектуальной собственности и содержании судебного решения относительно такого нарушения.
"""
GKU_g_36 = """ 
Глава 36 - Гражданского кодекса
Право интеллектуальной собственности на литературное, художественное и другое произведение (авторское право)

Статья 433. Объекты авторского права
1. Объектами авторского права являются произведения, а именно:
литературные и художественные произведения, в частности:
романы, поэмы, статьи и прочие письменные произведения; лекции, речи, проповеди и прочие устные произведения;
драматические, музыкально-драматические произведения, пантомимы,
хореографические, другие сценические произведения;
музыкальные произведения (с текстом или без текста);
аудиовизуальные произведения;
произведения живописи, архитектуры, скульптуры и графики;
фотографические произведения;
произведения прикладного искусства;
иллюстрации, карты, планы, эскизы и пластические произведения, которые касаются географии, топографии, архитектуры или науки;
переводы, адаптации, аранжировка и прочие переработки литературных или художественных произведений;
сборники произведений, если они по подбору или упорядочению их составных частей являются результатом интеллектуальной деятельности;
компьютерные программы;
компиляции данных (базы данных), если они по подбору или упорядочению их составных частей являются результатом интеллектуальной деятельности;
другие произведения.
2. Произведения являются объектами авторского права без выполнения любых формальностей относительно них и независимо от их завершенности, назначения, ценности и т.п., а также способа или формы их выражения.
3. Авторское право не распространяется на идеи, процессы, методы деятельности или математические концепции как таковые.
4. Компьютерные программы охраняются как литературные произведения.
5. Компиляции данных (базы данных) или другого материала охраняются как таковые. Эта охрана не распространяется на данные или материал как таковой и не нарушает авторское право на данные или материал, который является составляющей компиляции.

Статья 434. Произведения, которые не являются объектами авторского права
1. Не являются объектами авторского права:
акты органов государственной власти и органов местного самоуправления (законы, указы, постановления, решения и т.п.), а также их официальные переводы;
государственные символы Украины, дензнаки, эмблемы и т.п., утвержденные органами государственной власти;
сообщения о новостях дня или другие факты, которые имеют характер обычной пресс-информации;
другие произведения, установленные законом.

Статья 435. Субъекты авторского права
1. Первичным субъектом авторского права является автор произведения. Из-за отсутствия доказательств обратного автором произведения считается физическое лицо, указанное обычным способом как автор на оригинале или экземпляре произведения (презумпция авторства).
2. Субъектами авторского права являются также другие физические и юридические лица, которые приобрели права на произведение согласно договору или закону.

Статья 436. Соавторство
1. Авторское право на произведение, созданное в соавторстве, принадлежит соавторам совместно, независимо от того, составляет такое произведение одно неразрывное целое или состоит из частей, любая из которых может иметь еще и самостоятельное значение. Часть произведения, созданного в соавторстве, признается имющей самостоятельное значение, если она может быть использована независимо от других частей этого произведения.
2. Каждый из соавторов сохраняет свое авторское право на созданную им часть произведения, которое имеет самостоятельное значение.
3. Отношения между соавторами могут быть определены договором. В случае отсутствия такого договора авторское право на произведение осуществляется всеми соавторами совместно.

Статья 437. Возникновение авторского права
1. Авторское право возникает с момента создания произведения.
2. Лицо, которое имеет авторское право, для извещения о своих правах может использовать специальный знак, установленный законом.

Статья 438. Личные неимущественные права автора
1. Автору произведения принадлежат личные неимущественные права, установленные статьей 423 Гражданского кодекса Украины, а также право:
требовать указания своего имени в связи с использованием произведения, если это практически возможно;
запрещать указание своего имени в связи с использованием произведения;
избирать псевдоним в связи с использованием произведения;
на неприкосновенность произведения.

Статья 439. Обеспечение неприкосновенности произведения
1. Автор имеет право противодействовать любому извращению, искажению или другому изменению произведения или любому другому посягательству на произведение, которое может повредить чести и репутаци автора, а также сопровождению произведения без его согласия иллюстрациями, предисловиями, послесловиями, комментариями и т.п..
2. В случае смерти автора неприкосновенность произведения предохраняется лицом, уполномоченной на это автором. Из-за отсутствия такого полномочия неприкосновенность произведения охраняется наследниками автора, а также другими заинтересованными лицами.

Статья 440. Имущественные права интеллектуальной собственности на произведение
1. Имущественными правами интеллектуальной собственности на произведение являются:
право на использование произведения;
исключительное право разрешать использование произведения;
право препятствовать неправомерному использованию произведения, в том числе запрещать такое использование;
другие имущественные права интеллектуальной собственности, установленные законом.
2. Имущественные права на произведение принадлежат его автору, если другое не установлено договором или законом.

Статья 441. Использование произведения
1. Использованием произведения является его:
опубликование (выпуск в мир);
воспроизведение любым способом и в любой форме;
перевод;
переработка, адаптация, аранжировка и прочие подобные изменения;
включение составной частью в сборники, базы данных, антологии, энциклопедии и т.п.;
публичное исполнение;
продажа, передача в найм (аренду) и т.п.;
импорт его экземпляров, экземпляров его переводов, переработок и т.п..
2. Использованием произведения являются также другие действия, установленные законом.

Статья 442. Опубликование произведения (выпуск произведения в мир)
1. Произведение считается опубликованным (выпущенным в мир), если оно любым способом сообщено неопределенному кругу лиц, в том числе издано, публично исполнено, публично показано, передано по радио или телевидению, отображено в общедоступных электронных системах информации.
2. Произведение не может быть опубликовано, если оно нарушает права человека на тайну его личной и семейной жизни, наносит ущерб общественному порядку, здоровью и нравственности населения.
3. Никто не имеет права опубликовать произведение без согласия автора, кроме случаев, установленных Гражданским кодексом Украины и другим законом.
4. В случае смерти автора его правопреемники имеют право на опубликование произведения, если это не противоречит воли автора.

Статья 443. Использование произведения по согласию автора
1. Использование произведения осуществляется лишь по согласию автора, кроме случаев правомерного использования произведения без такого согласия, установленных Гражданским кодексом Украины и другим законом.

Статья 444. Случаи правомерного использования произведения без согласия автора
1. Произведение может быть свободно, без согласия автора и других лиц, и безвозмездно использовано любым лицом:
как цитата из правомерно опубликованного произведения или как иллюстрация в изданиях, радио- и телепередачах, фонограммах и видеограммах, предназначенных для обучения, при условии соблюдения обычаев, указания источника заимствования и имени автора, если оно указано в таком источнике, и в объеме, оправданном поставленной целью;
для воспроизведения в судебном и административном проведении в объеме, оправданном этой целью;
в других случаях, предусмотренных законом.
2. Лицо, которое использует произведение, обязано указать имя автора произведения и источник заимствования.

Статья 445. Право автора на оплату за использование его произведения
1. Автор имеет право на оплату за использование его произведения, если другое не установлено этим Кодексом и другим законом.

Статья 446. Срок действия имущественных прав интеллектуальной собственности на произведение
1. Срок действия имущественных прав интеллектуальной собственности на произведение истекает через семьдесят лет, которые отсчитываются с 1 января года, следующего за годом смерти автора или последнего из соавторов, который пережил других соавторов, кроме случаев, предусмотренных законом.

Статья 447. Правовые последствия окончания срока действия имущественных прав интеллектуальной собственности на произведение
1. После окончания срока действия имущественных прав интеллектуальной собственности на произведение оно может свободно и безвозмездно использоваться любым лицом, за исключениями, установленными законом.

Статья 448. Право автора на часть от суммы продажи оригинала произведения
1. Автор имеет неотчуждаемое право на получение денежной суммы в размере пяти процентов от суммы каждой продажи оригинала художественного произведения или оригинала рукописи литературного произведения, следующего за отчуждением оригинала, осуществленным автором. Указанная сумма платится продавцом оригинала произведения.
2. Право, установленное частью первой этой статьи, переходит к наследникам автора произведения и наследникам этих наследников и действует до истечения срока действия имущественных прав интеллектуальной собственности на произведение, установленных статьей 446 Гражданского кодекса Украины.
"""
GKU_g_37 = """ 
Глава 37 - Гражданского кодекса
Право интеллектуальной собственности на исполнение, фонограмму, видеограмму и программу (передачу), организацию вещания (сопредельные права)

Статья 449. Объекты смежных прав
1. Объектами смежных прав без выполнения каких-либо формальностей относительно этих объектов и независимо от их назначения, содержания, ценности и т.п., а также способа или формы их выражения являются:
исполнение;
фонограммы;
видеограммы;
программы (передачи) организаций вещания.

Статья 450. Субъекты смежных прав
1. Первичными субъектами смежных прав являются исполнитель, производитель фонограммы, производитель видеограммы, организация вещания. При отсутствии доказательств обратного исполнителем, производителем фонограммы, видеограммы, программы (передачи) организации вещания считается лицо, имя (наименование) которого указано соответственно в фонограмме, видеограмме, их экземплярах или на упаковке, а также во время передачи организации вещания.
2. Субъектами смежных прав являются также другие лица, которые приобрели такие права согласно договора или закона.

Статья 451. Возникновение смежных прав
1. Право интеллектуальной собственности на исполнение возникает с момента первого его осуществления.
2. Право интеллектуальной собственности на фонограмму или видеограмму возникает с момента ее изготовления.
3. Право интеллектуальной собственности на передачу (программу) организации вещания возникает с момента ее первого осуществления.
4. Лицо, которое имеет смежное право, для извещения о своих правах может использовать специальный знак, установленный законом.

Статья 452. Имущественные права интеллектуальной собственности на объект смежных прав
1. Имущественными правами интеллектуальной собственности на объект смежных прав являются:
право на использование объекта смежных прав;
исключительное право разрешать использование объекта смежных прав;
право препятствовать неправомерному использованию объекта смежных прав, в том числе запрещать такое использование;
другие имущественные права интеллектуальной собственности, установленные законом.
2. Имущественные права интеллектуальной собственности на объект смежных прав принадлежат соответственно исполнителю, производителю фонограммы, производителю видеограммы или организации вещания, если другое не установлено договором или законом.

Статья 453. Использование исполнения
1. Использованием исполнения является:
доведение исполнения до сведения публики во время его осуществления;
запись (фиксирование) исполнения во время его осуществления, если такая запись дает возможность восприятия, воспроизведения и передачи исполнения с помощью технических средств;
прямое или опосредствованное воспроизведение записи исполнение любым способом и в любой форме;
продажа и прочее отчуждение оригинала или экземпляра записи исполнения;
аренда оригинала или экземпляра записи исполнения;
обеспечение средствами связи возможности доступа любого лица к записанному исполнению из места и во время, избранных им.
2. Использованием исполнения является также другие действия, установленные законом.

Статья 454. Использование фонограммы, видеограммы
1. Использованием фонограммы, видеограммы является:
прямое или опосредствованное воспроизведения любым способом и в любой форме видеограммы, фонограммы;
продажа и прочее отчуждение оригинала или экземпляра фонограммы, видеограммы;
аренда оригинала или экземпляра фонограммы, видеограммы;
обеспечение средствами связи возможности доступа любого лица к фонограмме, видеограми из места и во время, избранных им.
2. Использованием фонограммы, видеограммы являются также другие действия, установленные законом.

Статья 455. Использование передачи (программы) организации вещания
1. Использованием передачи (программы) организации вещания является:
осуществление (трансляция, ретрансляция) передачи (программы) организации вещания;
Запись (фиксирование) передачи (программы) организации вещания, если такая запись дает возможность восприятия, воспроизведение и осуществление ее с помощью технических средств;
воспроизведение записи передачи (программы) организации вещания;
представление передачи (программы) организации вещания публике в месте, где установлена входная плата.
2. Использованием передачи (программы) организации вещания являются также другие действия, установленные законом.

Статья 456. Сроки действия смежных имущественных прав
1. Срок действия имущественных прав интеллектуальной собственности на исполнение истекает через пятьдесят лет, которые отсчитываются с 1 января года, следующего за годом осуществления первой записи исполнения, а из-за отсутствия такой записи - с 1 января года, следующего за годом осуществления исполнения.
2. Срок действия имущественных прав интеллектуальной собственности на фонограмму, видеограмму истекает через пятьдесят лет, которые отсчитываются с 1 января года, следующего за годом ее опубликования, а из-за отсутствия такого опубликования на протяжении пятидесяти лет с даты ее изготовления - с 1 января года, следующего за годом изготовления фонограммы, видеограммы.
3. Срок действия имущественных прав интеллектуальной собственности на передачу (программу) организации вещания истекает через пятьдесят лет, которые отсчитываются с 1 января года, следующего за годом ее первого осуществления.
4. Законом в отдельных случаях могут устанавливаться другие сроки действия смежных прав.
"""
GKU_g_38 = """ 
Глава 38 - Гражданского кодекса
Право интеллектуальной собственности на научное открытие

Статья 457. Понятие научного открытия
1. Научным открытием является установление неизвестных раньше, но объективно существующих закономерностей, свойств и явлений материального мира, которые вносят коренные изменения в уровень научного познания.

Статья 458. Право на научное открытие
1. Автор научного открытия имеет право присвоить научному открытию свое имя или специальное название.
2. Право на научное открытие удостоверяется дипломом и предохраняется в порядке, установленном законом.
"""
GKU_g_39 = """ 
Глава 39 - Гражданского кодекса
Право интеллектуальной собственности на изобретение, полезную модель, промышленный образец

Статья 459. Пригодность изобретения для приобретения права интеллектуальной собственности на него
1. Изобретение считается пригодным для обретения права интеллектуальной собственности на него, если оно, соответственно закону, является новым, имеет изобретательский уровень и пригодно для промышленного использования.
2. Объектом изобретения может быть продукт (устройство, вещество и т.п.) или процесс в любой сфере технологии.
3. Законом могут быть установлены продукты и процессы, которые не являются пригодными для обретения права интеллектуальной собственности на них соответственно этой статье.

Статья 460. Пригодность полезной модели для приобретения права интеллектуальной собственности на нее
1. Полезная модель считается пригодной для приобретения права интеллектуальной собственности на нее, если она, соответственно закону, является новой и пригодной для промышленного использования.
2. Объектом полезной модели может быть продукт (устройство, вещество и т.п.) или процесс в любой сфере технологии.
3. Законом могут быть установлены продукты и процессы, которые не являются пригодными для обретения права интеллектуальной собственности на них соответственно этой статье.

Статья 461. Пригодность промышленного образца для обретения права интеллектуальной собственности на него
1. Промышленный образец считается пригодным для обретения права интеллектуальной собственности на него, если он, соответственно закону, является новым.
2. Объектом промышленного образца могут быть форма, рисунок или раскрашивание или их объединение, которые определяют внешний вид промышленного изделия.

Статья 462. Засвидетельствование обретения права интеллектуальной собственности на изобретение, полезную модель, промышленный образец
1. Обретение права интеллектуальной собственности на изобретение, полезную модель, промышленный образец удостоверяется патентом.
2. Объем правовой охраны определяется формулой изобретения, полезной модели, совокупностью существенных признаков промышленного образца.
3. Условия и порядок выдачи патента устанавливаются законом.

Статья 463. Субъекты права интеллектуальной собственности на изобретение, полезную модель, промышленный образец
1. Субъектами права интеллектуальной собственности на изобретение, полезную модель и промышленный образец являются:
изобретатель, автор промышленного образца;
другие лица, которые приобрели права на изобретение, полезную модель и промышленный образец по договору или по закону.

Статья 464. Имущественные права интеллектуальной собственности на изобретение, полезную модель, промышленный образец
1. Имущественными правами интеллектуальной собственности на изобретение, полезную модель, промышленный образец являются:
право на использование изобретения, полезной модели, промышленного образца;
исключительное право разрешать использование изобретения, полезной модели, промышленного образца (выдавать лицензии);
исключительное право препятствовать неправомерному использованию изобретения, полезной модели, промышленного образца, в том числе запрещать такое использование;
другие имущественные права интеллектуальной собственности, установленные законом.
2. Имущественные права интеллектуальной собственности на изобретение, полезную модель, промышленный образец принадлежат владельцу соответствующего патента, если другое не установлено договором или законом.

Статья 465. Срок действия имущественных прав интеллектуальной собственности на изобретение, полезную модель, промышленный образец
1. Имущественные права интеллектуальной собственности на изобретение, полезную модель, промышленный образец действуют с даты, следующей за датой их государственной регистрации, при условии поддержания действия этих прав согласно закону.
2. Законом могут быть установлены условия временного действия имущественных прав интеллектуальной собственности на изобретение до вступления их в силу в соответствии с частью первой этой статьи.
3. Срок действия исключительных имущественных прав интеллектуальной собственности на изобретение истекает через двадцать лет, которые отсчитываются от даты представления заявки на изобретение в установленном законом порядке. Этот срок может быть продлен в установленном законом порядке относительно изобретения, использование которого требует специальных испытаний и официального разрешения.
4. Срок действия исключительных имущественных прав интеллектуальной собственности на полезную модель истекает через десять лет от даты представления заявки на полезную модель в установленном законом порядке.
5. Срок действия исключительных имущественных прав интеллектуальной собственности на промышленный образец истекает через пятнадцать лет от даты представления заявки на промышленный образец в установленном законом порядке.

Статья 466. Досрочное прекращение действия имущественных прав интеллектуальной собственности на изобретение, полезную модель, промышленный образец
1. Действие имущественных прав интеллектуальной собственности на изобретение, полезную модель, промышленный образец может быть прекращено досрочно за инициативой лица, которому они принадлежат, если это не противоречит условиям договора, а также в других случаях, предусмотренных законом.

Статья 467. Правовые последствия прекращения действия исключительных имущественных прав интеллектуальной собственности на изобретение, полезную модель, промышленный образец
1. В случае прекращения действия исключительных имущественных прав интеллектуальной собственности на изобретение, полезную модель, промышленный образец эти объекты могут свободно и безвозмездно использоваться любым лицом, за исключениями, установленными законом.
2. Если в связи с досрочным прекращением действия исключительных имущественных прав интеллектуальной собственности на изобретение, полезную модель, промышленный образец причинен ущерб лицу, которому было предоставлено разрешение на использование этих объектов, такой ущерб возмещается лицом, которое предоставило указанное разрешение, если другое не установлено договором или законом.

Статья 468. Восстановление действия досрочно прекращенных исключительных имущественных прав интеллектуальной собственности на изобретение, полезную модель, промышленный образец
1. Действие досрочно прекращенных исключительных имущественных прав интеллектуальной собственности на изобретение, полезную модель, промышленный образец может быть восстановлено в порядке, установленном законом, по заявлению лица, которому эти права принадлежали в момент их прекращения.

Статья 469. Признание прав интеллектуальной собственности на изобретение, полезную модель, промышленный образец недействительными
1. Права интеллектуальной собственности на изобретение, полезную модель, промышленный образец признаются недействительными на основаниях и в порядке, установленных законом.

Статья 470. Право предшествующего пользователя на изобретение, полезную модель, промышленный образец
1. Любое лицо, которое к дате представления заявки на изобретение, полезную модель, промышленный образец или, если был заявлен приоритет, к дате приоритета заявки в интересах своей деятельности добросовестно использовало изобретение, полезную модель, промышленный образец в Украине или осуществило значительную и серьезную подготовку для такого использования, имеет право на безвозмездное продолжение такого использования или применения, которое предполагалось указанной подготовкой (право предшествующего пользователя).
2. Право предшествующего пользователя может передаваться или переходить к другому лицу только вместе с предприятием или деловой практикой или с той частью предприятия или деловой практики, в которых было использовано изобретение, полезная модель, промышленный образец или осуществлена значительная и серьезная подготовка для такого использования.
"""
GKU_g_40 = """ 
Глава 40 - Гражданского кодекса
Право интеллектуальной собственности на компоновку полупроводниковых изделий

Статья 471. Пригодность компоновки полупроводникового изделия для приобретения права интеллектуальной собственности на него
1. Компоновка полупроводникового изделия считается пригодным для приобретения права интеллектуальной собственности на него, если оно является оригинальным.

Статья 472. Удостоверение приобретения права интеллектуальной собственности на компоновку полупроводникового изделия
1. Приобретение права интеллектуальной собственности на компоновку полупроводникового изделия удостоверяется свидетельством.
2. Объем правовой охраны компоновки полупроводникового изделия определяется совокупностью связанных изображений этой компоновки на материальном носителе.
3. Условия и порядок выдачи свидетельства устанавливаются законом.

Статья 473. Субъекты права интеллектуальной собственности на компоновку полупроводникового изделия
1. Субъектами права интеллектуальной собственности на компоновку полупроводникового изделия являются:
автор компоновки полупроводникового изделия;
другие лица, которые приобрели права на компоновку полупроводникового изделия по договору или закону.

Статья 474. Имущественные права интеллектуальной собственности на компоновку полупроводникового изделия
1. Имущественными правами интеллектуальной собственности на компоновку полупроводникового изделия являются:
право на использование компоновки полупроводникового изделия;
исключительное право разрешать использование компоновки полупроводникового изделия;
исключительное право препятствовать неправомерному использованию компоновки полупроводникового изделия, в том числе запрещать такое использование;
другие имущественные права интеллектуальной собственности, установленные законом.
2. Имущественные права интеллектуальной собственности на компоновку полупроводникового изделия принадлежат владельцу соответствующего свидетельства, если иное не установлено законом или договором.

Статья 475. Срок действия имущественных прав интеллектуальной собственности на компоновку полупроводникового изделия
1. Имущественные права интеллектуальной собственности на компоновку полупроводникового изделия действуют с даты, следующей за датой их государственной регистрации при условии поддержания действия этих прав в соответствии с законом.
2. Срок действия исключительных имущественных прав интеллектуальной собственности на компоновку полупроводникового изделия истекает через десять лет, которые отсчитываются от наиболее ранней из следующих дат:
окончания календарного года, в котором компоновки было впервые использовано на коммерческой основе любой точке мира;
окончания календарного года, в котором было подано надлежащим образом оформлена заявка на государственную регистрацию.

Статья 476. Досрочное прекращение действия имущественных прав интеллектуальной собственности на компоновку полупроводникового изделия
1. Действие имущественных прав интеллектуальной собственности на компоновку полупроводникового изделия может быть прекращено досрочно по инициативе лица, которому они принадлежат, если это не противоречит условиям договора, а также в других случаях, предусмотренных законом.

Статья 477. Правовые последствия истечения срока действия исключительных имущественных прав интеллектуальной собственности на компоновку полупроводникового изделия
1. В случае прекращения действия исключительных имущественных прав интеллектуальной собственности на компоновку полупроводникового изделия оно может свободно и безвозмездно использоваться любым лицом, за исключениями, установленными законом.
2. Если в связи с досрочным прекращением действия исключительных имущественных прав интеллектуальной собственности на компоновку полупроводникового изделия нанесен ущерб лицу, которому было предоставлено разрешение на его использование, такие убытки возмещаются лицом, которое предоставило указанное разрешение, если иное не установлено договором или законом.

Статья 478. Восстановление действия досрочно прекращенных исключительных имущественных прав интеллектуальной собственности на компоновку полупроводникового изделия
1. Действие досрочно прекращенных исключительных имущественных прав интеллектуальной собственности на компоновку полупроводникового изделия может быть восстановлено в порядке, установленном законом, по заявлению лица, которому эти права принадлежали в момент их прекращения.

Статья 479. Признание прав интеллектуальной собственности на компоновку полупроводникового изделия недействительными
1. Права интеллектуальной собственности на компоновку полупроводникового изделия признаются недействительными по основаниям и в порядке, установленных законом.

Статья 480. Право предыдущего пользователя на компоновку полупроводникового изделия
1. Любое лицо, которое до даты подачи заявки на компоновку полупроводникового изделия или, если был заявлен приоритет, до даты приоритета заявки в интересах своей деятельности добросовестно использовало компоновки полупроводникового изделия в Украине или осуществило значительную и серьезную подготовку для такого использования, имеет право на безвозмездное продолжение такого использования или использования, которое предполагалось указанной подготовкой (право предыдущего пользователя).
2. Право предыдущего пользователя может передаваться или переходить к другому лицу только вместе с предприятием или деловой практикой или с той частью предприятия или деловой практики, в которых были использованы компоновки полупроводникового изделия или осуществлена ​​значительная и серьезная подготовка для такого использования.
"""
GKU_g_41 = """ 
Глава 41 - Гражданского кодекса
Право интеллектуальной собственности на рационализаторское предложение

Статья 481. Понятие и объекты рационализаторского предложения
1. Рационализаторским предложением является признанное юридическим лицом предложение, которое содержит технологическое (техническое) или организационное решение в любой сфере деятельности.
2. Объектом рационализаторского предложения может быть материальный объект или процесс.

Статья 482. Объем правовой охраны рационализаторского предложения
1. Объем правовой охраны рационализаторского предложения определяется его описанием, а также чертежами, если они представлены.

Статья 483. Субъекты права интеллектуальной собственности на рационализаторское предложение
1. Субъектами права интеллектуальной собственности на рационализаторское предложение являются его автор и юридическое лицо, которому это предложение подано

Статья 484. Права субъектов права интеллектуальной собственности на рационализаторское предложение
1. Автор рационализаторского предложения имеет право на добросовестное поощрение от юридического лица, которому это предложение подано.
2. Юридическое лицо, которое признало предложение рационализаторским, имеет право на использование этого предложения в любом объеме.
"""
GKU_g_42 = """ 
Глава 42 - Гражданского кодекса
Право интеллектуальной собственности на сорт растений, породу животных

Статья 485. Виды прав интеллектуальной собственности на сорт растений, породу животных
1. Право интеллектуальной собственности на сорт растений, породу животных составляют:
личные неимущественные права интеллектуальной собственности на сорт растений, породу животных, удостоверенные государственной регистрацией;
имущественные права интеллектуальной собственности на сорт растений, породу животных, удостоверенные патентом;
имущественное право интеллектуальной собственности на распространение сорта растений, породы животных, удостоверенное государственной регистрацией.

Статья 486. Субъекты права интеллектуальной собственности на сорт растений, породу животных
1. Субъектами права интеллектуальной собственности на сорт растений, породу животных являются:
автор сорта растений, породы животных;
другие лица, которые приобрели имущественные права интеллектуальной собственности на сорт растений, породу животных по договору или закону.

Статья 487. Имущественные права интеллектуальной собственности на сорт растений, породу животных, удостоверенные патентом
1. Имущественными правами интеллектуальной собственности на сорт растений, породу животных, удостоверенными патентом, являются:
право на использование сорта растений, породы животных, пригодных для распространения в Украине;
исключительное право разрешать использование сорта растений, породы животных;
исключительное право препятствовать неправомерному использованию сорта растений, породы животных, в том числе запрещать такое использование;
другие имущественные права интеллектуальной собственности, установленные законом.
2. Имущественные права интеллектуальной собственности на сорт растений, породу животных принадлежат владельцу патента, если другое не установлено договором или законом.

Статья 488. Срок действия имущественных прав интеллектуальной собственности на сорт растений, породу животных
1. Имущественные права интеллектуальной собственности на сорт растений, породу животных, удостоверенные патентом, действуют с даты, следующей за датой их государственной регистрации, при условии поддержания действия этих прав соответственно закону.
2. Законом могут быть установлены условия временного действия имущественных прав интеллектуальной собственности на сорт растений, породу животных до вступления их в силу соответственно части первой этой статьи.
3. Срок действия исключительных имущественных прав интеллектуальной собственности на сорт растений, породу животных истекает через тридцать лет, а относительно деревьев и винограда - через тридцать пять лет, которые отсчитываются с 1 января года, следующего за годом государственной регистрации этих прав.
4. Действие исключительных имущественных прав интеллектуальной собственности на сорт растений, породу животных может быть прекращено досрочно или возобновлено в случаях и в порядке, установленных законом.
5. Право на распространение сорта растений, породы животных действует с даты, следующей за датой его государственной регистрации, и действует бессрочно при условии поддержания действия этого права соответственно закону.
6. Действие исключительных имущественных прав интеллектуальной собственности на сорт растений, породу животных может быть прекращено досрочно или возобновлено в случаях и в порядке, установленных законом.
"""
GKU_g_43 = """ 
Глава 43 - Гражданского кодекса
Право интеллектуальной собственности на коммерческое наименование

Статья 489. Правовая охрана коммерческого наименования
1. Правовая охрана предоставляется коммерческому наименованию, если оно дает возможность отличить одно лицо от других и не вводит в заблуждение потребителей относительно настоящей его деятельности.
2. Право интеллектуальной собственности на коммерческое наименование действует с момента первого использования этого наименования и охраняется без обязательного предоставления заявки на него или его регистрации и независимо от того, является ли коммерческое наименование частью торговой марки.
3. Ведомости о коммерческом наименовании могут вноситься в реестры, порядок ведения которых устанавливается законом.
4. Лица могут иметь одинаковые коммерческие наименования, если это не вводит в заблуждение потребителей относительно товаров, которые они вырабатывают и (или) реализовывают, и услуг, которые ими предоставляются.

Статья 490. Имущественные права интеллектуальной собственности на коммерческое наименование
1. Имущественными правами интеллектуальной собственности на коммерческое наименование являются:
право на использование коммерческого наименования;
право препятствовать другим лицам неправомерно использовать коммерческое наименование, в том числе запрещать такое использование;
другие имущественные права интеллектуальной собственности, установленные законом.
2. Имущественные права интеллектуальной собственности на коммерческое наименование передаются другому лицу лишь вместе с целостным имущественным комплексом лица, которому эти права принадлежат, или его соответствующей частью.

Статья 491. Прекращение действия имущественных прав интеллектуальной собственности на коммерческое наименование
1. Действие имущественных прав интеллектуальной собственности на коммерческое наименование прекращается в случае ликвидации юридического лица и на других основаниях, установленных законом.
"""
GKU_g_44 = """ 
Глава 44 - Гражданского кодекса
Право интеллектуальной собственности на торговую марку

Статья 492. Торговая марка
1. Торговой маркой может быть любое обозначение или любая комбинация обозначений, пригодные для выделения товаров (услуг), которые вырабатываются (предоставляются) одним лицом, от товаров (услуг), которые вырабатываются (предоставляются) другими лицами. Такими обозначениями могут быть, в частности, слова, буквы, цифры, изобразительные элементы, комбинации цветов.

Статья 493. Субъекты права интеллектуальной собственности на торговую марку
1. Субъектами права интеллектуальной собственности на торговую марку являются физические и юридические лица.
2. Право интеллектуальной собственности на определенную торговую марку может принадлежать одновременно нескольким физическим и (или) юридическим лицам.

Статья 494. Засвидетельствование обретения права интеллектуальной собственности на торговую марку
1. Обретение права интеллектуальной собственности на торговую марку удостоверяется свидетельством. Условия и порядок выдачи свидетельства устанавливаются законом.
2. Объем правовой охраны торговой марки определяется приведенными в свидетельстве ее изображением и перечнем товаров и услуг, если другое не установлено законом.
3. Обретение права интеллектуальной собственности на торговую марку, которая имеет международную регистрацию или признана в установленном законом порядке хорошо известной, не требует засвидетельствования свидетельством.

Статья 495. Имущественные права интеллектуальной собственности на торговую марку
1. Имущественными правами интеллектуальной собственности на торговую марку являются:
право на использование торговой марки;
исключительное право разрешать использование торговой марки;
исключительное право препятствовать неправомерному использованию торговой марки, в том числе запрещать такое использование;
другие имущественные права интеллектуальной собственности, установленные законом.
2. Имущественные права интеллектуальной собственности на торговую марку принадлежат владельцу соответствующего свидетельства, владельцу международной регистрации, лицу, торговая марка которого признана в установленном законом порядке хорошо известной, если другое не установлено договором.

Статья 496. Срок действия имущественных прав интеллектуальной собственности на торговую марку
1. Имущественные права интеллектуальной собственности на торговую марку являются действующими на протяжении десяти лет с даты, следующей за датой представления заявки на торговую марку в установленном законом порядке, если другое не установлено законом. Указанный срок может быть продолженной каждый раз на десять лет в порядке, установленном законом.

Статья 497. Досрочное прекращение действия имущественных прав интеллектуальной собственности на торговую марку
1. Действие имущественных прав интеллектуальной собственности на торговую марку прекращается в установленном законом порядке досрочно в связи с преобразованием торговой марки в общеупотребительное обозначение определенного вида товаров или услуг.
2. Действие имущественных прав интеллектуальной собственности на торговую марку может быть прекращено досрочно по инициативе лица, которому они принадлежат, если это не противоречит условиям договора, а также в других случаях, предусмотренных законом.
3. Если в связи с досрочным прекращением действия исключительных имущественных прав интеллектуальной собственности на торговую марку нанесен ущерб лицу, которому было предоставлено разрешение на его использование, такие убытки возмещаются лицом, которое предоставило указанное разрешение, если другое не установлено договором или законом.

Статья 498. Восстановление действия досрочно прекращенных исключительных имущественных прав интеллектуальной собственности на торговую марку
1. Действие досрочно прекращенных исключительных имущественных прав интеллектуальной собственности на торговую марку может быть восстановлено в порядке, установленном законом, по заявлению лица, которому эти права принадлежали в момент их прекращения.

Статья 499. Признание прав интеллектуальной собственности на торговую марку недействительными
1. Права интеллектуальной собственности на торговую марку признаются недействительными на основании и в порядке, установленных законом.

Статья 500. Право предшествующего пользователя на торговую марку
1. Любое лицо, которое к дате представления заявки на торговую марку или, если был заявлен приоритет, к дате приоритета заявки в интересах своей деятельности добросовестно использовало торговую марку в Украине или осуществило значительную и серьезную подготовку для такого использования, имеет право на безвозмездное продолжение такого использования или использования, которое предполагалось указанной подготовкой (право предшествующего пользователя).
2. Право предшествующего пользователя может передаваться или переходить к другому лицу только вместе с предприятием или деловой практикой или с той частью предприятия или деловой практики, в которых была использована торговая марка или осуществлена значительная и серьезная подготовка для такого использования.
"""
GKU_g_45 = """ 
Глава 45 - Гражданского кодекса
Право интеллектуальной собственности на географическое указание

Статья 501. Обретение права интеллектуальной собственности на географическое указание
1. Право интеллектуальной собственности на географическое указание возникает с даты государственной регистрации этого права, если другое не установлено законом.
2. Объем правовой охраны географического указания определяется характеристиками товара (услуги) и границами географического места его (ее) происхождения, зафиксированными государственной регистрацией права интеллектуальной собственности на географическое указание.

Статья 502. Субъекты права интеллектуальной собственности на географическое указание
1. Субъектами права интеллектуальной собственности на географическое указание являются производители товаров, ассоциации потребителей, другие лица, определенные законом.

Статья 503. Права интеллектуальной собственности на географическое указание
1. Правами интеллектуальной собственности на географическое указание являются:
право на признание обозначения товара (услуги) географическим указанием;
право на использование географического указания;
право препятствовать неправомерному использованию географического указания, в том числе запрещать такое использование.
2. Права интеллектуальной собственности на географическое указание, принадлежащие отдельным субъектам права интеллектуальной собственности на географическое указание, устанавливаются законом.

Статья 504. Срок действия права интеллектуальной собственности на географическое указание
1. Право интеллектуальной собственности на географическое указание является действующим с даты, следующей за датой государственной регистрации, и охраняется бессрочно при условии сохранения характеристик товара (услуги), обозначенных этим указанием.
"""
GKU_g_46 = """ 
Глава 46 - Гражданского кодекса
Право интеллектуальной собственности на коммерческую тайну

Статья 505. Понятие коммерческой тайны
1. Коммерческой тайной является информация, являющаяся секретной в том понимании, что она в целом или в определенной форме и совокупности ее составных частей неизвестна и не является легкодоступной для лиц, которые обычно имеют дело с видом информации, к которому она относится, в связи с этим имеет коммерческую ценность и является предметом адекватных существующим обстоятельствам мер по сохранению ее секретности, употребленных лицом, которое законно контролирует эту информацию.
2. Коммерческой тайной могут быть сведения технического, организационного, коммерческого, производственного и другого характера, за исключением тех, которые в соответствии с законом не могут быть отнесены к коммерческой тайне.

Статья 506. Имущественные права интеллектуальной собственности на коммерческую тайну
1. Имущественными правами интеллектуальной собственности на коммерческую тайну являются:
право на использование коммерческой тайны;
исключительное право разрешать использование коммерческой тайны;
исключительное право препятствовать неправомерному разглашению, сбору или использованию коммерческой тайны;
другие имущественные права интеллектуальной собственности, установленные законом.
2. Имущественные права интеллектуальной собственности на коммерческую тайну принадлежат лицу, которое правомерно определило информацию коммерческой тайной, если другое не установлено договором.

Статья 507. Охрана коммерческой тайны органами государственной власти
1. Органы государственной власти обязаны охранять от недобросовестного коммерческого использования информацию, которая является коммерческой тайной и создание которой требует значительных усилий и которая предоставлена им с целью получения установленного законом разрешения на деятельность, связанную с фармацевтическими, сельскохозяйственными, химическими продуктами, которые содержат новые химические соединения. Эта информация охраняется органами государственной власти также от разглашения, кроме случаев, если разглашение необходимое для обеспечения защиты населения или не употреблено мероприятиями по ее охране от недобросовестного коммерческого использования.
2. Органы государственной власти обязаны охранять коммерческую тайну также в других случаях, предусмотренных законом.

Статья 508. Срок действия права интеллектуальной собственности на коммерческую тайну
1. Срок действия права интеллектуальной собственности на коммерческую тайну ограничивается сроком существования совокупности признаков коммерческой тайны, установленных частью первой статьи 505 Гражданского кодекса Украины.
"""
GKU_g_47 = """ 
Книга пятая - Обязательственное право
Раздел I - Общие положения о обязательства
Глава 47 - Гражданского кодекса

Понятие обязательства. Стороны в обязательстве

Статья 509. Понятие обязательства и основания его возникновения
1. Обязательством является правоотношение, в котором одна сторона (должник) обязана совершить в пользу второй стороны (кредитора) определенное действие (передать имущество, выполнить работу, предоставить услугу, уплатить деньги и т.п.) или воздержаться от определенного действия, а кредитор имеет право требовать от должника выполнения его обязанности.
2. Обязательства возникают на основаниях, установленных статьей 11 Гражданского кодекса Украины.
3. Обязательство должно основываться на принципах добросовестности, разумности и справедливости.

Статья 510. Стороны в обязательстве
1. Сторонами в обязательстве являются должник и кредитор.
2. В обязательстве на стороне должника или кредитора могут быть одно или одновременно несколько лиц.
3. Если любая из сторон в обязательстве имеет одновременно и права, и обязанности, она считается должником в том, что она обязана совершить в пользу второй стороны, и одновременно кредитором в том, что она имеет право требовать от нее.

Статья 511. Третье лицо в обязательстве
1. Обязательство не создает обязанности для третьего лица. В случаях, установленных договором, обязательство может порождать для третьего лица права относительно должника и (или) кредитора.

Статья 512. Основания замены кредитора в обязательстве
1. Кредитор в обязательстве может быть заменен другим лицом вследствие:
передачи им своих прав другому лицу по правовым действиям (уступка права требования);
правопреемства;
выполнение обязанности должника поручителем или залогодателем (имущественным поручителем);
выполнение обязанности должника третьим лицом.
2. Кредитор в обязательстве может быть заменен также в других случаях, установленных законом.
3. Кредитор в обязательстве не может быть заменен, если это установлено договором или законом.

Статья 513. Форма сделки относительно замены кредитора в обязательстве
1. Сделка относительно замены кредитора в обязательстве совершается в той же форме, что и сделка, на основании которой возникло обязательство, право требования по которой передается новому кредитору.
2. Сделка относительно замены кредитора в обязательстве, которое возникло на основании сделки, подлежащей государственной регистрации, может быть зарегистрирована в порядке, установленном для регистрации этой сделки, если другое не установлено законом.

Статья 514. Объем прав, которые переходят к новому кредитору в обязательстве
1. К новому кредитору переходят права первоначального кредитора в обязательстве в объеме и на условиях, которые существовали на момент перехода этих прав, если другое не установлено договором или законом.

Статья 515. Обязательства, в которых замена кредитора не допускается
1. Замена кредитора не допускается в обязательствах, неразрывно связанных с лицом кредитора, в частности в обязательствах о возмещении вреда, причиненного увечьем, другим повреждением здоровья или смертью.

Статья 516. Порядок замены кредитора в обязательстве
1. Замена кредитора в обязательстве осуществляется без согласия должника, если другое не установлено договором или законом.
2. Если должник не был письменно осведомлен о замене кредитора в обязательстве, новый кредитор несет риск наступления неблагоприятных для него последствий. В этом случае выполнение должником своих обязательств первоначальному кредитору является надлежащим выполнением.

Статья 517. Доказательства прав нового кредитора в обязательстве
1. Первоначальный кредитор в обязательстве должен передать новому кредитору документы, удостоверяющие права, которые передаются, и информацию, являющуюся важной для их осуществления.
2. Должник имеет право не выполнять своих обязательств новому кредитору до предоставления должнику доказательств перехода к новому кредитору прав в обязательстве.

Статья 518. Возражение должника против требования нового кредитора в обязательстве
1. Должник имеет право выдвигать против требования нового кредитора в обязательстве возражения, которые он имел против первоначального кредитора на момент получения письменного сообщения о замене кредитора.
2. Если должник не был письменно извещен о замене кредитора в обязательстве, он имеет право выдвинуть против требования нового кредитора возражение, которые он имел против первичного кредитора на момент предъявления ему требования новым кредитором или, если должник исполнил свой долг к предъявлению ему требования новым кредитором, - на момент его выполнения.

Статья 519. Ответственность первичного кредитора в обязательстве
1. Первичный кредитор в обязательстве отвечает перед новым кредитором за недействительность переданного ему требования, но не отвечает за невыполнение должником своей обязанности, кроме случаев, если первоначальный кредитор поручился за должника перед новым кредитором.

Статья 520. Замена должника в обязательстве
1. Должник в обязательстве может быть заменен другим лицом (перевод долга) только с согласия кредитора, если иное не предусмотрено законом.

Статья 521. Форма сделки относительно замены должника в обязательстве
1. Форма сделки относительно замены должника в обязательстве определяется соответственно положениям статьи 513 Гражданского кодекса Украины.

Статья 522. Возражение нового должника в обязательстве против требования кредитора
1. Новый должник в обязательстве имеет право выдвинуть против требования кредитора все возражения, которые основываются на отношениях между кредитором и первоначальным должником.

Статья 523. Правовые последствия замены должника в обязательстве, обеспеченном поручительством или залогом
1. Поручительство или залог, установленные другим лицом, прекращаются после замены должника, если поручитель или залогодатель не согласится обеспечивать выполнение обязательства новым должником.
2. Залог, установленный первичным должником, сохраняется после замены должника, если другое не установлено договором или законом.

Статья 524. Валюта обязательства
1. Обязательство должно быть выражено в денежной единице Украины - гривне.
2. Стороны могут определить денежный эквивалент обязательства в иностранной валюте.

Статья 525. Недопустимость одностороннего отказа от обязательства
1. Односторонний отказ от обязательства или одностороннее изменение его условий не допускается, если другое не установлено договором или законом.
"""
GKU_g_48 = """ 
Глава 48 - Гражданского кодекса
Выполнение обязательства

Статья 526. Общие условия выполнения обязательств
1. Обязательство должно выполняться надлежащим образом согласно условиям договора и требованиям Гражданского кодекса Украины, других актов гражданского законодательства, а из-за отсутствия таких условий и требований - соответственно обычаям делового оборота или других требований, которые обычно выдвигаются.

Статья 527. Выполнение обязательства надлежащими сторонами
1. Должник обязан исполнить свой долг, а кредитор - принять выполнение лично, если другое не установлено договором или законом, не вытекает из сути обязательства или обычаев делового оборота.
2. Любая из сторон в обязательстве имеет право требовать доказательств того, что обязанность выполняется надлежащим должником или выполнение принимается надлежащим кредитором или уполномоченным на это лицом, и несет риск последствий непредъявления такого требования.

Статья 528. Выполнение обязанности должника другим лицом
1. Выполнение обязанности может быть возложено должником на другое лицо, если из условий договора, требований Гражданского кодекса Украины, других актов гражданского законодательства или сути обязательства не вытекает обязанность должника выполнить обязательства лично. В этом случае кредитор обязан принять выполнение, предложенное за должника другим лицом.
2. В случае невыполнения или ненадлежащего выполнения обязанности должника другим лицом эту обязанность должник должен выполнить сам.
3. Другое лицо может удовлетворить требование кредитора без согласия должника в случае опасности утратить право на имущество должника (право аренды, право залога и т.п.) вследствие обращения кредитором взыскания на это имущество. В этом случае к другому лицу переходят права кредитора в обязательстве и применяются положения статей 512-519 Гражданского кодекса Украины.

Статья 529. Выполнение обязательства частями
1. Кредитор имеет право не принимать от должника выполнения его обязанности частями, если другое не установлено договором, актами гражданского законодательства или не вытекает из сути обязательства или обычаев делового оборота.

Статья 530. Срок выполнение обязательства
1. Если в обязательстве установлен срок (дата) его выполнения, то оно подлежит выполнению в этот срок (дату). Обязательство, срок (дата) выполнение которого определен указанием на событие, которое неминуемо должно наступить, подлежит выполнению с наступлением этого события.
2. Если срок (дата) выполнения должником обязанности не установлен или определен моментом предъявления требования, кредитор имеет право требовать его выполнения в любое время. Должник должен исполнить такой долг в семидневный срок от дня предъявления требования, если обязанность немедленного выполнения не вытекает из договора или актов гражданского законодательства.

Статья 531. Досрочное выполнение обязательства
1. Должник имеет право исполнить свой долг досрочно, если другое не установлено договором, актами гражданского законодательства или не вытекает из сути обязательства или обычаев делового оборота.

Статья 532. Место выполнения обязательства
1. Место выполнения обязательства устанавливается в договоре. Если место выполнения обязательства не установлено в договоре, выполнение производится:
по обязательству о передаче недвижимого имущества - по местонахождению этого имущества;
по обязательству о передаче товара (имущества), возникающему на основании договора перевозки, - по месту сдачи товара (имущества) перевозчику;
по обязательству о передаче товара (имущества), возникающему на основании других сделок, - по месту изготовления или сохранения товара (имущества), если это место было известно кредитору на момент возникновения обязательства;
по денежным обязательствам - по месту проживания кредитора, а если кредитором является юридическое лицо, - по его местонахождению на момент возникновения обязательства. Если кредитор на момент выполнения обязательства изменил местожительство (местонахождение) и сообщил об этом должнику, обязательство выполняется по новому месту проживания (местонахождению) кредитора с отнесением на кредитора всех затрат, связанных с изменением места выполнения;
по другим обязательствам - по месту проживания (местонахождения) должника.
2. Обязательство может быть выполнено в другом месте, если это установлено актами гражданского законодательства или вытекает из сути обязательства или обычаев делового оборота.

Статья 533. Валюта выполнения денежного обязательства
1. Денежное обязательство должно быть выполнено в гривнах.
2. Если в обязательстве определен денежный эквивалент в иностранной валюте, сумма, которая подлежит уплате в гривнах, определяется по официальному курсу соответствующей валюты на день платежа, если другой порядок ее определения не установлен договором или законом или другим нормативно-правовым актом.
3. Использование иностранной валюты, а также платежных документов в иностранной валюте при осуществимые расчетов на территории Украины по обязательствам допускается в случаях, порядке и при условиях, установленных законом.

Статья 534. Очередность погашения требований по денежным обязательствам
1. В случае недостаточности суммы проведенного платежа для выполнения денежного обязательства в полном объеме эта сумма погашает требования кредитора в следующей очередности, если другое не установлено договором или законом:
в первую очередь возмещаются затраты кредитора, связанные с получением исполнения;
во вторую очередь платятся проценты и неустойка;
в третью очередь платится основная сумма долга.

Статья 535. Увеличение суммы, которая выплачивается физическому лицу по денежным обязательствам
1. В случае увеличения установленного законом не облагаемого налогами минимума доходов граждан сумма, которая выплачивается по денежным обязательствам физическому лицу (на возмещение вреда, причиненного увечьем, другим повреждением здоровья или смертью, по договору пожизненного удержания (ухода) и в других случаях, установленных договором или законом), пропорционально увеличивается.
2. Если вследствие выплаты увеличенной суммы сторона, обязанная проводить эти выплаты, теряет выгоды, на получение которых она могла рассчитывать при заключении договора, по требованию этой стороны договор может быть разорван по решению суда.

Статья 536. Проценты
1. За пользование чужими денежными средствами должник обязан платить проценты, если другое не установлено договором между физическими лицами.
2. Размер процентов за пользование чужими денежными средствами устанавливается договором, законом или другим актом гражданского законодательства.

Статья 537. Исполнение обязательства внесением долга в депозит
нотариуса, нотариальной конторы
1. Должник вправе исполнить свой долг путем внесения причитающихся с него кредитору денег или ценных бумаг в депозит нотариуса, нотариальной конторы в случае:
отсутствия кредитора или уполномоченного им лица в месте выполнения обязательства;
уклонение кредитора или уполномоченного им лица от принятия выполнения или в случае другой просрочки из их стороны;
отсутствия представителя недееспособного кредитора.
2. Нотариус сообщает кредитору в порядке, установленном законом, о внесении долга в депозит.

Статья 538. Встречное выполнение обязательства
1. Выполнение своей обязанности одной из сторон, которая согласно договору обусловлена выполнением второй стороной своей обязанности, является встречным выполнением обязательства.
2. При встречном выполнении обязательства стороны должны исполнять свои обязанности одновременно, если другое не установлено договором, актами гражданского законодательства, не вытекает из сути обязательства или обычаев делового оборота.
Сторона, которая заведомо знает, что она не сможет выполнить своей обязанности, должна своевременно сообщить об этом другой стороне.
3. В случае невыполнения одной из сторон в обязательстве своей обязанности или при наличии очевидных оснований считать, что она не выполнит своей обязанности в установленный срок (дату) или выполнит его не в полном объеме, вторая сторона имеет право остановить выполнения своей обязанности, отказаться от ее выполнения частично или в полном объеме.
4. Если встречное выполнение обязанности осуществлено одной из сторон, несмотря на невыполнение второй стороной своей обязанности, вторая сторона должна исполнить свой долг.

Статья 539. Выполнение альтернативного обязательства
1. Альтернативным является обязательство, в котором должник обязан совершить одно из двух или нескольких действий. Должник имеет право выбора предмета обязательства, если другое не установлено договором, актами гражданского законодательства, не вытекает из сути обязательства или обычаев делового оборота.

Статья 540. Выполнение обязательства, в котором принимают участие несколько кредиторов или несколько должников
1. Если в обязательстве принимают участие несколько кредиторов или несколько должников, любой из кредиторов имеет право требовать выполнения, а любой из должников должен исполнить долг в равной доле, если другое не установлено договором или актами гражданского законодательства.

Статья 541. Солидарное обязательство
1. Солидарная обязанность или солидарное требование возникают в случаях, установленных договором или законом, в частности в случае неделимости предмета обязательства.

Статья 542. Солидарное требование кредиторов
1. В случае солидарного требования кредиторов (солидарных кредиторов) любой из кредиторов имеет право предъявить должнику требование в полном объеме.
До предъявления требования одним из солидарных кредиторов должник имеет право исполнить свой долг кому-нибудь из них на свое усмотрение.
2. Должник не имеет права выдвигать против требования одного из солидарных кредиторов возражения, которые основываются на таких отношениях должника с другими солидарными кредиторами, в которых этот кредитор не принимает участия.
3. Выполнение должником своей обязанности одному из солидарных кредиторов в полном объеме освобождает должника от исполнения остальным солидарным кредиторам.
4. Солидарный кредитор, который получил выполнение от должника, обязан передать принадлежащее каждому из остальных солидарных кредиторов в равных долях, если другое не установлено договором между ними.

Статья 543. Солидарная обязанность должников
1. В случае солидарной обязанности должников (солидарных должников) кредитор имеет право требовать выполнения обязанности частично или в полном объеме как от всех должников вместе, так и от кого-нибудь из них в отдельности.
2. Кредитор, который получил выполнение обязательства не в полном объеме от одного из солидарных должников, имеет право требовать недополученное от остатка солидарных должников.
Солидарные должники остаются обязанными до тех пор, пока их обязанность не будет выполнена в полном объеме.
3. Солидарный должник не имеет права выдвигать против требования кредитора возражение, которое основывается на таких отношениях остальных солидарных должников с кредитором, в которых этот должник не берет участия.
4. Выполнение солидарной обязанности в полном объеме одним из должников прекращает обязанность остатка солидарных должников перед кредитором.

Статья 544. Право должника, который исполнил солидарный долг, на обратное требование
1. Должник, который исполнил солидарный долг, имеет право на обратное требование (регресс) к каждому из остальных солидарных должников в равных долях, если другое не установлено договором или законом, за вычетом доли, которая приходится на него.
2. Если один из солидарных должников не выплатил долю, принадлежащую солидарному должнику, в полном объеме исполнившему солидарный долг, неуплаченное приходится на каждого из оставшихся солидарных должников в равной доле.

Статья 545. Подтверждение выполнения обязательства
1. Приняв выполнение обязательства, кредитор должен по требованию должника выдать ему расписку о получении выполнения частично или в полном объеме.
2. Если должник выдал кредитору долговой документ, кредитор, принимая выполнения обязательства, должен возвратить его должнику. В случае невозможности возвращения долгового документа кредитор должен указать об этом в расписке, которую он выдает.
3. Наличие долгового документа у должника подтверждает выполнение им своей обязанности.
4. В случае отказа кредитора возвратить долговой документ или выдать расписку должник имеет право задержать исполнение обязательства. В этом случае наступает просрочка кредитора.
"""
GKU_g_49 = """ 
Глава 49 - Гражданского кодекса
Обеспечение выполнения обязательства

Параграф 1. Общие положения об обеспечении выполнения обязательства

Статья 546. Виды обеспечения выполнения обязательства
1. Исполнение обязательства может обеспечиваться неустойкой, поручительством, гарантией, залогом, удержанием, задатком, правом доверительной собственности.
2. Договором или законом могут быть установлены другие виды обеспечения выполнения обязательства.

Статья 547. Форма правового действия относительно обеспечения выполнения обязательства
1. Сделка относительно обеспечения выполнения обязательства совершается в письменной форме.
2. Сделка относительно обеспечения выполнения обязательства, совершенная с несоблюдением письменной формы, является ничтожной.

Статья 548. Общие условия обеспечения выполнения обязательства
1. Исполнение обязательства (основного обязательства) обеспечивается, если это установлено договором или законом.
2. Недействительное обязательство не подлежит обеспечению. Недействительность основного обязательства (требования) вызывает недействительность сделки относительно его обеспечения, если другое не установлено этим Кодексом.
3. Недействительность сделки относительно обеспечения выполнения обязательства не влечет за собой недействительности основного обязательства.

Параграф 2. Неустойка

Статья 549. Понятие неустойки
1. Неустойкой (штрафом, пеней) является денежная сумма или другое имущество, которое должник должен передать кредитору в случае нарушения должником обязательства.
2. Штрафом является неустойка, которая вычисляется в процентах от суммы невыполненного или ненадлежащего выполненного обязательства.
3. Пеней является неустойка, которая вычисляется в процентах от суммы несвоевременно выполненного денежного обязательства за каждый день просрочки исполнения.

Статья 550. Основания возникновения права на неустойку
1. Право на неустойку возникает независимо от наличия у кредитора убытков, причиненных невыполнением или ненадлежащим выполнением обязательства.
2. Проценты на неустойку не начисляются.
3. Кредитор не имеет права на неустойку в случае, если должник не отвечает за нарушение обязательства (статья 617 Гражданского кодекса Украины).

Статья 551. Предмет неустойки
1. Предметом неустойки может быть денежная сумма, движимое и недвижимое имущество.
2. Если предметом неустойки является денежная сумма, ее размер устанавливается договором или актом гражданского законодательства.
Размер неустойки, установленный законом, может быть увеличен в договоре если такое увеличение не запрещено законом.
Стороны могут договориться об уменьшении размера неустойки, установленного актом гражданского законодательства, кроме случаев, предусмотренных законом.
3. Размер неустойки может быть уменьшен по решению суда, если он значительно превышает размер убытков, и при наличии других обстоятельств, которые имеют важное значение.

Статья 552. Правовые последствия уплаты (передачи) неустойки
1. Уплата (передача) неустойки не освобождает должника от выполнения своей обязанности в натуре.
2. Уплата (передача) неустойки не лишает кредитора права на возмещение убытков, причиненных невыполнением или ненадлежащим выполнением обязательства

Параграф 3. Поручительство

Статья 553. Договор поручительства
1. По договору поручительства поручитель поручается перед кредитором должника за выполнение им своей обязанности.
Поручитель отвечает перед кредитором за нарушение обязательства должником.
2. Поручительством может обеспечиваться выполнение обязательства частично или в полном объеме.
3. Поручителем может быть одно лицо или несколько лиц.

Статья 554. Правовые последствия нарушения обязательства, обеспеченного поручительством
1. В случае нарушения должником обязательства, обеспеченного поручительством, должник и поручитель отвечают перед кредитором как солидарные должники, если договором поручительства не установлена дополнительная (субсидиарная) ответственность поручителя.
2. Поручитель отвечает перед кредитором в том же объеме, что и должник, включая уплату основного долга, процентов, неустойки, возмещение убытков, если другое не установлено договором поручительства.
3. Лица, совместно давшие поручительство, отвечают перед кредитором солидарно, если другое не установлено договором поручительства.

Статья 555. Права и обязанности поручителя в случае предъявления к нему требования
1. В случае получения требования кредитора поручитель обязан сообщить об этом должнику, а в случае предъявления к нему иска - подать ходатайство о привлечении должника к участию в деле.
Если поручитель не сообщит должнику о требовании кредитора и сам выполнит обязательство, должник имеет право выдвинуть против требования поручителя все возражения, которые он имел против требования кредитора.
2. Поручитель имеет право выдвинуть против требования кредитора возражения, которые мог бы выдвинуть сам должник, при условии, что эти возражения не связаны с лицом должника. Поручитель имеет право выдвинуть эти возражения также в случае, если должник отказался от них или признал свой долг.

Статья 556. Права поручителя, который выполнил обязательства
1. После выполнения поручителем обязательства, обеспеченного поручительством, кредитор должен вручить ему документы, которые подтверждают эту обязанность должника.
2. К поручителю, который выполнил обязательства, обеспеченные поручительством, переходят все права кредитора в этом обязательстве, в том числе и те, что обеспечивали его выполнение.
3. К каждому из нескольких поручителей, исполнивших обязательства, обеспеченные поручительством, переходят права кредитора в размере части исполненной им обязанности.

Статья 557. Сообщение поручителя о выполнении обязательства должником
1. Должник, исполнивший обязательство, обеспеченное поручительством, должен немедленно сообщить об этом поручителю.
2. Поручитель, который выполнил обязательство, обеспеченное поручительством, в связи с ненаправлением ему должником сообщения о выполнении им своей обязанности, имеет право взыскать с кредитора безосновательно полученное или предъявить обратное требование к должнику.

Статья 558. Оплата услуг поручителя
1. Поручитель имеет право на оплату услуг, предоставленных им должнику.

Статья 559. Прекращение поручительства
1. Поручительство прекращается с прекращением обеспеченного им обязательства, а также в случае изменения обязательств без согласия поручителя, вследствие чего увеличивается объем его ответственности.
2. Поручительство прекращается, если после наступления срока выполнения обязательства кредитор отказался принять надлежащее выполнение, предложенное должником или поручителем.
3. Поручительство прекращается в случае перевода долга на другое лицо, если поручитель не поручился за нового должника.
4. Поручительство прекращается по истечении срока, установленного в договоре поручительства. В случае если такой срок не установлен, поручительство прекращается, если кредитор в течение шести месяцев со дня наступления срока исполнения основного обязательства не предъявит требования к поручителю, если иное не предусмотрено законом. Если срок основного обязательства не установлен или установлен моментом предъявления требования, поручительство прекращается, если кредитор не предъявит иска к поручителю в течение одного года со дня заключения договора поручительства, если иное не предусмотрено законом 

Параграф 4. Гарантия

Статья 560. Понятие гарантии
1. По гарантии банк, другое финансовое учреждение, страховая организация (гарант) гарантирует перед кредитором (бенефициаром) выполнение должником (принципалом) своей обязанности.
Гарант отвечает перед кредитором за нарушение обязательства должником.

Статья 561. Срок действия гарантии
1. Гарантия действует на протяжении срока, на который она выдана.
2. Гарантия является действительной со дня ее выдачи, если в ней не установлено иное.
3. Гарантия не может быть отозвана гарантом, если в ней не установлено иное.

Статья 562. Независимость гарантии от основного обязательства
1. Обязательство гаранта перед кредитором не зависит от основного обязательства (его прекращения или недействительности), в частности и тогда, когда в гарантии содержится ссылка на основное обязательство.

Статья 563. Правовые последствия нарушения должником обязательства, обеспеченного гарантией
1. В случае нарушения должником обязательства, обеспеченного гарантией, гарант обязан уплатить кредитору денежную сумму согласно условиям гарантии.
2. Требование кредитора к гаранту об уплате денежной суммы согласно выданной им гарантии предъявляется в письменной форме. К требованию прилагаются документы, указанные в гарантии.
3. В требовании к гаранту или в приложенных к нему документах кредитор должен указать, в чем состоит нарушение должником основного обязательства, обеспеченного гарантией.
4. Кредитор может предъявить требование к гаранту в пределах срока, установленного в гарантии, на которую она выдана.
5. Кредитор не может передавать другому лицу право требования к гаранту, если иное не установлено гарантией.

Статья 564. Обязанности гаранта при рассмотрении требования кредитора
1. После получения требования кредитора гарант должен немедленно сообщить об этом должнику и передать ему копии требования вместе с приложенными к нему документами.
2. Гарант должен рассмотреть требование кредитора вместе с приложенными к нему документами в установленный в гарантии срок, а в случае его отсутствия - в разумный срок и установить соответствие требования и приложенных к нему документов условиям гарантии.

Статья 565. Право гаранта на отказ в удовлетворении требования кредитора
1. Гарант имеет право отказаться от удовлетворения требования кредитора, если требование или приложенные к нему документы не отвечают условиям гарантии или если они представлены гаранту после окончания срока действия гарантии.
2. Гарант должен немедленно сообщить кредитору об отказе от удовлетворения его требования.
3. Если гарант после предъявления к нему требования кредитора узнал о недействительности основного обязательства или о его прекращении, он должен немедленно сообщить об этом кредитору и должника.
Повторное требование кредитора, полученное гарантом после такого сообщения, подлежит удовлетворению.

Статья 566. Обязанность гаранта
1. Обязанность гаранта перед кредитором ограничивается уплатой суммы, на которую выдана гарантия.
В случае нарушения гарантом своей обязанности его ответственность перед кредитором не ограничивается суммой, на которую выдана гарантия, если другое не установлено в гарантии.

Статья 567. Оплата услуг гаранта
1. Гарант имеет право на оплату услуг, предоставленных им должнику.

Статья 568. Прекращение гарантии
1. Обязательство гаранта перед кредитором прекращается в случае:
уплаты кредитору суммы, на которую выдана гарантия;
окончания срока действия гарантии;
отказа кредитора от своих прав по гарантии путем возвращения ее гаранту или путем предоставления гаранту письменного заявления об увольнении его от обязанностей по гарантией.
2. Гарант, которому стало известно о прекращении гарантии, должен немедленно сообщить об этом должнику.

Статья 569. Право гаранта на обратное требование к должнику
1. Гарант имеет право на обратное требование (регресс) к должнику в границах суммы, уплаченной им по гарантии кредитору, если другое не установлено договором между гарантом и должником.
2. Гарант не имеет права на обратное требование (регресс) к должнику в случае, если сумма, уплаченная гарантом кредитору, не отвечает условиям гарантии, если другое не установлено договором между гарантом и должником.

Параграф 5. Задаток

Статья 570. Понятие задатка
1. Задатком является денежная сумма или движимое имущество, которое выдается кредитору должником в счет причитающихся с него по договору платежей, в подтверждение обязательства и в обеспечение его выполнения.
2. Если не будет установлено, что сумма, уплаченная в счет причитающихся с должника платежей, является задатком, она считается авансом.

Статья 571. Правовые последствия нарушения или прекращения обязательства, обеспеченного задатком
1. Если нарушение обязательства произошло по вине должника, задаток остается у кредитора.
Если нарушение обязательства произошло по вине кредитора, он обязан возвратить должнику задаток и дополнительно уплатить сумму в размере задатка или его стоимости.
2. Сторона, виновная в нарушении обязательства, может возместить второй стороне убытки в сумме, на которую они превышают размер (стоимость) задатка, если другое не установлено договором.
3. В случае прекращения обязательства к началу его выполнения или вследствие невозможности его выполнения задаток подлежит возвращению.

Параграф 6. Залог

Статья 572. Понятие залога
1. В силу залога кредитор (залогодержатель) имеет право в случае невыполнения должником (залогодателем) обязательства, обеспеченного залогом, получить удовлетворение за счет заложенного имущества преимущественно перед другими кредиторами этого должника, если другое не установлено законом (право залога).

Статья 573. Обеспечение будущего требования
1. Залогом может быть обеспечено требование, которое может возникнуть в будущем.

Статья 574. Основания возникновения залога
1. Залог возникает на основании договора, закона или решения суда.
2. К залогу, который возникает на основании закона, применяются положения этого Кодекса относительно залога, возникающего на основании договора, если другое не установлено законом.

Статья 575. Отдельные виды залогов
1. Ипотекой является залог недвижимого имущества, которое остается во владении залогодателя или третьего лица.
2. Закладом является залог движимого имущества, передаваемого во владение залогодержателя или по его приказу - во владение третьему лицу.
3. Правила об ипотеке земли и прочие отдельные виды залогов устанавливаются законом.

Статья 576. Предмет залога
1. Предметом залога может быть любое имущество (в частности вещь, ценные бумаги, имущественные права), которое может быть отчуждено залогодателем и на которое может быть обращено взыскание.
2. Предметом залога может быть имущество, которое залогодатель приобретет после возникновения залога (будущий урожай, приплод скота и т.п.).
3. Права залогодержателя (право залога) на вещь, которая является предметом залога, распространяются на его принадлежности, если другое не установлено договором. Право залога распространяется на плоды, продукцию и доходы, полученные от использования заложенного имущества, в случаях, установленных договором.
4. Предметом залога не могут быть:
культурные ценности, являющиеся объектами права государственной или коммунальной собственности и занесены или подлежат занесению в Государственный реестр национального культурного достояния;
памятники культурного наследия, занесенных в Перечень памятников культурного наследия, не подлежащих приватизации.
5. Предметом залога не могут быть требования, которые имеют личный характер, а также другие требования, залог которых запрещен законом.
6. Предмет залога остается у залогодателя, если другое не установлено договором или законом.
7. Залог отдельных видов имущества может быть запрещен или ограничен законом.

Статья 577. Нотариальное удостоверение договора залога и регистрация залога
1. Если предметом залога является недвижимое имущество, а также в других случаях, установленных законом, договор залога подлежит нотариальному удостоверению (кроме случаев, установленных законом).
2. Залог недвижимого имущества подлежит государственной регистрации в случаях и в порядке, установленных законом.
3. Залог движимого имущества может быть зарегистрирован на основании заявления залогодержателя или залогодателя с внесением записи в Государственный реестр отягощений движимого имущества.
4. Моментом регистрации залога является дата и время внесения соответствующей записи в Государственный реестр отягощений движимого имущества.

Статья 578. Залог имущества, находящегося в общей собственности
1. Имущество, находящееся в общей собственности, может быть передано в залог лишь по согласию всех совладельцев.

Статья 579. Замена предмета залога
1. Предмет залога может быть заменен лишь по согласию залогодержателя, если другое не установлено договором или законом.

Статья 580. Риск случайного уничтожения или случайного повреждения предмета залога
1. Риск случайного уничтожения или случайного повреждения предмета залога несет собственник заложенного имущества, если другое не установлено договором или законом.
2. В случае случайного уничтожения или случайного повреждения предмета залога залогодатель по требованию залогодержателя обязан предоставить равноценный предмет или, если это возможно, восстановить уничтоженный или поврежденный предмет залога.

Статья 581. Страхование предмета залога
1. Если предмет залога не подлежит обязательному страхованию, он может быть застрахован по согласию сторон на согласованную сумму.
В случае наступления страхового случая предметом залога становится право требования к страхователю.

Статья 582. Оценка предмета залога
1. Оценка предмета залога осуществляется в случаях, установленных договором или законом.
2. Оценка предмета залога осуществляется залогодателем вместе с залогодержателем согласно обычным ценам, сложившимся на момент возникновения права залога, если другой порядок оценки предмета залога не установлен договором или законом.

Статья 583. Стороны в договоре залога
1. Залогодателем может быть должник или третье лицо (имущественный поручитель).
2. Залогодателем может быть собственник вещи или лицо, которому принадлежит имущественное право, а также лицо, какое собственник вещи или лицо, которому принадлежит имущественное право, передали вещь или имущественное право с правом их залога.
3. Залог права на чужую вещь осуществляется по согласию собственника этой вещи, если для отчуждения этого права согласно договору или закону нужно согласие собственника.

Статья 584. Содержание договора залога
1. В договоре залога определяются суть, размер и срок выполнения обязательства, обеспеченного залогом, подается описание предмета залога, а также определяются другие условия, согласованные сторонами договора.
2. Описание предмета залога в договоре залога может быть представлено в общей форме (указание на вид заставленного имущества и т.п.).

Статья 585. Момент возникновения права залога
1. Право залога возникает с момента заключения договора залога, а в случаях, если договор подлежит нотариальному удостоверению, - с момента его нотариального удостоверения (кроме случаев, установленных законом).
2. Если предмет залога согласно договору или закону должен находиться во владении залогодержателя, право залога возникает в момент передачи ему предмета залога. Если такая передача была осуществлена до заключения договора залога, право залога возникает с момента его заключения.

Статья 586. Пользование и распоряжение предметом залога
1. Залогодатель имеет право пользоваться предметом залога соответственно его назначению, в том числе приобретать с него плоды и доходы, если другое не установлено договором и если это вытекает из сути залога.
2. Залогодатель имеет право отчуждать предмет залога, передавать его в пользование другому лицу или иным образом распоряжаться им лишь по согласию залогодержателя, если другое не установлено договором или законом.
3. Залогодатель имеет право завещать заложенное имущество. Сделка, которой ограничивается право залогодателя завещать заложенное имущество, является никчемной.
4. Залогодержатель имеет право пользоваться переданным ему предметом залога лишь в случаях, установленных договором. По договору на залогодержателя может быть возложена обязанность извлекать из предмета залога плоды и доходы.

Статья 587. Обязанности владельца предмета залога
1. Лицо, которое владеет предметом залога, обязано, если другое не установлено договором:
принимать меры, необходимые для сохранности предмета залога;
содержать предмет залога надлежащим образом;
немедленно сообщать другой стороне договора залога о возникновении угрозы уничтожения или повреждения предмета залога.
2. Залогодатель, владеющий предметом залога, в случае потери, порчи, повреждения или уничтожения заложенного имущества по его вине обязан заменить или восстановить это имущество, если другое не установлено договором.
3. Залогодержатель, владеющий предметом залога, в случае потери, порчи, повреждения или уничтожения заложенного имущества по его вине обязан возместить залогодателю причиненные убытки.

Статья 588. Последующий залог
1. Следующая залог имущества, что уже заложено, допускается, если иное не установлено предварительным договором залога или законом.
2. Следующая залог имущества не прекращает право залога предыдущего залогодержателя.
3. Первый залогодержатель имеет преимущественное право перед следующими залогодержателями на удовлетворение своих требований за счет заложенного имущества. Требования следующих залогодержателей удовлетворяются в порядке очередности возникновения права залога, кроме случая, предусмотренного частью четвертой настоящей статьи.
4. Если предметом залога является движимое имущество, залогодержатель зарегистрированного залога имеет преимущественное право на удовлетворение требований по заложенного имущества перед залогодержателями незарегистрированных залогов и залогов, которые зарегистрированы позже.
5. Залогодатель незарегистрированной залога обязан предоставить каждому из залогодержателей информацию о всех предыдущих залогах имущества в объеме, установленном Статья 584 этого Кодекса. Залогодатель обязан возместить убытки, возникшие в любого из залогодержателей вследствие неисполнения им этого долга.

Статья 589. Правовые последствия невыполнения обязательства, обеспеченного залогом
1. В случае невыполнения обязательства, обеспеченного залогом, залогодержатель приобретает право обращения взыскания на предмет залога.
2. За счет предмета залога залогодержатель имеет право удовлетворить в полном объеме свое требование, которое определено на момент фактического удовлетворения, включая уплату процентов, неустойки, возмещения убытков, причиненных нарушением обязательства, необходимых затрат на содержание заложенного имущества, а также затрат, понесенных в связи с предъявлением требования, если другое не установлено договором.

Статья 590. Обращение взыскания на предмет залога
1. Обращение взыскания на предмет залога осуществляется по решению суда, если другое не установлено договором или законом.
2. Залогодержатель приобретает право обращения взыскания на предмет залога в случае, если обязательство не будет выполнено в установленный срок (время), если другое не установлено договором или законом.
3. В случае ликвидации юридического лица - залогодателя залогодержатель приобретает право обращения взыскания на заложенное имущество независимо от наступления срока выполнение обязательства, обеспеченного залогом.
4. В случае частичного выполнения должником обязательства, обеспеченного залогом, право обращения на предмет залога сохраняется в первоначальном объеме.
5. Если предметом залога являются две или более вещи (два или более прав), взыскание может быть обращено на все эти вещи (права) или на любую из вещей (прав) на выбор залогодержателя.
Если залогодержатель обратит взыскание на одну вещь (одно право), но его требование не будет удовлетворенно в полном объеме, он сохраняет право залога на другие вещи (права), которые являются предметом залога.

Статья 591. Реализация предмета залога
1. Реализация предмета залога, на который обращено взыскание, ведется путем его продажи с публичных торгов, если другое не установлено договором или законом. Порядок реализации предмета залога с публичных торгов устанавливается законом.
2. Начальная цена предмета залога для его продажи с публичных торгов определяется в порядке, установленном договором или законом. Если обращение взыскания осуществляется по решению суда, суд в своем решении может определить начальную цену предмета залога.
3. Если публичные торги объявлены такими, что не состоялись, предмет залога может быть по согласию залогодержателя и залогодателя передан в собственность залогодержателя по начальной цене, если другое не установлен о договором или законом.
4. Если сумма, полученная от реализации предмета залога, не покрывает требования залогодержателя, он имеет право получить сумму, которой не хватает, из другого имущества должника в порядке очередности соответственно статье 112 Гражданского кодекса Украины, если другое не установлено договором или законом.

Статья 592. Досрочное выполнение обязательства, обеспеченного залогом
1. Залогодержатель имеет право требовать досрочного выполнения обязательства, обеспеченного залогом, в случае:
передачи залогодателем предмета залога другому лицу без согласия залогодержателя, если получение такого согласия было необходимым;
нарушение залогодателем правил о замене предмета залога;
потери предмета залога при обстоятельствах, за которые залогодержатель не отвечает, если залогодатель не заменил или не восстановил предмет залога.
2. Залогодержатель имеет право требовать досрочного выполнения обязательства, обеспеченного залогом, а если его требование не будет удовлетворено, - свернуть взыскание на предмет залога:
в случае нарушения залогодателем правил о последующем залоге;
в случае нарушения залогодателем правил о распоряжении предметом залога;
в других случаях, установленных договором.

Статья 593. Прекращение права залога
1. Право залога прекращается в случае:
прекращения обязательства, обеспеченного залогом;
потери предмета залога, если залогодателель не заменил предмет залога;
реализации предмета залога;
обретение залогодержателем права собственности на предмет залога.
Право залога прекращается также в других случаях, установленных законом.
2. В случае прекращения права залога на недвижимое имущество в государственный реестр вносятся соответствующие данные.
3. В случае прекращения права залога вследствие выполнения обеспеченного залогом обязательства залогодержатель, во владении которого находилось заложенное имущество, обязан немедленно возвратить его залогодателю.

Параграф 7. Удержание

Статья 594. Право удержания
1. Кредитор, правомерно владеющий вещью, подлежащей передаче должнику или лицу, указанному должником, в случае невыполнения им в срок обязательства относительно оплаты этой вещи или возмещения кредитору связанных с нею затрат и других убытков имеет право придержать ее у себя до выполнения должником обязательства.
2. Удержанием вещи могут обеспечиваться другие требования кредитора, если другое не установлено договором или законом.
3. Кредитор имеет право удержать вещь у себя также в случае, если права на нее, возникшие после передачи вещи во владение кредитора, приобрело третье лицо.
4. Риск случайного уничтожения или случайного повреждения удержаной вещи несет кредитор, если другое не установлено законом.

Статья 595. Обязанности кредитора, который удерживает вещь у себя
1. Кредитор, который удерживает вещь у себя, обязан немедленно сообщить об этом должнику
2. Кредитор отвечает за потерю, порчу или повреждение вещи, которую он удерживает у себя, если потеря, порча или повреждение произошли по его вине.
3. Кредитор не имеет права пользоваться вещью, которую он удерживает у себя.

Статья 596. Распоряжение вещью, которую удерживает кредитор
1. К кредитору, который удерживает у себя вещь должника, не переходит право собственности на нее.
2. Должник, вещь которого кредитор удерживает, имеет право распорядиться ею, сообщив приобретателю об удержании вещи и праве кредитора.

Статья 597. Удовлетворение требований за счет вещи, которую удерживает кредитор
1. Требования кредитора, который удерживает вещь у себя, удовлетворяются из ее стоимости соответственно статье 591 Гражданского кодекса Украины.

Параграф 8. Доверительная собственность

Статья 597-1. Право доверительной собственности как способ обеспечения исполнения обязательства по кредитному договору
1. По договору об установлении доверительной собственности одна сторона (доверительный учредитель) передает имущество другой стороне (доверительному собственнику) на праве доверительной собственности для обеспечения обязательства должника по кредитному договору, договору займа.
2. Право доверительной собственности как способ обеспечения исполнения обязательств (далее - доверительная собственность) является разновидностью права собственности на имущество, по которому кредитор, получивший имущество в доверительную собственность (доверительный собственник), не имеет права самостоятельно отчуждать такое имущество, кроме как для обращения взыскания на него, а также выкупа его для общественных нужд в порядке, установленном законом.
3. С момента установления доверительной собственности право собственности лица, передала свое имущество в доверительную собственность, прекращается.
4. До предоставления кредита или займа, обеспечивается передачей недвижимого имущества в доверительную собственность, кредитор обязан предложить должнику предоставления такого кредита, займа, обеспечить выполнение этих обязательств другим способом. Условия кредитного договора, договора займа, обеспечивается передачей имущества в доверительную собственность, могут отличаться от условий кредитного договора, договора займа, обеспечивается другим способом.

Статья 597-2. Объект доверительной собственности
1. Объектом доверительной собственности может быть имущество, которое может быть отчуждено и на которое может быть обращено взыскание.
2. Если законом не установлено иное, объектом доверительной собственности не могут быть ценные бумаги и корпоративные права.
3. Режим доверительной собственности не распространяется на плоды, продукцию и доходы, полученные от использования объекта доверительной собственности, если иное не указано в договоре об установлении доверительной собственности.

Статья 597-3. Возникновение доверительной собственности
1. Доверительная собственность возникает на основании договора, заключенного в письменной форме.
2. Доверительным основателем может быть должник по основному обязательству и / или иное лицо, передает свое имущество в доверительную собственность с целью обеспечения исполнения обязательств должника.
3. Доверительным собственником является кредитор по основному обязательству.
4. Договор об установлении доверительной собственности на недвижимое имущество заключается в письменной форме и подлежит нотариальному удостоверению.
5. Доверительная собственность на недвижимое имущество возникает с момента его регистрации в Государственном реестре прав на недвижимое имущество.
6. Доверительная собственность на движимое имущество возникает с момента заключения договора об установлении доверительной собственности, если таким договором не установлено иное.

Статья 597-4. Пользование объектом доверительной собственности
1. Объектом доверительной собственности вправе пользоваться доверительный основатель (далее - пользователь). Пользователем также может быть другое лицо, определенное договором об установлении доверительной собственности. Если объектом доверительной собственности есть земельный участок, передача ее в пользование другим лицам осуществляется в порядке, установленном Земельным кодексом Украины.
2. Договор об установлении доверительной собственности может предусматривать право пользователя передавать объект доверительной собственности во временное пользование третьим лицам.
3. Пользователь, который не является доверительным собственником, теряет право пользования объектом доверительной собственности со дня получения им уведомления о принятии доверительным собственником решения об обращении взыскания на такой объект. Право пользования объектом доверительной собственности, который является жилым помещением, теряется в порядке, установленном статьей 597-9 настоящего Кодекса.
4. Доверительный собственник имеет право в любое время в течение срока действия доверительной собственности и при условии предварительного уведомления пользователя проверять наличие, состояние, условия хранения и использования объекта доверительной собственности. Договором может быть предусмотрено периодичность таких проверок, их продолжительность, обязательность предупреждения пользователя о проверке, а также другие условия осуществления проверки объекта доверительной собственности.
5. Периодичность проверок объекта доверительной собственности, является жилым помещением, не может превышать одного раза в месяц, а продолжительность одной проверки - двух часов.

Статья 597-5. Обязанности пользователя
1. Пользователь обязан воздерживаться от действий, которые выходят за пределы нормального износа объекта доверительной собственности и могут существенно снизить его стоимость или нанести другой вред.
2. Пользователь несет расходы на содержание объекта доверительной собственности, если иное не установлено договором.
3. Договором могут быть установлены иные обязанности пользователя.

Статья 597-6. Правовые последствия нарушения обязательства должником
1. В случае просрочки исполнения должником основного обязательства доверительный собственник вправе обратить взыскание на объект доверительной собственности при условии, что срок просрочки превышает 20 календарных дней. В случае просрочки должником выполнения части основного обязательства доверительный собственник вправе обратить взыскание на объект доверительной собственности, если просрочка исполнения должником основного обязательства длится более 30 календарных дней.
2. Договором, которым установлена ​​доверительная собственность или на основании которого возникло основное обязательство, могут быть установлены иные основания, с наступлением которых у доверительного собственника возникает право обратить взыскание на объект доверительной собственности.
3. В случае нарушения должником обязательств, указанных в договоре об установлении доверительной собственности (кроме основного обязательства), доверительный собственник вправе принять решение о необходимости досрочного исполнения основного обязательства и сообщить о таком решении должника. Если должник не выполняет решение доверительного собственника о досрочном выполнении основного обязательства в течение 30 календарных дней с момента получения уведомления (если иной срок не установлен договором), доверительный собственник вправе обратить взыскание на объект доверительной собственности.
4. В случае нарушения пользователем обязанностей по сохранению или пользования объектом доверительной собственности доверительный собственник может воспользоваться правами, определенными частью второй настоящей статьи, и / или принять меры для сохранения или страхования объекта доверительной собственности в своих интересах и за свой счет. Пользователь обязан по требованию доверительного собственника немедленно возместить последнему все расходы, понесенные в связи с принятием мер по сохранению и страхование объекта доверительной собственности.

Статья 597-7. Обязательное обращение взыскания на объект доверительной собственности
1. Если иное не предусмотрено договором об установлении доверительной собственности, доверительный собственник обязан обратить взыскание на объект доверительной собственности в случае наступления одного из следующих обстоятельств:
государственной регистрации решения о прекращении юридического лица - должника по основному обязательству или доверительного собственника;
принятие судом решения о признании должника по основному обязательству или доверительного собственника банкротом и открытия ликвидационной процедуры;
смерти должника по основному обязательству, признания его недееспособным или умершим.
2. При обращении взыскания на объект доверительной собственности в случае, предусмотренном пунктом 3 части первой настоящей статьи, сообщения, которые в соответствии с настоящим Кодексом должны быть направлены доверительном основателю, направляются соответственно опекуну, наследникам доверительного основателя, исполнителю завещания или лицу, которое управляет наследством.

Статья 597-8. Порядок обращения взыскания на объект доверительной собственности
1. Если иное не определено договором об установлении доверительной собственности, обращение взыскания на объект доверительной собственности происходит путем его продажи доверительным собственником любому лицу-покупателю. Доверительный собственник обязан не позднее чем за 30 дней до заключения договора купли-продажи письменно уведомить должника, пользователя и доверительного учредителя о своем намерении заключить этот договор и минимальную цену продажи. В случае невыполнения указанного требования доверительный собственник обязан возместить таким лицам нанесенный ущерб.
2. В течение пятидневного срока со дня получения уведомления, указанного в части первой настоящей статьи, должник (пользователь, доверительный учредитель) вправе письменно сообщить доверительного собственника о своем намерении приобрести объект доверительной собственности и внести денежную сумму в размере минимальной цены продажи объекта доверительной собственности, сообщенной доверительным собственником, на депозит нотариуса. Со дня получения доверительным собственником указанного сообщения и внесения соответствующей денежной суммы на депозит нотариуса должник (пользователь, доверительный учредитель) приобретает преимущественное право на приобретение объекта доверительной собственности в доверительного собственника.
3. Цена продажи объекта доверительной собственности устанавливается доверительным собственником единолично и не может быть меньше минимальной цене, сообщенную должнику (пользователю, доверительном основателю).
4. Сумма превышения цены продажи объекта доверительной собственности над размером задолженности должника перед доверительным собственником уплачивается доверительным собственником доверительном основателю, если иное не предусмотрено договором об установлении права доверительной собственности.
5. Доверительный собственник, обратил взыскание на объект доверительной собственности, направляет доверительном основателю и должнику, если он не является доверительным основателем, отчет о распределении средств от продажи объекта доверительной собственности.
6. Договором об установлении доверительной собственности может быть предусмотрен иной порядок обращения взыскания на объект доверительной собственности, минимальная цена продажи такого объекта доверительным собственником или право доверительного собственника получить объект доверительной собственности в свою собственность (без ограничений на пользование и распоряжения) в счет исполнения обязательств должника.
7. За счет объекта доверительной собственности доверительный собственник вправе удовлетворить в полном объеме свое требование, размер которой определяется на момент фактического удовлетворения, включая уплату процентов, неустойки, возмещение убытков, причиненных нарушением обязательства, и необходимых затрат на содержание объ объекта доверительной собственности, если иное не установлено договором.

Статья 597-9. Особенности обращения взыскания на жилые помещения
1. После принятия решения об обращении взыскания на жилое помещение, являющееся объектом доверительной собственности, все жители такого помещения обязаны по письменному требованию доверительного собственника или лица, получившего право собственности на помещение от доверительного собственника, освободить жилое помещение в течение десяти дней со дня получения такого требования. Если жители не освобождают жилое помещение в установленный настоящим Кодексом или другой согласованный сторонами срок, их принудительное выселение осуществляется на основании решения суда.

Статья 597-10. Обращение взыскания на объект доверительной собственности по требованию третьих лиц
1. Обращение взыскания на объект доверительной собственности по обязательствам доверительного собственника не допускается.
2. Кредитор должника, который полностью выполнил основное обязательство должника перед доверительным собственником, может требовать обращения взыскания на объект доверительной собственности по обязательствам доверительного основателя.

Статья 597-11. Прекращение доверительной собственности
1. В течение пяти рабочих дней со дня прекращения (в том числе в связи с его полным выполнением) основного обязательства доверительный собственник обязан передать право собственности на объект доверительной собственности доверительном основателю, если иное не определено договором об установлении доверительной собственности.
2. Передача права собственности на объект доверительной собственности в случае, установленном частью первой настоящей статьи, осуществляется в соответствии с актом приема-передачи, который подписывается доверительным собственником и лицом, которому передается объект доверительной собственности. Акт приема-передачи недвижимого объекта доверительной собственности подлежит нотариальному удостоверению.
3. Если, несмотря на полное выполнение должником своего обязательства, доверительный собственник уклоняется от заключения и нотариального удостоверения акта приема-передачи, должник или иное лицо, имеющее право на получение права собственности на объект доверительной собственности, вправе обратиться в суд с иском о признании своего права собственности на объект доверительной собственности или к нотариусу за совершением исполнительной надписи об истребовании объекта доверительной собственности в доверительного собственника.
4. По результатам отчуждения доверительным собственником объекта доверительной собственности (в результате обращения взыскания на такой объект или вследствие его передачи по акту приема-передачи доверительном основателю или иному лицу) у приобретателя возникает право собственности на такой объект, если иное не установлено законом или договором. Право собственности нового владельца на недвижимое имущество возникает с момента регистрации такого права в Государственном реестре прав на недвижимое имущество.

Статья 597-12. Уступка прав доверительного собственника
1. В случае уступки доверительным собственником своих прав по основному обязательству третьему лицу в такой третьего лица переходят права и обязанности доверительного собственника по договору об установлении доверительной собственности, если доверительный основатель дал согласие на такой переход и иное не указано в договоре о установление доверительной собственности. Подпись доверительного учредителя на заявлении о предоставлении согласия на переход права доверительной собственности подлежит нотариальному удостоверению.
2. Доверительная собственность у третьего лица (нового кредитора по основному обязательству) возникает с момента его регистрации в Государственном реестре прав на недвижимое имущество.

Статья 597-13. Приобретение имущества в доверительную собственность в интересах другого лица
1. Доверительная собственность может возникнуть на основании договора, согласно которому одна сторона за свой счет, но в интересах и по рекомендации другой стороны приобретает у третьего лица имущество в доверительную собственность. При этом сторона, которая приобрела имущество в доверительную собственность, получает право требования к лицу, по рекомендации которой состоялось приобретение, по уплате компенсации стоимости такого имущества и / или процентов за пользование чужими денежными средствами.
2. В случае, указанном в части первой этой статьи, лицо, которое приобрело имущество, приобретает права и обязанности доверительного собственника, а лицо, в интересах и по рекомендации которой было приобретено имущество, - доверительного основателя.
"""
GKU_g_50 = """ 
Глава 50 - Гражданского кодекса
Прекращение обязательства

Статья 598. Основания прекращения обязательств
1. Обязательство прекращается частично или в полном объеме на основаниях, установленных договором или законом.
2. Прекращение обязательства по требованию одной из сторон допускается лишь в случаях, установленных договором или законом.
3. Особенности прекращения обязательств по договорам купли-продажи ценных бумаг, заключенных на фондовой бирже, устанавливаются законодательством.
4. Законом могут быть установлены случаи, когда прекращение обязательств на определенных основаниях не допускается.

Статья 599. Прекращение обязательства выполнением
1. Обязательство прекращается выполнением, проведенным надлежащим образом.

Статья 600. Прекращение обязательства передачей отступного
1. Обязательство прекращается по согласию сторон вследствие передачи должником кредитору отступного (денег, другого имущества и т.п.). Размер, сроки и порядок передачи отступного устанавливаются сторонами.

Статья 601. Прекращение обязательства зачислением
1. Обязательство прекращается зачислением встречных однородных требований, срок выполнения которых наступил, а также требований, срок выполнения которых не установлен или определен моментом предъявления требования.
2. Зачисление встречных требований может осуществляться по заявлению одной из сторон.

Статья 602. Недопустимость зачисления встречных требований
1. Не допускается зачисление встречных требований:
о возмещении вреда, причиненного увечьем, другим повреждением здоровья или смертью;
о взыскании алиментов;
относительно пожизненного содержания (ухода);
в случае истечения исковой давности; 
4-1) по обязательствам, стороной которых является неплатежеспособный банк, кроме случаев, установленных законом;
в других случаях, установленных договором или законом.

Статья 603. Зачет в случае замены кредитора
1. В случае замены кредитора должник имеет право предъявить против требования нового кредитора свое встречное требование к первоначальному кредитору.
2. В случае замены кредитора зачет производится, если требование возникло на основании, существовавшем на момент получения должником письменного сообщения о замене кредитора, и срок требования настал до его получения или этот срок не установлен или определен моментом предъявления требования.
Если должник не был письменно уведомлен о замене кредитора, зачет проводится, если требование возникло на основании, которое существовало на момент предъявления должнику требования новым кредитором или, если должник исполнил свой долг до предъявления к нему требования новым кредитором, - на момент его выполнения.

Статья 604. Прекращение обязательства по договоренности сторон
1. Обязательство прекращается по договоренности сторон.
2. Обязательство прекращается по договоренности сторон о замене первоначального обязательства новым обязательством между теми же сторонами (новация).
3. Новация не допускается относительно обязательств о возмещении вреда, причиненного увечьем, другим повреждением здоровья или смертью, об уплате алиментов и в других случаях, установленных законом.
4. Новация прекращает дополнительные обязательства, связанные с первоначальным обязательством, если другое не установлено договором.

Статья 605. Прекращение обязательства прощением долга
1. Обязательство прекращается вследствие освобождения (прощения долга) кредитором должника от его обязанностей, если это не нарушает прав третьих лиц относительно имущества кредитора.

Статья 606. Прекращение обязательства объединением должника и кредитора в одном лице
1. Обязательство прекращается объединением должника и кредитора в одном лице.

Статья 607. Прекращение обязательства невозможностью его выполнение
1. Обязательство прекращается невозможностью его выполнения в связи с обстоятельствами, за которые ни одна из сторон не отвечает.

Статья 608. Прекращение обязательства смертью физического лица
1. Обязательство прекращается смертью должника, если оно неразрывно связано с его личностью и в связи с этим не может быть выполнено другим лицом.
2. Обязательство прекращается смертью кредитора, если оно неразрывно связано с личностью кредитора.

Статья 609. Прекращение обязательства ликвидацией юридического лица
1. Обязательство прекращается ликвидацией юридического лица (должника или кредитора), кроме случаев, если законом или другими нормативно-правовыми актами выполнения обязательства ликвидированного юридического лица полагается на другое юридическое лицо, в частности по обязательствам о возмещении вреда, причиненного увечьем, другим повреждением здоровья или смертью.
"""
GKU_g_51 = """ 
Глава 51 - Гражданского кодекса
Правовые последствия нарушения обязательства. Ответственность за нарушение обязательства

Статья 610. Нарушение обязательства
1. Нарушением обязательства является его невыполнение или выполнение с нарушением условий, определенных содержанием обязательства (ненадлежащее выполнение).

Статья 611. Правовые последствия нарушения обязательства
1. В случае нарушения обязательства наступают правовые последствия, установленные договором или законом, в частности:
прекращение обязательства вследствие одностороннего отказа от обязательства, если это установлено договором или законом, или разрыв договора;
изменение условий обязательства;
уплата неустойки;
возмещение убытков и морального вреда.

Статья 612. Просрочка должника
1. Должник считается просрочившим, если он не приступил к выполнению обязательства или не выполнил его в срок, установленный договором или законом.
2. Должник, который просрочил выполнение обязательства, отвечает перед кредитором за причиненные просрочкой убытки и за невозможность выполнения, которое случайно настало после просрочки.
3. Если вследствие просрочки должника выполнение обязательства потеряло интерес для кредитора, он может отказаться от принятия выполнения и требовать возмещения убытков.
4. Просрочка должника не наступает, если обязательство не может быть выполнено вследствие просрочки кредитора.

Статья 613. Просрочка кредитора
1. Кредитор считается просрочившим, если он отказался принять надлежащее выполнение, предложенное должником, или не совершил действий, установленных договором, актами гражданского законодательства ли вытекают из сути обязательства или обычаев делового оборота, до совершения которых должник не мог выполнить своей обязанности.
Кредитор также считается просрочившим, в случаях, установленных частью четвертой статьи 545 Гражданского кодекса Украины.
2. Если кредитор не совершил действия, до совершения которых должник не мог исполнить свой долг, выполнение обязательства может быть отсрочено на время просрочки кредитора.
3. Должник не имеет права на возмещение убытков, причиненных просрочкой кредитора, если кредитор докажет, что просрочка не является следствием его вины или лиц, на которых по закону или поручению кредитора было положено принятие исполнения.
4. Должник по денежным обязательствам не платит проценты за время просрочки кредитора.

Статья 614. Вина как основание ответственности за нарушение обязательства
1. Лицо, которое нарушило обязательства, несет ответственность при наличии его вины (умысла или неосторожности), если другое не установлено договором или законом.
Лицо является невиновным, если оно докажет, что предприняло все зависящие от него мероприятия по надлежащему выполнению обязательства.
2. Отсутствие своей вины доказывает лицо, которое нарушило обязательства.
3. Сделка, которой отменяется или ограничивается ответственность за умышленное нарушение обязательства, является никчемной.

Статья 615. Односторонний отказ от обязательства
1. В случае нарушения обязательства одной стороной вторая сторона имеет право частично или в полном объеме отказаться от обязательства, если это установлено договором или законом.
2. Односторонний отказ от обязательства не освобождает виновную сторону от ответственности за нарушение обязательства.
3. Вследствие одностороннего отказа от обязательства частично или в полном объеме соответственно изменяются условия обязательства или оно прекращается.

Статья 616. Правовые последствия нарушения обязательства по вине кредитора
1. Если нарушение обязательства произошло по вине кредитора, суд соответственно уменьшает размер убытков и неустойки, которые взимаются с должника.
2. Суд имеет право уменьшить размер убытков и неустойки, которые взимаются с должника, если кредитор преднамеренно или по неосторожности оказывал содействие увеличению размера убытков, причиненным нарушением обязательства, или не принял меры относительно их уменьшения.

Статья 617. Основания освобождения от ответственности за нарушение обязательства
1. Лицо, которое нарушило обязательства, освобождается от ответственности за нарушение обязательства, если оно докажет, что это нарушение произошло вследствие случая или непреодолимой силы.
Не считается случаем, в частности, несоблюдение своих обязанностей контрагентом должника, отсутствие на рынке товаров, нужных для выполнения обязательства, отсутствие у должника необходимых средств.

Статья 618. Ответственность должника за действия других лиц
1. Должник отвечает за нарушение обязательства другими лицами, на которые было возложено его исполнение (статья 528 Гражданского кодекса Украины), если договором или законом не установлена ответственность непосредственного исполнителя.

Статья 619. Субсидиарная ответственность
1. Договором или законом может быть предусмотрена рядом с ответственностью должника дополнительная (субсидиарная) ответственность другого лица.
2. К предъявлению требования лицу, которое несет субсидиарную ответственность, кредитор должен предъявить требование к основному должнику.
Если основной должник отказался удовлетворить требование кредитора или кредитор не получил от него в разумный срок ответа на предъявленное требование, кредитор может предъявить требование в полном объеме к лицу, которое несет субсидиарную ответственность.
3. Кредитор не может требовать удовлетворения своего требования от лица, которое несет субсидиарную ответственность, если это требование может быть удовлетворено путем зачисления встречного требования к основному должнику.
4. Лицо, которое несет субсидиарную ответственность, должно до удовлетворения требования, предъявленного ему кредитором, сообщить об этом основному должнику, а в случае предъявления иска, - подать ходатайство о привлечении основного должника к участию в деле.
В случае несоблюдения этих требований лицом, которое несет субсидиарную ответственность, основной должник имеет право выдвинуть против регресного требования лица, которое несет субсидиарную ответственность, возражения, которые он имел против кредитора.

Статья 620. Правовые последствия невыполнения обязанности передать вещь, определенную индивидуальными признаками
1. В случае невыполнения должником обязанности передать кредитору в собственность или в пользование вещь, определенную индивидуальными признаками, кредитор имеет право истребовать эту вещь у должника и требовать ее передачи соответственно условиям обязательства.
2. Кредитор теряет право на истребование у должника вещи, определенной индивидуальными признаками, в случае, если эта вещь уже передана третьему лицу в собственность или в пользование.
Если вещь, определенная индивидуальными признаками, еще не передана, преобладающее право на ее получение имеет тот из кредиторов, обязательство в пользу которого возникло раньше, а если это невозможно определить, - кредитор, который первым предъявил иск.

Статья 621. Выполнение обязательства за счет должника
1. В случае невыполнения должником для кредитора определенной работы или непредоставления ему услуги кредитор имеет право выполнить эту работу собственными силами или поручить ее выполнение или предоставление услуги третьему лицу и требовать от должника возмещения убытков, если другое не установлено договором, актами гражданского законодательства или не вытекает из сути обязательства.

Статья 622. Ответственность и выполнение обязательства в натуре
1. Должник, который уплатил неустойку и возместил убытки, причиненные нарушением обязательства, не освобождается от обязанности выполнить обязательства в натуре, если другое не установлено договором или законом.
2. В случае отказа кредитора от принятия выполнения, которое вследствие просрочки утратило для него интерес (статья 612 Гражданского кодекса Украины), или передачи отступного (статья 600 Гражданского кодекса Украины) должник освобождается от обязанности выполнить обязательство в натуре.
3. В случае отказа кредитора от договора (статья 615 Гражданского кодекса Украины) должник освобождается от обязанности выполнить обязательства в натуре.

Статья 623. Возмещение убытков, причиненным нарушением обязательства
1. Должник, который нарушил обязательства, должен возместить кредитору причиненные этим убытки.
2. Размер убытков, причиненных нарушением обязательства, досказывается кредитором.
3. Убытки определяются с учетом рыночных цен, существовавших на день добровольного удовлетворения должником требования кредитора в месте, где обязательство должно быть выполнено, а если требование не было удовлетворено добровольно, - в день предъявления иска, если другое не установлено договором или законом. Суд может удовлетворить требование о возмещении убытков, принимая во внимание рыночные цены, которые существовали на день принятия решения.
4. При определении неполученных доходов (упущенной выгоды) учитываются мероприятия, употребленные кредитором относительно их получения.

Статья 624. Убытки и неустойка
1. Если за нарушение обязательства установлена неустойка, то она подлежит взысканию в полном размере, независимо от возмещения убытков.
2. Договором может быть установлена обязанность возместить убытки лишь в той части, в которой они не покрыты неустойкой.
3. Договором может быть установлены взыскания неустойки без права на возмещение убытков или возможность по выбору кредитора взыскания неустойки или возмещения убытков.

Статья 625. Ответственность за нарушение денежного обязательства
1. Должник не освобождается от ответственности за невозможность выполнения им денежного обязательства.
2. Должник, который просрочил выполнение денежного обязательства, по требованию кредитора обязан уплатить сумму долга с учетом установленного индекса инфляции за все время просрочки, а также три процента годовых от просроченной суммы, если иной размер процентов не установлен договором или законом.
"""
GKU_g_52 = """ 
Глава 52 - Гражданского кодекса
Понятие и условия договора

Статья 626. Понятие и виды договора
1. Договором является договоренность двух или больше сторон, направленная на установление, изменение или прекращение гражданских прав и обязанностей.
2. Договор является односторонним, если одна сторона берет на себя обязанность перед второй стороной совершить определенные действия или воздержаться от них, а вторая сторона наделяется лишь правом требования, без возникновения встречной обязанности относительно первой стороны.
3. Договор является двусторонним, если правами и обязанностями наделенны обе стороны договора.
4. К договорам, которые заключаются более чем двумя сторонами (многосторонние договоры), применяются общие положения о договоре, если это не противоречит многостороннему характеру настоящих договоров.
5. Договор является возмездным, если другое не установлено договором, законом или не вытекает из сути договора.

Статья 627. Свобода договора
1. Согласно статье 6 Гражданского кодекса Украины стороны являются свободными в заключении договора, выборе контрагента и определении условий договора с учетом требований Гражданского кодекса Украины, других актов гражданского законодательства, обычаев делового оборота, требований разумности и справедливости.
2. В договорах с участием физического лица - потребителя учитываются требования законодательства о защите прав потребителей .

Статья 628. Содержание договора
1. Содержание договора составляют условия (пункты), определенные на усмотрение сторон и согласованные ними, и условия, которые являются обязательными согласно актам гражданского законодательства.
2. Стороны имеют право заключить договор, в котором помещаются элементы разных договоров (смешанный договор). К отношениям сторон в смешанном договоре применяются в соответствующих частях положения актов гражданского законодательства о договорах, элементы которых соодержатся в смешанном договоре, если другое не установлено договором или не вытекает из сути смешанного договора.

Статья 629. Обязательность договора
1. Договор является обязательным для выполнения сторонами.

Статья 630. Типичные условия договора
1. Договором может быть установлено, что его отдельные условия определяются согласно типовым условиям договоров определенного вида, обнародованным в установленном порядке.
2. Если в договоре не помещается ссылка на типичные условия, такие типичные условия могут применяться как обычай делового оборота, если они отвечают требованиям статьи 7 Гражданского кодекса Украины.

Статья 631. Срок договора
1. Сроком договора является время, на протяжении которого стороны могут осуществить свои права и выполнить свои обязанности согласно договору.
2. Договор вступает в силу с момента его заключения.
3. Стороны могут установить, что условия договора применяются к отношениям между ними, которые возникли до его заключения.
4. Окончание срока договора не освобождает стороны от ответственности за его нарушение, которое имело место во время действия договора.

Статья 632. Цена
1. Цена в договоре устанавливается по договоренности сторон.
В случаях, установленных законом, применяются цены (тарифы, ставки и т.п.), которые устанавливаются или регулируются уполномоченными органами государственной власти или органами местного самоуправления.
2. Изменение цены после заключения договора допускается лишь в случаях и на условиях, установленных договором или законом.
3. Изменение цены в договоре после его выполнения не допускается.
4. Если цена в договоре не установлена и не может быть определена исходя из его условий, она определяется исходя из обычных цен, которые сложились на аналогичные товары, работы или услуги на момент заключения договора.

Статья 633. Публичный договор
1. Публичным является договор, в котором одна сторона - предприниматель взяла на себя обязанность осуществлять продажу товаров, выполнение работ или предоставление услуг любому, кто к ней обратится (розничная торговля, перевозка транспортом общего пользования, услуги связи, медицинское, гостиничное, банковское обслуживание и т.п.).
2. Условия публичного договора устанавливаются одинаковыми для всех потребителей, кроме тех, кому по закону предоставлены соответствующие льготы.
3. Предприниматель не имеет право предоставлять преимущество одному потребителю перед другим относительно заключения публичного договора, если другое не установлено законом.
4. Предприниматель не имеет права отказаться от заключения публичного договора при наличии у него возможностей предоставления потребителю соответствующих товаров (работ, услуг).
В случае необоснованного отказа предпринимателя от заключения публичного договора он может возместить убытки, причиненные потребителю таким отказом.
5. Актами гражданского законодательства могут быть установлены правила, обязательные для сторон при заключении и выполнении публичного договора.
6. Условия публичного договора, которые противоречат части второй этой статьи и правилам, обязательным для сторон при заключении и выполнении публичного договора, являются никчемными.

Статья 634. Договор присоединения
1. Договором присоединения является договор, условия которого установлены одной из сторон в формулярах или других стандартных формах, который может быть заключен лишь путем присоединения второй стороны к предложенному договору в целом. Вторая сторона не может предложить свои условия договора.
2. Договор присоединения может быть изменен или разорван по требованию стороны, которая присоединилась, если она лишается прав, которые обычно имела, а также если договор исключает или ограничивает ответственность второй стороны за нарушение обязательства или содержит другие условия, явным образом обременительные для присоединившейся стороны. Присоединившаяся сторона может доказать, что она, выходя с своих интересов, не приняла бы этих условий при наличии у нее возможности принимать участие в определении условий договора.
3. Если требование об изменении или разрыве договора предъявлены стороной, которая присоединилось к нему в связи с осуществлением ею предпринимательской деятельности, сторона, которая предоставила договор для присоединения, может отказать в удовлетворении этих требований, если докажет, что сторона, которая присоединилась, знала или могла знать, на каких условиях она присоединилась к договору.

Статья 635. Предварительный договор
1. Предварительным является договор, стороны которого обязуются на протяжении определенного срока (в определенный срок) заключить договор в будущем (основной договор) на условиях, установленных предварительным договором.
Законом могут быть установлены ограничения относительно срока (времени), в который может быть заключен основной договор на основании предварительного договора.
Существенные условия основного договора, не установленные предварительным договором, согласовываются в порядке, установленном сторонами в предварительном договоре, если такой порядок не установлен актами гражданского законодательства.
Предварительный договор заключается в форме, установленной для основного договора, а если форма основного договора не установлена, - в письменной форме.
2. Сторона, которая необоснованно уклоняется от заключения договора, предусмотренного предварительным договором, должна возместить второй стороне убытки, причиненные просрочкой, если другое не установлено предварительным договором или актами гражданского законодательства.
3. Обязательство, установленное предварительным договором, прекращается, если основной договор не заключен на протяжении срока (в срок), установленного предварительным договором, или если ни одна из сторон не направит второй стороне предложение о его заключении
4. Договор о намерениях (протокол о намерениях и т.п.), если в нем нет волеизъявления сторон относительно предоставления ему силы предварительного договора, не считается предварительным договором.

Статья 636. Договор в пользу третьего лица
1. Договором в пользу третьего лица является договор, в котором должник обязан выполнить свой долг в пользу третьего лица, которое установлено или не установлено в договоре.
2. Выполнение договора в пользу третьего лица может требовать как лицо, которое заключило договор, так и третье лицо, в пользу которого предусмотрены выполнения, если другое не установлено договором или законом или не вытекает из сути договора.
3. С момента выражения третьим лицом намерения воспользоваться своим правом стороны не могут разорвать или изменить договор без согласия третьего лица, если другое не установлено договором или законом.
4. Если третье лицо отказалось от права, предоставленного ему на основании договора, сторона, которая заключила договор в пользу третьего лица, может сама воспользоваться этим правом, если другое не вытекает из сути договора.

Статья 637. Толкование условий договора
1. Толкование условий договора осуществляется согласно статье 213 Гражданского кодекса Украины.
2. В случае толкования условий договора могут учитываться также типичные условия (типичные договоры), даже если в договоре нет ссылки на эти условия.
"""
GKU_g_53 = """ 
Глава 53 - Гражданского кодекса
Заключение, изменение и расторжение договора

Статья 638. Заключение договора
1. Договор является заключенным, если стороны в надлежащей форме достигли согласия по всем важным условиям договора.
Важными условиями договора являются условия о предмете договора, условия, определенные законом как важные или являются необходимыми для договоров данного вида, а также все те условия, относительно которых по заявлению хотя бы одной из сторон может быть достигнуто соглашение.
2. Договор заключается путем предложения одной стороны заключить договор (оферты) и принятие предложения (акцепта) второй стороной.

Статья 639. Форма договора
1. Договор может быть заключен в любой форме, если требования относительно формы договора не установленные законом.
2. Если стороны договорились заключить договор в определенной форме, он считается заключенным с момента предоставления ему этой формы, даже если законом эта форма для данного вида договоров не требовалась.
Если стороны договорились заключить договор с помощью информационно-телекомуникационных систем, он считается составленным в письменной форме
3. Если стороны договорились заключить в письменной форме договор, относительно которого законом не установлена письменная форма, такой договор является заключенным с момента его подписания сторонами.
4. Если стороны договорились о нотариальном удостоверении договора, относительно которого законом не требуется нотариальное удостоверение, такой договор считается заключенным с момента его нотариального удостоверения. Договор о закупке, который заключается согласно Закону Украины "Об осуществлении государственных закупок", по требованию заказчика подлежит обязательному нотариальному удостоверению и считается заключенным с момента его нотариального удостоверения.

Статья 640. Момент заключения договора
1. Договор является заключенным с момента получения лицом, направившим предложение заключить договор, ответа о принятии этого предложения.
2. Если соответственно акту гражданского законодательства для заключения договора необходима также передача имущества или совершение другого действия, договор является заключенным с момента передачи соответствующего имущества или совершения определенного действия.
3. Договор, подлежащий нотариальному удостоверению, является заключенным с момента такого удостоверения.

Статья 641. Предложение заключить договор
1. Предложение заключить договор (оферту) может сделать любая из сторон будущего договора.
Предложение заключить договор должно содержать существенные условия договора и выражать намерение лица, его сделавшего, считать себя обязанным в случае его принятия.
2. Реклама или другие предложения, адресованные неопределенному кругу лиц, являются приглашением делать предложения заключить договор, если другое не указано в рекламе или других предложениях.
3. Предложение заключить договор может быть отозвано до момента или в момент его получения адресатом. Предложение заключить договор, полученное адресатом, не может быть отозвано на протяжении срока для ответа, если другое не указанно в предложении или не вытекает из его сути или обстоятельств, при которых оно было сделано.

Статья 642. Принятие предложения
1. Ответ лица, которому адресовано предложение заключить договор, про его принятие (акцепт) должен быть полным и безусловным.
2. Если лицо, получившее предложение заключить договор, в границах срока для ответа совершило действие согласно указанных в предложении условий договора (отгрузило товары, предоставило услуги, выполнило работы, уплатило соответствующую сумму денег и т.п.), которое удостоверяет его желание заключить договор, это действие является принятием предложения, если другого не указано в предложении заключить договор или не установлено законом.
3. Лицо, принявшее предложение, может отозвать свой ответ о его принятии, сообщив об этом лицу, сделавшему предложение заключить договор, до момента или в момент получения им ответа о принятии предложения.

Статья 643. Заключение договора по предложению, в котором указан срок для ответа
1. Если в предложении заключить договор указан срок для ответа, договор является заключенным, если лицо, сделавшее предложение, получило ответ о принятии предложения на протяжении этого срока.

Статья 644. Заключение договора по предложению, в котором не указан срок для ответа
1. Если предложение заключить договор сделано устно и в нем не указан срок для ответа, договор является заключенным, если лицо, которому было сделано предложение, немедленно заявило о его принятии.
2. Если предложение заключить договор, в котором не указан срок для ответа, сделано в письменной форме, договор является заключенным, если лицо, которое сделало предложение, получило ответ на протяжении срока, установленного актом гражданского законодательства, а если этот срок не установлен, - на протяжении нормально необходимого для этого времени.

Статья 645. Ответ о принятии предложения, полученного с опозданием
1. Если ответ о принятии предложения заключить договор получен с опозданием, лицо, сделавшее предложение, освобождается от соответствующих обязательств.
2. Если ответ о принятии предложения заключить договор было отправлено своевременно, но получено с опозданием, лицо, сделавшее предложение заключить договор, освобождается от соответствующих обязательств, если оно немедленно сообщило лицу, которому было направлено предложение, о получении ответа с опозданием.
Ответ, полученный с опозданием, является новым предложением.
3. По согласию лица, сделавшего предложение, договор может считаться заключенным независимо от того, что ответ о принятии предложения заключить договор был отправлен и (или) получен с опозданием.

Статья 646. Ответ о согласии заключить договор на других условиях
1. Ответ о согласии заключить договор на других, чем было предложено, условиях является отказом от полученного предложения и вместе с тем новым предложением лицу, которое сделало предшествующее предложение.

Статья 647. Место заключения договора
1. Договор является заключенным по местожительству физического лица или по местонахождению юридического лица, которое сделало предложение заключить договор, если другое не установлено договором.

Статья 648. Договор и правовые акты органов государственной власти, органов власти Автономной Республики Крым, органов местного самоуправления
1. Содержание договора, заключенного на основании правового акта органа государственной власти, органа власти Автономной Республики Крым, органа местного самоуправления, обязательного для сторон (стороны) договора, должно соответствовать этому акту.
2. Особенности заключения договора на основании правового акта органа государственной власти, органа власти Автономной Республики Крым, органа местного самоуправления устанавливаются актами гражданского законодательства.

Статья 649. Решение преддоговорных споров
1. Расхождения, возникшие между сторонами при заключении договора на основании правового акта органа государственной власти, органа власти Автономной Республики Крым, органа местного самоуправления и в других случаях, установленных законом, решаются судом.
2. Расхождения, которые возникли между сторонами при заключении договора не на основании правового акта органа государственной власти, органа власти Автономной Республики Крым, органа местного самоуправления, могут быть решены судом в случаях, установленных по договоренности сторон или законом.

Статья 650. Заключение договоров на биржах, аукционах, конкурсах
1. Особенности заключения договоров на биржах, аукционах, конкурсах и т.п. устанавливаются соответствующими актами гражданского законодательства.

Статья 651. Основания для изменения или расторжения договора
1. Изменение или расторжение договора допускается лишь по согласию сторон, если другое не установлено договором или законом.
2. Договор может быть изменен или расторгнут по решению суда на требование одной из сторон в случае существенного нарушения договора второй стороной и в других случаях, установленных договором или законом.
Существенным является такое нарушение стороной договора, если вследствие причиненного этим вреда вторая сторона в значительной мере лишается того, на что она рассчитывала при заключении договора.
3. В случае одностороннего отказа от договора в полном объеме или частично, если право на такой отказ установлено договором или законом, договор является соответственно расторгнутым или измененным.

Статья 652. Изменение или расторжение договора в связи с существенным изменением обстоятельств
1. В случае существенного изменения обстоятельств, которыми стороны руководствовались при заключении договора, договор может быть изменен или расторгнут по согласию сторон, если другое не установлено договором или не вытекает из сути обязательства.
Изменение обстоятельств является существенным, если они изменились настолько, что, если бы стороны могли это предусмотреть, они не заключили бы договор или заключили бы его на других условиях.
2. Если стороны не достигли согласия относительно приведения договора в соответствие с обстоятельствами, которые существенным образом изменились, или относительно его расторжения, договор может быть расторгнут, а из оснований, установленных частью четвертой этой статьи, - изменен по решению суда по требованию заинтересованной стороны при наличии одновременно таких условий:
в момент заключения договора стороны исходили из того, что такое изменение обстоятельств не настанет;
изменение обстоятельств обусловлено причинами, которые заинтересованная сторона не могла устранить после их возникновения при всей заботливости и осмотрительности, которые от нее требовались;
выполнение договора нарушило бы соотношение имущественных интересов сторон и лишило бы заинтересованную сторону того, на что она рассчитывала при заключении договора;
из сути договора или обычаев делового оборота не вытекает, что риск изменения обстоятельств несет заинтересованная сторона.
3. В случае расторжения договора вследствие существенного изменения обстоятельств суд, по требованию любой из сторон, определяет следствия разрыва договора исходя из необходимости справедливого распределения между сторонами затрат, понесенных ими в связи с выполнением настоящего договора.
4. Изменение договора в связи с важным изменением обстоятельств допускается по решению суда в исключительных случаях, если разрыв договора противоречит общественным интересам или повлечет для сторон вред, который значительно превышает затраты, необходимые для выполнения договора на условиях, измененных судом.

Статья 653. Правовые последствия изменения или расторжения договора
1. В случае изменения договора обязательства сторон изменяются соответственно измененным условиям относительно предмета, места, сроков выполнения и т.п.
2. В случае расторжения договора обязательства сторон прекращаются.
3. В случае изменения или расторжения договора обязательства изменяется или прекращается с момента достижения договоренности об изменении или расторжении договора, если другое не установлено договором ли не обусловлено характером его изменения. Если договор изменяется или расторгается в судебном порядке, обязательство изменяется или прекращается с момента обретения решением суда об изменении или расторжении договора законной силы.
4. Стороны не имеют права требовать возвращения того, что было выполнено ими по обязательству до момента изменения или расторжения договора, если другое не установлено договором или законом.
5. Если договор изменен или расторгнут в связи с важным нарушением договора одной из сторон, вторая сторона может требовать возмещения убытков, причиненных изменением или расторжением договора

Статья 654. Форма изменения или расторжения договора
1. Изменение или расторжения договора совершается в такой самой форме, как и договор, который изменяется или расторгается, если иное не установлено договором или законом или не вытекает из обычаев делового оборота.
"""
GKU_g_54 = """ 
Глава 54 - Гражданского кодекса
Купля-продажа

Параграф 1. Общие положения о купле-продаже

Статья 655. Договор купли-продажи
1. По договору купли-продажи одна сторона (продавец) передает или обязуется передать имущество (товар) в собственность второй стороне (покупателю), а покупатель принимает или обязуется принять имущество (товар) и уплатить за него определенную денежную сумму.

Статья 656. Предмет договора купли-продажи
1. Предметом договора купли-продажи может быть товар, который есть у продавца на момент заключения договора или будет создан (приобретен, получен) продавцом в будущем.
2. Предметом договора купли-продажи могут быть имущественные права. К договору купли-продажи имущественных прав применяются общие положения о купле-продаже, если другое не вытекает из содержания или характера этих прав.
3. Предметом договора купли-продажи может быть право требования, если требование не имеет личного характера. К договору купли-продажи права требования применяются положения об уступке права требования, если другое не установлено договором или законом.
4. К договору купли-продажи на биржах, конкурсах, аукционах (публичных торгах), договора купли-продажи валютных ценностей и ценных бумаг применяются общие положения о купле-продаже, если другое не установлено законом об этих видах договоров купли-продажи или не вытекает из их сути.
5. Особенности договора купли-продажи отдельных видов имущества могут устанавливаться законом.

Статья 657. Форма отдельных видов договоров купли-продажи
1. Договор купли-продажи земельного участка, единого имущественного комплекса, жилого дома (квартиры) или другого недвижимого имущества укладывается в письменной форме и подлежит нотариальному удостоверению и государственной регистрации кроме договоров купли-продажи имущества, находящегося в имущественном залоге.

Статья 658. Право продажи товара
1. Право продажи товара, кроме случаев принудительной продажи и других случаев, установленных законом, принадлежит собственнику товара. Если продавец товара не является его собственником, покупатель приобретает право собственности лишь в случае, если собственник не имеет права требовать его возвращения.

Статья 659. Обязанность продавца предупредить покупателя о правах третьих лиц на товар
1. Продавец обязан предупредить покупателя обо всех правах третьих лиц на продаваемый товар (права нанимателя, право залога, право пожизненного пользования и т.п.). В случае невыполнения этого требования покупатель имеет право требовать снижения цены или расторжения договора купли-продажи, если он не знал и не мог знать о правах третьих лиц на товар

Статья 660. Обязанности покупателя и продавца в случае предъявления третьим лицом иска об истребовании товара
1. Если третье лицо на основаниях, которые возникли до продажи товара, предъявит к покупателю иск об истребовании товара, покупатель должен сообщить об этом продавцу и подать ходатайство о привлечении его к участию в деле. Продавец должен вступить в дело на стороне покупателя
2. Если покупатель не сообщил продавцу о предъявлении третьим лицом иска об истребовании товара и не подал ходатайства о привлечении продавца к участию в деле, продавец не отвечает перед покупателем, если продавец докажет, что, приняв участие в деле, он мог бы предотвратить отчуждение проданного товара у покупателя.
3. Если продавец был привлечен к участию в деле, но уклонился от участия в его рассмотрении, он не имеет право доказывать неправильность ведения дела покупателем.

Статья 661. Ответственность продавца в случае отсуживания товара у покупателя
1. В случае изъятия по решению суда товара у покупателя в пользу третьего лица на основаниях, которые возникли до продажи товара, продавец может возместить покупателю причиненные ему убытки, если покупатель не знал или не мог знать о наличии этих оснований.
2. Сделка относительно освобождения продавца от ответственности или относительно ее ограничения в случае истребования товара у покупателя третьим лицом является ничтожной.

Статья 662. Обязанность продавца передать товар покупателю
1. Продавец обязан передать покупателю товар, определенный договором купли-продажи.
2. Продавец должен одновременно с товаром передать покупателю его принадлежности и документы (технический паспорт, сертификат качества и т.п.), которые касаются товара и подлежат передаче вместе с товаром согласно договору или актов гражданского законодательства.

Статья 663. Срок выполнения обязанности передать товар
1. Продавец обязан передать товар покупателю в срок, установленный договором купли-продажи, а если содержание договора не дает возможности определить этот срок, - согласно положениям статьи 530 Гражданского кодекса Украины.

Статья 664. Момент выполнения обязанности продавца передать товар
1. Обязанность продавца передать товар покупателю считается выполненной в момент:
вручения товара покупателю, если договором установлена обязанность продавца доставить товар;
предоставления товара в распоряжение покупателя, если товар может быть передан покупателю по местонахождению товара.
Договором купли-продажи может быть установлен другой момент выполнения продавцом обязанности передать товар.
Товар считается предоставленным в распоряжение покупателя, если в срок, установленный договором, он готов к передаче покупателю в надлежащем месте и покупатель проинформирован об этом. Готовый к передаче товар должен быть соответствующим образом идентифицирован для целей настоящего договора, в частности путем маркирования.
2. Если из договора купли-продажи не вытекает обязанность продавца доставить товар или передать товар в его местонахождении, обязанность продавца передать товар покупателю считается выполненной в момент сдачи товара перевозчику или организации связи для доставки покупателю.

Статья 665. Правовые следствия отказа продавца передать товар
1. В случае отказа продавца передать проданный товар покупатель имеет право отказаться от договора купли-продажи.
2. Если продавец отказался передать вещь, определенную индивидуальными признаками, покупатель имеет право предъявить продавцу требования согласно статье 620 Гражданского кодекса Украины.

Статья 666. Правовые следствия невыполнения продавцом обязанности передать принадлежности товара и документы, которые касаются товара
1. Если продавец не передает покупателю принадлежности товара и документы, которые касаются товара и подлежат передаче вместе с товаром согласно договору купли-продажи или актов гражданского законодательства, покупатель имеет право установить разумный срок для их передачи.
2. Если принадлежности товара или документы, которые касаются товара, не переданы продавцом в установленный срок, покупатель имеет право отказаться от договора купли-продажи и возвратить товар продавцу.

Статья 667. Обязанность продавца сохранять проданный товар
1. Если право собственности переходит к покупателю раньше передачи товара, продавец обязан до передачи сохранять товар, не допуская его ухудшения. Необходимые для этого затраты покупатель обязан возместить продавцу, если другое не установлено договором.

Статья 668. Переход риска случайного уничтожения или случайного повреждения товара
1. Риск случайного уничтожения или случайного повреждения товара переходит к покупателю с момента передачи ему товара, если другое не установлено договором или законом.
2. Риск случайного уничтожения или случайного повреждения товара, проданного во время его транспортирования, переходит к покупателю с момента заключения договора купли-продажи, если другое не установлено договором или обычаями делового оборота.
3. Условие договора купли-продажи о том, что риск случайного уничтожения или случайного повреждения товара переходит к покупателю с момента сдачи товара первому перевозчику, по требованию покупателя может быть признано судом недействительным, если в момент заключения договора продавец знал или мог знать, что товар утрачен или поврежден, но не сообщил об этом покупателю.

Статья 669. Количество товара
1. Количество продаваемого товара устанавливается в договоре купли-продажи в соответствующих единицах измерения или денежном выражении.
2. Условие относительно количества товара может быть согласовано путем установления в договоре купли-продажи порядка определения этого количества.

Статья 670. Правовые последствия нарушения условия договора относительно количества товара
1. Если продавец передал покупателю меньшее количество товара, чем это установлено договором купли-продажи, покупатель имеет право требовать передачи количества товара, которого не хватает, или отказаться от переданного товара и его оплаты, а если он оплачен, - требовать возвращения уплаченной за него денежной суммы.
2. Если продавец передал покупателю большее количество товара, чем это установлено договором купли-продажи, покупатель обязан сообщить об этом продавцу. Если в разумный срок после получения такого сообщения продавец не распорядится товаром, покупатель имеет право принять весь товар, если другое не установлено договором.
3. Если покупатель принял большее количество товара, чем это установлено договором купли-продажи, он обязан оплатить дополнительно принятый товар по цене, установленной для товара, принятого согласно договору, если другая цена не установлена по договоренности сторон.

Статья 671. Ассортимент товара
1. Если по договору купли-продажи передаче подлежит товар в определенном соотношении по видам, моделями, размерами, цветам или другими признакам (ассортимент), продавец обязан передать покупателю товар в ассортименте, согласованном сторонами.
2. Если договором купли-продажи ассортимент товара не установлен или ассортимент не был определен в порядке, установленном договором, но из сути обязательства вытекает, что товар подлежит передаче покупателю в ассортименте, продавец имеет право передать покупателю товар в ассортименте исходя из потребностей покупателя, которые были известны продавцу на момент заключения договора, или отказаться от договора.

Статья 672. Правовые последствия нарушения условия договора относительно ассортимента товара
1. Если продавец передал товар в ассортименте, который не отвечает условиям договора купли-продажи, покупатель имеет право отказаться от его принятия и оплаты, а если он уже оплачен, - требовать возвращения уплаченной за него денежной суммы.
2. Если продавец передал покупателю часть товара, ассортимент которого отвечает условиям договора купли-продажи, и часть товара с нарушением ассортимента, покупатель имеет право на свой выбор:
принять часть товара, который отвечает условиям договора, и отказаться от остатка товара;
отказаться от всего товара;
требовать замены части товара, который не отвечает ассортименту, товаром в ассортименте, который установлен договором;
принять весь товар.
3. В случае отказа от товара, ассортимент которого не отвечает условиям договора купли-продажи, или предъявления требования о замене этого товара покупатель имеет право отказаться от оплаты этого товара, а если он уже оплачен, - требовать возвращения уплаченной за него денежной суммы.
4. Товар, ассортимент которого не отвечает условиям договора купли-продажи, является принятым, если покупатель в разумный срок после его получения не сообщил продавцу о своем отказе от него.
5. Если покупатель не отказался от товара, ассортимент которого не отвечает условиям договора купли-продажи, он обязан оплатить его по цене, согласованной с продавцом.
Если продавец не принял необходимые меры относительно согласования цены в разумный срок, покупатель оплачивает товар по цене, которая на момент заключения договора купли-продажи применялась относительно аналогичного товара.

Статья 673. Качество товара
1. Продавец должен передать покупателю товар, качество которого отвечает условиям договора купли-продажи.
2. В случае отсутствия в договоре купли-продажи условий относительно качества товара продавец обязан передать покупателю товар, пригодный для цели, с которой товар такого рода обычно используется.
Если продавец при заключении договора купли-продажи был уведомлен покупателем о конкретной цели приобретения товара, продавец должен передать покупателю товар, пригодный для использования согласно этой цели.
3. В случае продажи товара по образцу и (или) по описанию продавец должен передать покупателю товар, который отвечает образцу и (или) описанию.
4. Если законом установлены требования относительно качества товара, продавец обязан передать покупателю товар, который отвечает этим требованиям.
Продавец и покупатель могут договориться о передаче товара повышенного качества сравнительно с требованиями, установленными законом.

Статья 674. Подтверждение соответствия товара требованиям законодательства
1. Соответствие товара требованиям законодательства подтверждается способом и в порядке, установленными законом и другими нормативно-правовыми актами.

Статья 675. Гарантии качества товара
1. Товар, который продавец передает или обязан передать покупателю, может отвечать требованиям относительно его качества в момент его передачи покупателю, если другой момент определения соответствия товара этим требованиям не установлен договором купли-продажи.
2. Договором или законом может быть установлен срок, на протяжении которого продавец гарантирует качество товара (гарантийный срок).
3. Гарантия качества товара распространяется на все комплектующие изделия, если другое не установлено договором.

Статья 676. Вычисление гарантийного срока
1. Гарантийный срок начинается из момента передачи товара покупателю, если другое не установлено договором купли-продажи.
2. Гарантийный срок, установленный договором купли-продажи, продолжается на время, на протяжении которого покупатель не мог использовать товар в связи с обстоятельствами, которые зависят от продавца, до устранения их продавцом.
Гарантийный срок продолжается на время, на протяжении которого товар не мог использоваться в связи с выявленными в нем недостатками, при условии сообщения об это продавцу в порядке, установленном статьей 688 Гражданского кодекса Украины.
3. Гарантийный срок на комплектующее изделие равняется гарантийному сроку на основное изделие и начинает истекать одновременно с ним.
4. В случае замены товара (комплектующего изделия) ненадлежащего качества на товар (комплектующее изделие), что отвечает условиям договора купли-продажи, гарантийный срок на него начинает истекать с момента замены.

Статья 677. Срок пригодности товара
1. Законом или другими нормативно-правовыми актами может быть установлен срок, по истечению которого товар считается непригодным для использования по назначению (срок пригодности).
2. Срок пригодности товара определяется периодом времени, которое вычисляется со дня его изготовления и на протяжении которого товар является пригодным для использования, или сроком (датой), до наступления которого товар является пригодным для использования.
3. Продавец обязан передать покупателю товар, на который установлен срок пригодности, с таким расчетом, чтобы он мог быть использован по назначению до истечения этого срока.

Статья 678. Правовые последствия передачи товара ненадлежащего качества
1. Покупатель, которому передан товар ненадлежащего качества, имеет право, независимо от возможности использования товара по назначению, требовать от продавца по своему выбору:
пропорционального уменьшения цены;
безвозмездного устранения недостатков товара в разумный срок;
возмещения затрат на устранение недостатков товара.
2. В случае существенного нарушения требований относительно качества товара (выявление недостатков, которые нельзя устранить, недостатков, устранение которых связано с непропорциональными затратами или затратами времени, недостатков, которые проявились неоднократно ли появились снова после их устранения) покупатель имеет право по своему выбору:
отказаться от договора и требовать возвращения уплаченной за товар денежной суммы;
требовать замены товара.
3. Если продавец товара ненадлежащего качества не является его изготовителем, требования относительно замены, безвозмездного устранения недостатков товара и возмещение убытков могут быть предъявлены к продавцу или изготовителю товара.
4. Положения этой статьи применяются, если другое не установлено этим Кодексом или другим законом.

Статья 679. Недостатки товара, за которые отвечает продавец
1. Продавец отвечает за недостатки товара, если покупатель докажет, что они возникли до передачи товара покупателю или по причине, которые существовало до этого момента.
2. Если продавцом предоставлены гарантии относительно качества товара, продавец отвечает за его недостатки, если он не докажет, что они возникли после его передачи покупателю вследствие нарушения покупателем правил использования или сохранения товара, действий третьих лиц, случая или непреодолимой силы.

Статья 680. Сроки выявления недостатков и предъявление требований в связи с недостатками проданного товара
1. Покупатель имеет право предъявить требование в связи с недостатками товара при условии, что недостатки выявлены в сроки, установленные этой статьей, если другое не установлено договором или законом.
2. Если на товар не установлен гарантийный срок или срок пригодности, требование в связи с его недостатками может быть предъявлено покупателем при условии, что недостатки были выявлены на протяжении разумного срока, но в границах двух лет, а относительно недвижимого имущества
- в границах трех лет со дня передачи товара покупателю, если договором или законом не установлен больший срок.
Если установить день передачи недвижимого имущества невозможно или если покупатель владел недвижимым имуществом до заключения договора, указанные сроки вычисляются со дня заключения договора.
Срок для выявления недостатков товара, который перевозился или был отправлен по почте, вычисляется со дня получения товара в месте назначения.
3. Если на товар установлен гарантийный срок, покупатель имеет право предъявить требование в связи с недостатками товара, которые были выявлены на протяжении этого срока.
Если на комплектующее изделие установлен гарантийный срок меньшей продолжительности, чем на основное изделие, покупатель имеет право предъявить требование в связи с недостатками комплектующего изделия, если эти недостатки были выявлены на протяжении гарантийного срока на основное изделие.
Если на комплектующее изделие установлен гарантийный срок большей продолжительности, чем гарантийный срок на основное изделие, покупатель имеет право предъявить требование в связи с недостатками товара, если недостатки в комплектующем изделии выявлены на протяжении гарантийного срока на него, независимо от истечения гарантийного срока на основное изделие.
4. Покупатель имеет право предъявить требование в связи с недостатками товара, на который установленный срок пригодности, если они выявлены на протяжении срока пригодности товара.
5. Если недостатки товара выявленные покупателем после истечения гарантийного срока или срока пригодности, продавец несет ответственность, если покупатель докажет, что недостатки товара возникли до передачи ему товара или по причине, которые существовали до этого момента.

Статья 681. Исковая давность, которая применяется к требованиям в связи с недостатками проданного товара
1. К требованиям в связи с недостатками проданного товара применяется исковая давность в один год, которая исчисляется со дня выявления недостатков в границах сроков, установленных статьей 680 Гражданского кодекса Украины, а если на товар установлен гарантийный срок (срок годности), - со дня выявления недостатков в границах гарантийного срока (срока годности).

Статья 682. Комплектность товара
1. Продавец обязан передать покупателю товар, который отвечает условию договора купли-продажи относительно комплектности.
2. Если договором купли-продажи не установлены условия относительно комплектности товара, продавец обязан передать покупателю товар, комплектность которого определяется обычаями делового оборота или другими принятыми требованиями.

Статья 683. Комплект товара
1. Если договором купли-продажи установлена обязанность продавца передать покупателю определенный набор товара в комплекте (комплект товара), обязательство является выполненным с момента передачи продавцом всего товара, включенного в комплект.
2. Продавец обязан передать весь товар, который входит в комплект, одновременно, если другое не установлено договором или не вытекает из сути обязательства.

Статья 684. Правовые последствия передачи некомплектного товара
1. В случае передачи некомплектного товара покупатель имеет право требовать от продавца по своему выбору:
пропорционального уменьшения цены;
доукомплектование товара в разумный срок.
2. Если продавец в разумный срок не доукомплектовал товар, покупатель имеет право по своему выбору:
требовать замены некомплектного товара на комплектный;
отказаться от договора и требовать возвращения уплаченной денежной суммы.
3. Последствия, предусмотренные частями первой и второй этой статьи, применяются также в случае нарушения продавцом обязанности передать покупателю комплект товара (статья 683 Гражданского кодекса Украины), если другое не установлено договором или не вытекает из сути обязательства.

Статья 685. Тара и упаковка по договору купли-продажи
1. Продавец обязан передать покупателю товар в таре и (или) в упаковке, если другое не установлено договором купли-продажи или не вытекает из сути обязательства.
Обязанность передачи товара в таре и (или) в упаковке не распространяется на товары, которые по своему характеру не нуждаются в применения тары и (или) упаковки.
2. Товар должен быть передан в таре и (или) упакован обычным для него способом в упаковку, а из-за их отсутствия - способом, который обеспечивает сохранность товара этого рода при обычных условиях сохранения и транспортирования, если договором купли-продажи не установлены требования относительно тары и (или) упаковки.
3. Продавец, который осуществляет предпринимательскую деятельность, обязан передать покупателю товар в таре и (или) в упаковке, которые отвечают требованиям, установленным актами гражданского законодательства.

Статья 686. Правовые последствия передачи товара с нарушением требования о таре и (или) упаковки
1. Если продавец передал покупателю товар без тары и (или) упаковки или в ненадлежащих таре и (или) упаковке, покупатель имеет право требовать от продавца передачи товара в надлежащих таре и (или) упаковке или замены ненадлежащих тары и (или) упаковки, если другое не вытекает из сути обязательства или характера товара, или предъявить к нему другие требования, которые вытекают из передачи товара ненадлежащего качества (статья 678 Гражданского кодекса Украины).

Статья 687. Проверка соблюдения продавцом условий договора купли-продажи
1. Проверка соблюдения продавцом условий договора купли-продажи относительно количества, ассортимента, качества, комплектности, тары и (или) упаковки товара и других условий осуществляется в случаях и в порядке, установленных договором или актами гражданского законодательства.
Если нормативно-правовыми актами по вопросам стандартизации установлены требования относительно порядка проверки количества, ассортимента, качества, комплектности, тары и (или) упаковки товара, порядок проверки, определенный договором, может отвечать этим требованиям.
2. Если порядок проверки соблюдения продавцом условий договора купли-продажи не установлен соответственно части первой этой статьи, проверка осуществляется согласно обычаям делового оборота или требований, которые обычно применяются в таких случаях.
3. Обязанность проверять количество, ассортимент, качество, комплектность, тару и (или) упаковку товара (испытание, анализ, обзор и т.п.) может быть возложена на продавца согласно договору купли-продажи, актов гражданского законодательства и нормативно-правовых актов по вопросам стандартизации. В этом случае продавец должен по требованию покупателя предоставить ему доказательства проведения такой проверки.
4. Проверка соблюдения условий договора купли-продажи относительно предмета договора продавцом и покупателем может осуществляться на одних и одних и тех же условиях.

Статья 688. Сообщение продавцу о нарушении условий договора купли-продажи
1. Покупатель обязан сообщить продавцу о нарушении условий договора купли-продажи относительно количества, ассортимента, качества, комплектности, тары и (или) упаковки товара в срок, установленный договором или актами гражданского законодательства, а если такой срок не установлен, - в разумный срок после того, как нарушение могло быть выявлено согласно характеру и назначению товара.
В случае невыполнения покупателем этой обязанности продавец имеет право частично или в полном объеме отказаться от удовлетворения соответствующих требований покупателя, если продавец докажет, что невыполнение покупателем обязанности сообщить продавцу о нарушении условий договора купли-продажи послужило причиной невозможности удовлетворения его требований или повлекли для продавца затраты, которые превышают его затраты в случае своевременного сообщения о нарушении условий договора.
2. Если продавец знал или мог знать о том, что переданный покупателю товар не отвечает условиям договора купли-продажи, он не имеет права ссылаться на то, что не получил от покупателя сообщения о нарушении условий договора, и на последствия невыполнения покупателем этой обязанности, установленные частью первой этой статьи.

Статья 689. Обязанность покупателя принять товар
1. Покупатель обязан принять товар, кроме случаев, если он имеет право требовать замену товара или имеет право отказаться от договора купли-продажи.
2. Покупатель обязан совершить действия, которые согласно требованиям, которые обычно предъявляются с стороны для обеспечения передачи и получения товара, если другое не установлено договором или актами гражданского законодательства.

Статья 690. Сохранение товара, не принятого покупателем
1. Если покупатель (получатель) отказался от принятия товара, переданного продавцом, он обязан обеспечить сохранность этого товара, немедленно сообщив об этом продавцу.
2. Продавец обязан забрать (вывезти) товар, не принятый покупателем (получателем), или распорядиться им в разумный срок.
Если продавец в этот срок не распорядится товаром, покупатель имеет право реализовать товар или возвратить его продавцу.
3. Затраты покупателя в связи с сохранением товара, его реализацией или возвращением продавцу подлежат возмещению продавцом. При этом суммы, полученные от реализации товара, передаются продавцу за вычетом сумм, которые принадлежат покупателю.
4. Если покупатель без достаточных оснований медлит с принятием товара или отказывается его принять, продавец имеет право требовать от него принять и оплатить товар или имеет право отказаться от договора купли-продажи.

Статья 691. Цена товара
1. Покупатель обязан оплатить товар по цене, установленной в договоре купли-продажи, или, если она не установлена в договоре и не может быть определена исходя из его условий, - по цене, которая определяется согласно статье 632 Гражданского кодекса Украины, а также совершить за свой счет действия, которые согласно договору, актов гражданского законодательства или требований, которые обычно применяются, необходимые для осуществления платежа.
2. Если цена установлена в зависимости от веса товара, она определяется по весу нетто, если другое не установлено договором купли-продажи.
3. Если договором купли-продажи установлено, что цена товара подлежит изменению в зависимости от показателей, которые предопределяют цену товара (себестоимость, затраты и т.п.), но при этом не определен способ ее просмотра, цена определяется исходя из соотношения этих показателей на момент заключения договора и на момент передачи товара.
Если продавец просрочил выполнение обязанности относительно передачи товара, цена определяется исходя из соотношения этих показателей на момент заключения договора и на день передачи товара, установленный в договоре, а если такой день не установлен договором, - на день, определенный согласно статье 530 Гражданского кодекса Украины.
Положения этой части об определении цены товара применяются, если другое не установлено актами гражданского законодательства или не вытекает из сути обязательства.

Статья 692. Оплата товара
1. Покупатель обязан оплатить товар после его принятия или принятия товарораспорядительных документов на него, если договором или актами гражданского законодательства не установлен другой срок оплаты товара.
2. Покупатель обязан уплатить продавцу полную цену переданного товара. Договором купли-продажи может быть предусмотрена рассрочка платежа.
3. В случае просрочки оплаты товара продавец имеет право требовать оплаты товара и уплаты процентов за пользование чужими денежными средствами.
4. Если покупатель отказался принять и оплатить товар, продавец имеет право по своему выбору требовать оплаты товара или отказаться от договора купли-продажи.
5. Если продавец обязан передать покупателю кроме неоплаченного также другой товар, он имеет право остановить передачу этого товара до полной оплаты всего прежде переданного товара, если другое не установлено договором или актами гражданского законодательства.

Статья 693. Предшествующая оплата товара
1. Если договором установлена обязанность покупателя частично или полностью оплатить товар до его передачи продавцом (предшествующая оплата), покупатель должен осуществить оплату в срок, установленный договором купли-продажи, а если такой срок не установлен договором, - в срок, определенный согласно статье 530 Гражданского кодекса Украины.
В случае невыполнения покупателем обязанности относительно предшествующей оплаты товара применяются положения статьи 538 Гражданского кодекса Украины.
2. Если продавец, получивший сумму предшествующей оплаты товара, не передал товар в установленный срок, покупатель имеет право требовать передачи оплаченного товара или возвращения суммы предшествующей оплаты.
3. На сумму предшествующей оплаты начисляются проценты согласно статье 536 Гражданского кодекса Украины со дня, когда товар должен был быть передан, до дня фактической передачи товара покупателю или возвращения ему суммы предшествующей оплаты. Договором может быть установлена обязанность продавца платить проценты на сумму предшествующей оплаты со дня получения этой суммы от покупателя.

Статья 694. Продажа товара в кредит
1. Договором купли-продажи может быть предусмотрена продажа товара в кредит с отсрочкой или с рассрочкой платежа.
2. Товар продается в кредит по ценам, которые действуют на день продажи. Изменение цены на товар, проданный в кредит, не является основанием для проведения перерасчета, если другое не установлено договором или законом.
3. В случае невыполнения продавцом обязанности относительно передачи товара, проданного в кредит, применяются положения статьи 665 Гражданского кодекса Украины.
4. Если покупатель просрочил оплату товара, проданного в кредит, продавец имеет право требовать возвращения неоплаченного товара.
5. Если покупатель просрочил оплату товара, на просроченную сумму начисляются проценты согласно статье 536 Гражданского кодекса Украины со дня, когда товар должен был быть оплачен, до дня его фактической оплаты.
Договором купли-продажи может быть предусмотрена обязанность покупателя платить проценты на сумму, которая отвечает цене товара, проданного в кредит, начиная со дня передачи товара продавцом.
6. С момента передачи товара, проданного в кредит, и до его оплаты продавцу приналежит право залога на этот товар.

Статья 695. Особенности оплаты товара с рассрочкой платежа
1. Договором о продаже товара в кредит может быть предусмотрена оплата товара с рассрочкой платежа. Важными условиями договора о продаже товара в кредит с условием о рассрочке платежа является цена товара, порядок, сроки и размеры платежей.
2. Если покупатель не осуществил в установленный договором срок очередного платежа за проданный с рассрочкой платежа и переданный ему товар, продавец имеет право отказаться от договора и требовать возвращения проданного товара.
3. К договору о продаже товара в кредит с условием о рассрочке платежа применяются положения частей третьей, пятой и шестой статьи 694 Гражданского кодекса Украины.

Статья 696. Страхование товара
1. Договором может быть установлена обязанность продавца или покупателя страховать товар.
2. Если сторона, которая обязана страховать товар, не застраховала его, вторая сторона имеет право застраховать товар и требовать возмещения затрат на страхование или отказаться от договора.

Статья 697. Сохранение права собственности за продавцом
1. Договором может быть установлено, что право собственности на переданный покупателю товар сохраняется за продавцом до оплаты товара или наступления других обстоятельств. В этом случае покупатель не имеет права до перехода к нему права собственности распоряжаться товаром, если другое не установлено договором, законом или не вытекает из назначения и свойств товара.
2. Если покупатель просрочил оплату товара, продавец имеет право требовать от него возвращения товара. Продавец имеет право требовать от покупателя возвращения товара также в случае ненаступления обстоятельств, за которые право собственности на товар должно было перейти к покупателю.

Параграф 2. Розничная купля-продажа

Статья 698. Договор розничной купли-продажи
1. По договору розничной купли-продажи продавец, который осуществляет предпринимательскую деятельность по продаже товара, обязуется передать покупателю товар, который обычно назначается для личного, домашнего или другого использования, не связанного с предпринимательской деятельностью, а покупатель обязуется принять товар и оплатить его.
2. Договор розничной купли-продажи является публичной сделкой.
3. К отношениям по договору розничной купли-продажи с участием покупателя-физического лица, не урегулированных этим Кодексом, применяется законодательство о защите прав потребителей.
4. Условия договора, которые ограничивают права покупателя-физического лица сравнительно с правами, установленными этим Кодексом и законодательством о защите прав потребителей, являются ничтожными.
5. Покупатель имеет право на возмещение убытков, причиненных ему продавцом вследствие использования им преимуществ своего положения в производственной или торговой деятельности.

Статья 699. Публичное предложение заключить договор купли-продажи
1. Предложение товара в рекламе, каталогах, а также других описаниях товара, обращенных к обозначенному кругу лиц, является публичным предложением заключить договор, если она содержит все важные условия договора.
2. Выставление товара, демонстрация его образцов или предоставление сведений о товаре (описаний, каталогов, фотоснимков и т.п.) в местах его продажи является публичным предложением заключить договор независимо от того указана ли цена и прочие важные условия договора купли-продажи, кроме случаев, если продавец явным образом определил, что соответствующий товар не предназначен для продажи.

Статья 700. Предоставление покупателю информации о товаре
1. Продавец обязан предоставить покупателю необходимую и достоверную информацию о товаре, который предлагается к продаже. Информация должна отвечать требованиям закона и правилам розничной торговли относительно ее содержания и способов предоставления.
2. Покупатель имеет право до заключения договора купли-продажи осмотреть товар, требовать проведения в его присутствия проверки свойств товара или демонстрации пользования товаром, если это не исключено характером товара и не противоречит правилам розничной торговли.
3. Если покупателю не предоставлена возможность немедленно получить полную и достоверную информацию о товаре в месте его продажи, он имеет право требовать возмещения убытков, причиненных необоснованным уклонением от заключения договора, а если договор заключен, - в разумный срок отказаться от договора, потребовать возвращения уплаченной за товар денежной суммы и возмещения убытков, а также морального ущерба.
4. Продавец, который не предоставил покупателю возможности получить полную и достоверную информацию о товаре, несет ответственность за недостатки товара, которые возникли после передачи ее покупателю, если покупатель докажет, что они возникли в связи с отсутствием у него такой информации.

Статья 701. Договор с условием о принятии покупателем товара в установленный срок
1. Стороны могут заключить договор купли-продажи с условием о принятии покупателем товара в срок, установленный договором, и на протяжении этого срока товар не может быть продан продавцом другому покупателю.
2. Если покупатель не появился или не совершил других необходимых действий для принятия товара в установленный срок, считается, что покупатель отказался от договора, если другое не установлено договором.
3. Дополнительные затраты продавца на обеспечение передачи товара покупателю в установленный срок включаются в цену товара, если другое не установлено договором или актами гражданского законодательства.

Статья 702. Продажа товара по образцу
1. Стороны могут заключить договор купли-продажи товара на основании ознакомления покупателя с образцом товара (с описанием, каталогом и т.п.).
2. Договор купли-продажи товара по образцу является выполненным с момента доставки товара в место, установленное договором, а если место передачи товара не установлено договором, - с момента доставки товара по месту проживания физического лица-покупателя или местонахождением юридического лица-покупателя, если другое не установлено договором или законом.
3. Покупатель до передачи товара имеет право отказаться от договора при условии возмещения продавцу затрат, связанных с совершением действий относительно выполнения договора.

Статья 703. Продажа товаров с использованием автоматов
1. Если продажа товара осуществляется с использованием автоматов, владелец автоматов обязан довести до покупателя информацию о продавце товара путем размещения на автомате или предоставить покупателям иным образом сведения о наименовании продавца, его местонахождении, режиме работы, а также о действиях, которые необходимо совершить покупателю для получения товара.
2. Договор розничной купли-продажи с использованием автоматов является заключенным с момента совершения покупателем действий, необходимых для получения товара.
3. Если покупателю не предоставляется оплаченный товар, продавец должен по требованию покупателя немедленно предоставить покупателю товар или возвратить уплаченную им денежную сумму.
4. Если автомат используется для размена денег, приобретения платежных средств или обмена валюты, применяются положения о розничной купле-продажи, если другое не вытекает из сути обязательства.

Статья 704. Договор с условием о доставке товара покупателю
1. Если договор розничной купли-продажи заключен с условием о доставке товара покупателю, продавец обязан в установленный договором срок доставить товар по месту, указанному покупателем, а если место передачи товара покупателем не указано, - по месту проживания физического лица-покупателя или местонахождению юридического лица-покупателя.
2. Договор розничной купли-продажи с условием о доставке товара покупателю является выполненным с момента вручения товара покупателю, а в случае его отсутствия - лицу, которое предъявило квитанцию или другой документ, который удостоверяет заключение договора или оформление доставки товара, если другое не установлено договором, актами гражданского законодательства или не вытекает из сути обязательства. 3. Если договором не установлен срок доставки товара для вручения его покупателю, товар может быть доставлен в разумный срок после получения требования покупателя.

Статья 705. Договор наем-продажи
1. По договору наем-продажи до перехода к покупателю права собственности на переданный ему продавцом товар покупатель является нанимателем (арендатором) этого товара.
2. Покупатель становится собственником товара, переданного ему по договору наем-продажи, с момента оплаты товара, если другое не установлено договором.

Статья 706. Цена и оплата товара
1. Покупатель обязан оплатить товар по цене, объявленной продавцом в момент заключения договора, если другое не установлено законом или не вытекает из сути обязательства.
2. Если договором установлена предшествующая оплата товара (статья 693 Гражданского кодекса Украины), просрочка покупателем оплаты товара является отказом покупателя от договора, если другое не установлено договором.
3. К договору розничной купли-продажи товара в кредит, в том числе с рассрочкой платежа, не применяются положения абзаца первого части пятой статьи 694 Гражданского кодекса Украины.
4. Покупатель имеет право полностью оплатить товар в любое время в границах установленного договором периода рассрочки его оплаты.

Статья 707. Обмен товара
1. Покупатель вправе в течение четырнадцати дней не считая дня покупки непродовольственного товара надлежащего качества, если длительный срок не объявлен продавцом, обменять его в месте покупки или других местах, объявленных продавцом, на аналогичный товар другого размера, формы, габарита, фасона, комплектации и т.д. При обнаружении разницы в цене покупатель проводит необходимый перерасчет с продавцом.
Если у продавца нет необходимого для обмена товара, покупатель имеет право возвратить приобретенный товар продавцу и получить уплаченную за него денежную сумму.
Требование покупателя об обмене или возвращении товара подлежит удовлетворению, если товар не был в употреблении, сохранен его товарный вид, потребительские свойства и при наличии доказательств приобретения товара у этого продавца.
2. Перечень товаров, которые не подлежат обмену или возвращению на основаниях, предусмотренных этой статьей, устанавливается нормативно-правовыми актами.

Статья 708. Права покупателя в случае продажи ему товара ненадлежащего качества
1. В случае выявления покупателем на протяжении гарантийного или других сроков, установленных обязательными для сторон правилами или договором, недостатков, не предупрежденных продавцом, или фальсификации товара покупатель имеет право по своему выбору:
требовать от продавца или изготовителя безвозмездного устранения недостатков товара или возмещения затрат, осуществленных покупателем или третьим лицом, на их исправление;
требовать от продавца или изготовителя замены товара на аналогичный товар надлежащего качества или на такой же самый товар другой модели с соответствующим перерасчетом в случае разницы в цене;
требовать от продавца или изготовителя соответствующего уменьшения цены;
отказаться от договора и требовать возвращения уплаченной за товар денежной суммы.
2. Покупатель, который приобрел непродовольственные товары, которые уже были в использовании и реализованы через розничные комиссионные торговые предприятия, о чем он был проинформирован продавцом, имеет право предъявить требования, предусмотренные частью первой этой статьи, если приобретенные товары содержали важные недостатки, не предупрежденные продавцом.

Статья 709. Порядок и сроки удовлетворения требований покупателя о замене товара или устранении недостатков
1. Продавец или изготовитель (или уполномоченные ими представители) обязаны принять товар ненадлежащего качества от покупателя и удовлетворить его требования о замене товара или устранении недостатков. Доставка товара продавцу и его возвращение покупателю осуществляются продавцом или изготовителем, а в случае невыполнения ими этой обязанности или отсутствия продавца или изготовителя в местонахождении покупателя возвращение товара может быть осуществлено покупателем за их счет.
2. Требование покупателя о замене товара подлежит немедленному удовлетворению, а в случае необходимости проверки качества товара - на протяжении четырнадцати дней или, по договоренности сторон, в другой срок.
В случае отсутствия необходимого товара требование покупателя о замене товара подлежит удовлетворению в двухмесячный срок с момента предоставления соответствующего заявления.
Если удовлетворить требование покупателя о замене товара в установленные сроки невозможно, покупатель на свой выбор имеет право предъявить продавцу или изготовителю другие требования согласно статье 708 Гражданского кодекса Украины.
3. Требование покупателя о безвозмездном устранении недостатков товара подлежит удовлетворению продавцом или изготовителем на протяжении четырнадцати дней или, по договоренности сторон, в другой срок. По требованию покупателя на время ремонта ему может быть предоставлен в пользование аналогичный товар, независимо от модели, с доставкой.
4. В случае устранения недостатков товара путем замены комплектующего изделия или составной части товара, на которые установлены гарантийные сроки, гарантийный срок на новое комплектующее изделие или составную часть вычисляется со дня выдачи покупателю товара после устранения недостатков.
5. За каждый день просрочки продавцом или изготовителем устранения недостатков товара и невыполнения требования о предоставлении в пользование аналогичного товара на время устранения недостатков продавец платит покупателю неустойку в размере одного процента стоимости товара.

Статья 710. Возмещение разницы в цене в случае замены товара, уменьшения цены и возвращение товара ненадлежащего качества
1. В случае замены товара с недостатками на товар надлежащего качества продавец не имеет права требовать возмещения разницы между ценой товара, установленной договором купли-продажи, и ценой товара, которая существует на момент замены товара или постановлення судом решения о замене товара.
2. В случае замены товара ненадлежащего качества на аналогичный, но другой по размеру, фасону, сорту и т.п. товар надлежащего качества возмещению подлежит разница между ценой замененного товара и ценой товара надлежащего качества, которые действуют на момент замены товара или постановлення судом решения о замене товара.
3. В случае предъявления требования о соответствующем уменьшении цены товара для расчета берется цена товара на момент предъявления требования об уменьшении цены, а если требование покупателя добровольно не удовлетворенно продавцом, - на момент постановлення судом решения о соответствующем уменьшении цены товара.
4. В случае отказа покупателя от договора и возвращения продавцу товара ненадлежащего качества покупатель имеет право требовать возмещения разности между ценой товара, установленной договором, и ценой соответствующего товара на момент добровольного удовлетворения его требования, а если требование добровольно не удовлетворено продавцом, - на момент постановлення судом решения.
5. Если на время выполнения решения суда о возмещении разницы в цене в случае замены товара, уменьшения цены или возвращения товара ненадлежащего качества повысились цены на этот товар, покупатель на этих основаниях может заявить дополнительные требования к продавцу.

Статья 711. Ответственность за вред, причиненный товаром ненадлежащего качества
1. Вред, причиненный имуществу покупателя, и вред, причиненный увечьем, другим повреждением здоровья или смертью в связи с приобретением товара ненадлежащего качества, возмещается продавцом или изготовителем товара согласно положениям главы 82 Гражданского кодекса Украины.

Параграф 3. Поставка

Статья 712. Договор поставки
1. По договору поставки продавец (поставщик), осуществляющий предпринимательскую деятельность, обязуется передать в установленный срок (сроки) товар в собственность покупателя для использования его в предпринимательской деятельности или в других целях, не связанных с личным, семейным, домашним или другим подобным использованием, а покупатель обязуется принять товар и уплатить за него определенную денежную сумму.
2. К договору поставки применяются общие положения о купле-продаже, если другое не установлено договором, законом или не вытекает из характера отношений сторон.
3. Законом могут быть предусмотрены особенности регулирования заключения и выполнения договоров поставки, в том числе договора поставки товара для государственных потребностей.

Параграф 4. Контрактация сельскохозяйственной продукции

Статья 713. Договор контрактации сельскохозяйственной продукции
1. По договору контрактации сельскохозяйственной продукции производитель сельскохозяйственной продукции обязуется выработать определенную договором сельскохозяйственную продукцию и передать ее в собственность заготовителю (контрактанту) или определенному им получателю, а заготовитель обязуется принять эту продукцию и оплатить ее по установленным ценам согласно условиям договора.
2. К договору контрактации применяются общие положения о купле-продаже и положения о договоре поставки, если другое не установлено договором или законом.
3. Законом могут быть предусмотрены особенности заключения и выполнения договоров контрактации сельскохозяйственной продукции.

Параграф 5. Снабжение энергетическими и другими ресурсами через присоединенную сеть

Статья 714. Договор снабжения энергетическими и другими ресурсами через присоединенную сеть
1. По договору снабжения энергетическими и другими ресурсами через присоединенную сеть одна сторона (поставщик) обязуется предоставлять второй стороне (потребителю, абоненту) энергетические и прочие ресурсы, предусмотренные договором, а потребитель (абонент) обязуется оплачивать стоимость принятых ресурсов и придерживаться предусмотренного договором режима ее использование, а также обеспечить безопасную эксплуатацию энергетического и прочего оснащения.
2. К договору снабжения энергетическими и другими ресурсами через присоединенную сеть применяются общие положения о купле-продаже, положение о договоре поставки, если другое не установлено законом или не вытекает из сути отношений сторон.
3. Законом могут быть предусмотрены особенности заключения и выполнения договора снабжения энергетическими и другими ресурсами.

Параграф 6. Мена

Статья 715. Договор мены
1. По договору мены (бартера) любая из сторон обязуется передать второй стороне в собственность один товар в обмен на другой товар.
2. Любая из сторон договора мены является продавцом того товара, который она передает в обмен, и покупателем товара, который она получает взамен.
3. Договором может быть установлена доплата за товар большей стоимости, которая обменивается на товар меньшей стоимости.
4. Право собственности на обмениваемые товары переходит к сторонам одновременно после выполнения обязательств относительно передачи имущества обеими сторонами, если другое не установлено договором или законом.
5. Договором может быть установлен обмен имущества на работы (услуги).
6. Законом могут быть предусмотрены особенности заключения и выполнения договора мены.

Статья 716. Правовое регулирование мены
1. К договору мены применяются общие положения о купле-продаже, положение о договоре поставки, договор контрактации или другие договора, элементы которых помещаются в договоре мены, если это не противоречит сути обязательства.
"""
GKU_g_55 = """ 
Глава 55 - Гражданского кодекса
Дарение

Статья 717. Договор дарения
1. По договору дарения одна сторона (даритель) передает или обязуется передать в будущем второй стороне (одаряемому) безвозмездно имущество (дар) в собственность.
2. Договор, устанавливающий обязанность одаряемого совершить в пользу дарителя любое действие имущественного или неимущественного характера, не является договором дарения.

Статья 718. Предмет договора дарения
1. Даром могут быть движимое имущество, в том числе деньги и ценные бумаги, а также недвижимое имущество.
2. Даром могут быть имущественные права, которыми даритель владеет или которые могут возникнуть у него в будущем.

Статья 719. Форма договора дарения
1. Договор дарения предметов личного пользования и бытового назначения может быть заключен устно.
2. Договор дарения недвижимого имущества составляется в письменной форме и подлежит нотариальному удостоверению.
3. Договор дарения имущественного права и договор дарения с обязанностью передать дар в будущем составляется в письменной форме. В случае несоблюдения письменной формы настоящий договор является недействительным
4. Договор дарения движимого имущества, которое имеет особую ценность, составляется в письменной форме. Передача такой вещи по устному договору является правомерной, если суд не установит, что одаряемый завладел ею незаконно.
5. Договор дарения валютных ценностей физических лиц между собой на сумму, превышающую пятидесятикратный размер необлагаемого минимума доходов граждан, заключается в письменной форме и подлежит нотариальному удостоверению.

Статья 720. Стороны в договоре дарения
1. Сторонами в договоре дарения могут быть физические лица, юридические лица, государство Украина, Автономная Республика Крым, территориальная община.
2. Родители (усыновители), опекуны не имеют права дарить имущество детей, подопечных.
3. Предпринимательские общества могут заключать договор дарения между собой, если право осуществлять дарение прямо установлено учредительным документом дарителя. Это положение не распространяется на право юридического лица заключать договор пожертвования.
4. Договор дарения от лица дарителя может заключить его представитель. Поручение на заключение договора дарения, в котором не установлено имя одаряемого, является недействительным.

Статья 721. Обязанности дарителя
1. Если дарителю известно о недостатках вещи, являющейся даром, или ее особые свойства, которые могут быть опасными для жизни, здоровья, имущества одаряемого или других лиц, он обязан сообщить о них одаряемому.
2. Даритель, которому было известно о недостатках или особых свойствах подаренной вещи, не сообщивший о них одаряемому, обязан возместить вред, причиненный имуществу, и вред, причиненный увечьем, другим повреждением здоровья или смертью в результате владения или пользования даром.

Статья 722. Принятие дара
1. Право собственности одаряемого на дар возникает с момента его принятия.
2. Даритель, который передал вещь предприятию, организации транспорта, связи или другому лицу для вручения ее одаряемому, имеет право отказаться от договора дарения до вручения вещи одаряемому.
3. Если дар направлен одаряемому без его предварительного соглашения, дар является принятым, если одаряемый немедленно не заявит об отказе от его принятия.
4. Принятие одаряемым документов, которые заверяют право собственности на вещь, других документов, которые заверяют принадлежность дарителю предмета договора, или символов вещи (ключей, макетов и т.п.) является принятием дара.

Статья 723. Договор дарения с обязанностью передать дар в будущем
1. Договором дарения может быть установлена обязанность дарителя передать дар одаряемому в будущем через определенный срок (в конкретную дату) или в случае наступления отлагадательного обстоятельства.
2. В случае наступления срока (даты) или отлагательного обстоятельства, установленных договором дарения с обязанностью передать дар в будущем, одаряемый имеет право требовать от дарителя передачи дара или возмещения его стоимости.
3. Если до наступления срока (даты) или отлагательного обстоятельства, определенного договором дарения с обязанностью передать дар в будущем, даритель или одаряемый умрет, договор дарения прекращается.

Статья 724. Односторонний отказ от договора дарения с обязанностью передать дар в будущем
1. Даритель имеет право отказаться от передачи дара в будущем, если после заключения договора его имущественное состояние существенным образом ухудшилось.
2. Одаряемый имеет право в любое время до принятия дара на основании договора дарения с обязанностью передать дар в будущем отказаться от него.

Статья 725. Обязанность одаряемого в пользу третьего лица
1. Договором дарения может быть установлена обязанность одаряемого совершить определенное действие имущественного характера в пользу третьего лица или воздержаться от его совершения (передать денежную сумму или другое имущество в собственность, выплачивать денежную ренту, предоставить право пожизненного пользования даром или его частью, не предъявлять требований к третьему лицу о выселении и т.п.).
2. Даритель имеет право требовать от одаряемого выполнения возложенной на него обязанности в пользу третьего лица.
В случае смерти дарителя, объявления его умершим, признания безвестно отсутствующим или недееспособным, требовать от одаряемого выполнения обязанности в пользу третьего лица имеет право лицо, в пользу которого установлена эта обязанность.

Статья 726. Правовые последствия нарушения одаряемым обязанности в пользу третьего лица
1. В случае нарушения одаряемым обязанности в пользу третьего лица даритель имеет право требовать расторжения договора и возвращения дара, а если такое возвращение невозможно, - возмещения его стоимости.

Статья 727. Расторжение договора дарения по требованию дарителя
1. Даритель имеет право требовать расторжения договора дарения недвижимого имущества или другого в особенности ценного имущества, если одаряемый преднамеренно совершил преступление против жизни, здоровья, собственности дарителя, его родителей, жены (мужа) или детей.
Если одаряемый совершил умышленное убийство дарителя, наследники дарителя имеют право требовать расторжения договора дарения.
2. Даритель имеет право требовать расторжения договора дарения, если одаряемый создает угрозу безвозвратной потери дара, который имеет для дарителя большую неимущественную ценность.
3. Даритель вправе потребовать расторжения договора дарения, если вследствие небрежного отношения одаряемого к вещи, что составляет культурную ценность, эта вещь может быть уничтожена или существенно повреждена.
4. Даритель имеет право требовать расторжения договора дарения, если на момент предъявления требования дар является сохраненным.
5. В случае расторжения договора дарения одаряемый обязан возвратить дар в натуре.

Статья 728. Исковая давность, которая применяется к требованиям о расторжении договора дарения
1. К требованиям о расторжении договора дарения применяется исковая давность в один год.

Статья 729. Пожертвование
1. Пожертвованием является дарение недвижимых и движимых вещей, в частности денег и ценных бумаг, лицам, установленным частью первой статьи 720 Гражданского кодекса Украины, для достижения ими определенной, заведомо обусловленной цели.
2. Договор о пожертвовании является заключенным с момента принятия пожертвования.
3. К договору о пожертвовании применяются положения о договоре дарения, если другое не установлено законом.

Статья 730. Права пожертвователя
1. Пожертвователь имеет право осуществлять контроль за использованием пожертвования согласно цели, установленной договором о пожертвовании.
2. Если использование пожертвования по назначению оказалось невозможным, использование его по другому назначению возможно лишь по согласию пожертвователя, а в случае его смерти или ликвидации юридического лица - по решению суда.
3. Пожертвователь или его правопреемники имеют право требовать расторжения договора о пожертвовании, если пожертвование используется не по назначению.
"""
GKU_g_56 = """ 
Глава 56 - Гражданского кодекса
Рента

Статья 731. Договор ренты
1. По договору ренты одна сторона (получатель ренты) передает второй стороне (плательщику ренты) в собственность имущество, а плательщик ренты взамен этого обязуется периодически выплачивать получателю ренту в форме определенной денежной суммы или в другой форме.
2. Договором ренты может быть установлена обязанность выплачивать ренту бессрочно (бессрочная рента) или на протяжении определенного срока.

Статья 732. Форма договора ренты
1. Договор ренты составляется в письменной форме.
2. Договор ренты подлежит нотариальному удостоверению, а договор о передаче недвижимого имущества под выплату ренты подлежит также государственной регистрации.

Статья 733. Стороны в договоре ренты
1. Сторонами в договоре ренты могут быть физические или юридические лица.

Статья 734. Передача имущества под выплату ренты
1. Договором ренты может быть установлено, что получатель ренты передает имущество в собственность плательщика ренты за плату или безвозмездно.
2. Если договором ренты установлено, что получатель ренты передает имущество в собственность плательщика ренты за плату, к отношениям сторон относительно передачи имущества применяются общие положения о купле-продаже, а если имущество передается безвозмездно, - положение о договоре дарения, если это не противоречит сути договора ренты.

Статья 735. Обеспечение выплаты ренты
1. В случае передачи под выплату ренты земельного участка или другого недвижимого имущества получатель ренты приобретает право залога на это имущество.
2. Плательщик ренты имеет право отчуждать имущество, переданное ему под выплату ренты, лишь по согласию получателя ренты.
В случае отчуждения недвижимого имущества другому лицу к нему переходят обязанности плательщика ренты.
3. Выплата ренты может быть обеспечена путем установления обязанности плательщика ренты застраховать риск невыполнения им своих обязанностей по договору ренты.

Статья 736. Ответственность за просрочку выплаты ренты
1. За просрочку выплаты ренты плательщик ренты платит получателю ренты проценты.

Статья 737. Форма и размер ренты
1. Рента может выплачиваться в денежной форме или путем передачи вещей, выполнения работ или предоставления услуг. Форма выплаты ренты устанавливается договором ренты.
2. Размер ренты устанавливается договором.
Если получатель ренты передал в собственность плательщика ренты денежную сумму, размер ренты устанавливается в размере учетной ставки Национального банка Украины, если больший размер не установлен договором ренты.
Размер ренты изменяется согласно изменению размера учетной ставки Национального банка Украины, если другое не установлено договором.

Статья 738. Срок выплаты ренты
1. Рента выплачивается после окончания каждого календарного квартала, если другое не установлено договором ренты.

Статья 739. Право плательщика бессрочной ренты на отказ от договора ренты
1. Плательщик бессрочной ренты имеет право отказаться от договора ренты.
Условие договора, согласно которому плательщик бессрочной ренты не может отказаться от договора ренты, является недействительным.
2. Договором ренты могут быть установлены условия осуществления плательщиком бессрочной ренты отказа от договора ренты.
3. Договор ренты прекращается по истечению трех месяцев со дня получения получателем ренты письменного отказа плательщика бессрочной ренты от договора при условии полного расчета между ними.

Статья 740. Право получателя бессрочной ренты на расторжение договора ренты
1. Получатель бессрочной ренты имеет право требовать расторжения договора ренты в случае, если:
плательщик бессрочной ренты просрочил ее выплату более чем на один год;
плательщик бессрочной ренты нарушил свои обязательства относительно обеспечения выплаты ренты;
плательщик бессрочной ренты признан неплатежеспособным или возникли другие обстоятельства, которые явным образом свидетельствуют о невозможности выплаты им ренты в размере и в сроки, установленные договором.
2. Получатель бессрочной ренты имеет право требовать расторжения договора ренты также в других случаях, установленных договором ренты.

Статья 741. Расчеты между сторонами в случае расторжения договора ренты
1. Если договором ренты не установлены правовые последствия расторжения договора ренты, расчеты ведутся в зависимости от того, было ли имущество передано в собственность плательщика ренты за плату или безвозмездно.
2. Если имущество было передано в собственность плательщика ренты безвозмездно, в случае расторжения договора ренты получатель ренты имеет право требовать от плательщика ренты выплаты годовой суммы ренты.
3. Если имущество было передано в собственность плательщика ренты за плату, получатель ренты имеет право требовать от плательщика ренты выплаты годовой суммы ренты и стоимости переданного имущества.

Статья 742. Риск случайного уничтожения или случайного повреждения имущества, переданного под выплату бессрочной ренты
1. Риск случайного уничтожения или случайного повреждения имущества, переданного безвозмездно под выплату бессрочной ренты, несет плательщик ренты.
2. В случае случайного уничтожения или случайного повреждения имущества, переданного за плату под выплату бессрочной ренты, плательщик имеет право требовать соответственно прекращения обязательства относительно выплаты ренты или изменения условий ее выплаты.

Статья 743. Риск случайного уничтожения или случайного повреждения имущества, переданного под выплату ренты на определенный срок
1. В случае случайного уничтожения или случайного повреждения имущества, переданного под выплату ренты на определенный срок, плательщик ренты не освобождается от обязанности выплачивать ее до окончания срока выплаты ренты на условиях, установленных договором ренты.
"""
GKU_g_57 = """ 
Глава 57 - Гражданского кодекса
Пожизненное содержание (уход)

Статья 744. Понятие договора пожизненного содержания (ухода)
1. По договору пожизненного содержания (ухода) одна сторона (отчуждатель) передает второй стороне (приобретателю) в собственность жилой дом, квартиру или их часть, другое недвижимое имущество или движимое имущество, которое имеет значительную ценность, взамен чего приобретатель обязуется обеспечивать отчуждателя уходом пожизненно.

Статья 745. Форма договора пожизненного содержания (ухода)
1. Договор пожизненного содержания (ухода) составляется в письменной форме и подлежит нотариальному удостоверению.
2. Договор пожизненного содержания (ухода), по которому передается приобретателю в собственность недвижимое имущество, подлежит государственной регистрации.

Статья 746. Стороны в договоре пожизненного содержания (ухода)
1. Отчуждателем в договоре пожизненного содержания (ухода) может быть физическое лицо независимо от его возраста и состояния здоровья
2. Приобретателем в договоре пожизненного содержания (ухода) может быть совершеннолетнее дееспособное физическое лицо или юридическое лицо.
3. Если приобретателями являются несколько физических лиц, они становятся совладельцами имущества, переданного им по договору пожизненного содержания (ухода), на праве общей совместной собственности.
Если приобретателями являются несколько физических лиц, их обязанность перед отчуждателем является солидарной
4. Договор пожизненного содержания (ухода) может быть заключен отчуждателем в пользу третьего лица.

Статья 747. Особенности заключения договора пожизненного содержания (ухода) относительно имущества, которое находится в общей совместной собственности
1. Имущество, которое принадлежит совладельцам на праве общей совместной собственности, в частности имущество, которое принадлежит супругам, может быть отчуждено ими на основании договора пожизненного содержания (ухода).
В случае смерти одного из совладельцев имущества, которое было отчуждено ими на основании договора пожизненного содержания (ухода), объем обязательства приобретателя соответственно уменьшается.
2. Если отчуждателем является один из совладельцев имущества, которое принадлежит им на праве общей совместной собственности, договор пожизненного содержания (ухода) может быть заключен после определения доли этого совладельца в общем имуществе или определения между совладельцами порядка пользования этим имуществом.

Статья 748. Момент возникновения у приобретателя права собственности на имущество, переданное по договору пожизненного содержания (ухода)
1. Приобретатель становится собственником имущества, переданного ему по договору пожизненного содержания (ухода), согласно статье 334 этого Кодекса.

Статья 749. Обязанности приобретателя по договору пожизненного содержания (ухода)
1. В договоре пожизненного содержания (ухода) могут быть определены все виды материального обеспечения, а также все виды ухода (попечения), которыми приобретатель может обеспечивать отчуждателя.
2. Если обязанности приобретателя не были конкретно определены или в случае возникновения потребности обеспечить отчуждателя другими видами материального обеспечения и ухода спор может решаться согласно основам справедливости и разумности.
3. Приобретатель обязан в случае смерти отчуждателя похоронить его, даже если это не было предусмотрено договором пожизненного содержания (ухода).
Если часть имущества отчуждателя перешла к его наследникам, затраты на его погребение должны быть справедливо распределены между ними и приобретателем.

Статья 750. Обязанность приобретателя обеспечить отчуждателя жильем
1. Приобретатель может быть обязан обеспечить отчуждателя или третье лицо жильем в доме (квартире), переданным по договору пожизненного содержания (ухода).
В этом случае в договоре может быть конкретно определена та часть помещения, в котором отчуждатель имеет право проживать.

Статья 751. Денежная оценка материального обеспечения отчуждателя
1. Материальное обеспечение, которое ежемесячно может предоставляться отчуждателю, подлежит денежной оценке. Такая оценка подлежит индексации в порядке, установленном законом.

Статья 752. Замена приобретателя по договору пожизненного содержания (ухода)
1. В случае невозможности дальнейшего выполнения физическим лицом обязанностей приобретателя по договору пожизненного содержания (ухода) на основаниях, которые имеют существенное значение, обязанности приобретателя могут быть переданы по согласию отчуждателя члену семьи приобретателя или другому лицу с их согласия.
2. Отказ отчуждателя в предоставлении согласия на передачу обязанностей приобретателя по договору пожизненного содержания (ухода) другому лицу может быть обжалован в суде. В этом случае суд принимает во внимание продолжительность выполнения договора и прочие обстоятельства, которые имеют важное значение.

Статья 753. Замена имущества, которое было передано приобретателю по договору пожизненного содержания (ухода)
1. Приобретатель и отчуждатель могут договориться о замене вещи, которая была передана по договору пожизненного содержания (ухода), на другую вещь.
В этом случае объем обязанностей приобретателя может быть по договоренности сторон изменен или оставлен неизменным.

Статья 754. Обеспечение выполнения договора пожизненного содержания (ухода)
1. Приобретатель не имеет права до смерти отчуждателя продавать, дарить, менять имущество, переданное по договору пожизненного содержания (ухода), составлять относительно него договор залога, передавать его в собственность другому лицу на основании другой сделки.
2. На имущество, переданное приобретателю по договору пожизненного содержания (ухода), не может быть обращено взыскание на протяжении жизни отчуждателя
3. Потеря (уничтожение), повреждение имущества, которое было передано приобретателю, не является основанием для прекращения или уменьшения объема его обязанностей перед отчуждателем

Статья 755. Прекращение договора пожизненного содержания (ухода)
1. Договор пожизненного удержания (ухода) может быть разорван по решению суда:
по требованию отчуждателя или третьего лица, в пользу которого он был заключен, в случае невыполнения или ненадлежащего выполнения приобретателем своих обязанностей, независимо от его вины;
по требованию приобретателя.
2. Договор пожизненного содержания (ухода) прекращается со смертью отчуждателя.

Статья 756. Правовые последствия разрыва договора пожизненного содержания (ухода)
1. В случае разрыва договора пожизненного содержания (ухода) в связи с невыполнением или ненадлежащим выполнением приобретателем обязанностей по договору, отчуждатель приобретает право собственности на имущество, которое было им передано, и имеет право требовать его возвращения. В этом случае затраты, понесенные приобретателем на содержание и (или) уход отчуждателя, не подлежат возвращению.
2. В случае разрыва договора в связи с невозможностью его дальнейшего выполнения приобретателем на основаниях, которые имеют важное значение, суд может оставить за приобретателем право собственности на часть имущества, с учетом продолжительности времени, на протяжении которого он надлежаще исполнял свои обязанности по договору.

Статья 757. Правовые последствия смерти приобретателя
1. Обязанности приобретателя по договору пожизненного содержания (ухода) переходят к тем наследникам, к которым перешло право собственности на имущество, которое было передано отчуждателем
Если наследник по завещанию отказался от принятия имущества, которое было передано отчуждателем, право собственности на это имущество может перейти к наследнику по закону.
2. Если у приобретателя нет наследников или они отказались от принятия имущества, переданного отчуждателем, отчуждатель приобретает право собственности на это имущество. В этом случае договор пожизненного содержания (ухода) прекращается.

Статья 758. Правовые последствия прекращения юридического лица - приобретателя
1. В случае прекращения юридического лица - приобретателя с определением правопреемников к ним переходят права и обязанности по договору пожизненного содержания (ухода).
2. В случае ликвидации юридического лица-приобретателя право собственности на имущество, переданное по договору пожизненного содержания (ухода), переходит к отчуждателю
Если в результате ликвидации юридического лица - приобретателя имущество, которое было передано ему по договору пожизненного содержания (ухода), перешло к его основателю (участнику), к нему переходят права и обязанности приобретателя по договору пожизненного содержания (ухода).
"""
GKU_g_58 = """ 
Глава 58 - Гражданского кодекса
Найм (Аренда)

Параграф 1. Общие положения о найме (аренде)

Статья 759. Договор найма
1. По договору найма (аренды) арендодатель передает или обязуется передать арендатору имущество в пользование за плату на определенный срок.
2. Законом могут быть предусмотрены особенности заключения и выполнения договора аренды (аренды).

Статья 760. Предмет договора аренды
1. Предметом договора аренды может быть вещь, определенная индивидуальными признаками и которая сохраняет свой первоначальный вид при неоднократном использовании (непотребительская вещь).
Законом могут быть установлены виды имущества, которые не могут быть предметом договора аренды.
2. Предметом договора аренды могут быть имущественные права.
3. Особенности найма отдельных видов имущества устанавливаются этим Кодексом и другим законом.

Статья 761. Право передачи имущества в найм
1. Право передачи имущества в найм имеет собственник вещи или лицо, которому принадлежат имущественные права.
2. арендодателем может быть также лицо, уполномоченное на заключение договора аренды.

Статья 762. Плата за пользование имуществом
1. За пользование имуществом с арендатора взимается оплата, размер которой устанавливается договором найма.
Если размер платы не установлен договором, он определяется с учетом потребительского качества вещи и других обстоятельств, которые имеют важное значение.
2. Плата за пользование имуществом может вноситься по выбору сторон в денежной или натуральной форме. Форма платы за пользование имуществом устанавливается договором найма.
3. Договором или законом может быть установлен периодический просмотр, изменение (индексация) размера платы за пользование имуществом.
4. Арендатор имеет право требовать уменьшения платы, если из-за обстоятельств, за которые он не отвечает, возможность пользования имуществом существенным образом уменьшилась.
5. Плата за пользование имуществом вносится ежемесячно, если другое не установлено договором.
6. Арендатор освобождается от платы за все время, на протяжении которого имущество не могло быть использовано им из-за обстоятельств, за которые он не отвечает.

Статья 763. Срок договора аренды
1. Договор найма заключается на срок, установленный договором.
2. Если срок найма не установлен, договор найма считается заключенным на неопределенный срок.
Любая из сторон договора аренды, заключенного на неопределенный срок, может отказаться от договора в любое время, письменно предупредив об этом другую сторону за один месяц, а в случае найма недвижимого имущества - за три месяца. Договором или законом может быть установлен другой срок для предупреждения об отказе от договора аренды, заключенного на неопределенный срок.
3. Законом могут быть установлены максимальные (предельные) сроки договора аренды отдельных видов имущества.
Если до истечения установленного законом максимального срока найма ни одна из сторон не отказалась от договора, заключенного на неопределенный срок, он прекращается с истечением максимального срока договора.
Договор найма, срок которого превышает установленный законом максимальный срок, считается заключенным на срок, который соответствует максимальному сроку.

Статья 764. Правовые последствия продолжения пользования имуществом после окончания срока договора аренды
1. Если Арендатор продолжает пользоваться имуществом после окончания срока договора аренды, то, из-за отсутствия возражений арендодателя на протяжении одного месяца, договор считается возобновленным на срок, который был раньше установлен договором.

Статья 765. Передача имущества арендатору
1. Арендодатель обязан передать арендатору имущество в пользование немедленно или в срок, установленный договором найма.

Статья 766. Правовые последствия непередачи имущества арендатору
1. Если арендодатель не передает арендатору имущество, Арендатор имеет право по своему выбору:
требовать от арендодателя передачи имущества и возмещения убытков, причиненных задержкой;
отказаться от договора аренды и требовать возмещения причиненных ему убытков.

Статья 767. Качество вещи, переданной в найм
1. Арендодатель обязан передать арендатору вещь в комплекте и в состоянии, которые отвечают условиям договора аренды и ее назначению.
2. Арендодатель обязан предупредить арендатора об особых свойствах и недостатках вещи, которые ему известны и которые могут быть опасными для жизни, здоровья, имущества арендатора или других лиц или привести к повреждению самой вещи во время пользования ею.
3. Арендатор обязан в присутствии арендодателя проверить исправность вещи. Если Арендатор в момент передачи вещи во владение не убедится в ее исправности, вещь считается переданной ему в надлежащем состоянии.

Статья 768. Гарантия качества вещи, переданной в найм
1. Арендодатель может гарантировать качество вещи на протяжении всего срока найма.
2. Если в вещи, которая была передана арендатору с гарантией качества, окажутся недостатки, которые препятствуют ее использованию согласно договора, Арендатор имеет право по своему выбору требовать:
замены вещи, если это возможно;
соответствующего уменьшения размера платы за пользование вещью;
безвозмездного устранения недостатков вещи или возмещения затрат на их устранение;
разрыв договора и возмещение убытков, которые были ему причинены.

Статья 769. Права третьих лиц на вещь, переданную в найм
1. Передача вещи в найм не прекращает и не изменяет прав на нее третьих лиц, в частности права залога.
2. При заключении договора аренды арендодатель обязан сообщить арендатору обо всех правах третьих лиц на вещь, которая передается в найм. Если арендодатель не сообщил арендатору обо всех правах третьих лиц на вещь, которая передается в найм, Арендатор имеет право требовать уменьшения размера платы за пользование вещью или разрыва договора и возмещения убытков.

Статья 770. Правопреемство в случае изменения собственника вещи, переданной в найм
1. В случае изменения собственника вещи, переданной в найм, к новому собственнику переходят права и обязанности арендодателя.
2. Стороны могут установить в договоре найма, который в случае отчуждения арендодателем вещи договор найма прекращается.

Статья 771. Страхование вещи, переданной в найм
1. Передача в найм вещи, которая была застрахована арендодателем, не прекращает действия договора страхования.
2. Договором или законом может быть установлена обязанность арендатора заключить договор страхования вещи, переданной в найм.

Статья 772. Риск случайного уничтожения или случайного повреждения вещи
1. Арендатор, который задержал возвращения вещи наймодателю, несет риск ее случайного уничтожения или случайного повреждения.

Статья 773. Пользование вещью, переданной в найм
1. Арендатор обязан пользоваться вещью согласно ее назначению и условий договора.
2. Если Арендатор пользуется вещью, переданной ему в найм, не по ее назначению или с нарушением условий договора аренды, арендодатель имеет право требовать разрыва договора и возмещения убытков.
3. Арендатор имеет право изменять состояние вещи, переданной ему в найм, лишь по согласию арендодателя.

Статья 774. Поднайм
1. Передача нанимателем вещи в пользование другому лицу (субаренда) возможна лишь по согласию арендодателя, если другое не установлено договором или законом.
2. Срок договора субаренды не может превышать срока договора аренды.
3. К договору субаренды применяются положения о договоре найма.

Статья 775. Право собственности на плоды, продукцию, доходы, полученные от пользования вещью, переданной в найм
1. арендатору приналежит право собственности на плоды, продукцию, доходы, полученные им в результате пользования вещью, переданной в найм.

Статья 776. Ремонт вещи, переданной в найм
1. Текущий ремонт вещи, переданной в найм, ведется нанимателем за его счет, если другое не установлено договором или законом.
2. Капитальный ремонт вещи, переданной в найм, ведется арендодателем за его счет, если другое не установлено договором или законом.
Капитальный ремонт ведется в срок, установленный договором. Если срок не установлен договором или ремонт вызван неотложной потребностью, капитальный ремонт может быть проведен в разумный срок.
3. Если арендодатель не провел капитального ремонта вещи, которая препятствует ее использованию согласно назначению и условиям договора, Арендатор имеет право:
отремонтировать вещь, зачислив стоимость ремонта в счет платы за пользование вещью, или требовать возмещения стоимости ремонта;
требовать разрыва договора и возмещения убытков.

Статья 777. Преобладающие права арендатора
1. Арендатор, который надлежаще исполняет свои обязанности по договору найма, после истечения срока договора имеет преобладающее право перед другими лицами на заключение договора аренды на новый срок.
Арендатор, который намеревается воспользоваться преобладающим правом на заключение договора аренды на новый срок, обязан сообщить об этом наймодателю до истечения срока договора аренды в срок, установленный договором, а если он не установлен договором, - в разумный срок.
Условия договора аренды на новый срок устанавливаются по договоренности сторон. В случае недостижения договоренности относительно платы и других условий договора преобладающее право арендатора на заключение договора прекращается.
2. Арендатор, который надлежаще исполняет свои обязанности по договору найма, в случае продажи вещи, переданной в найм, имеет преобладающее право перед другими лицами на ее приобретение.

Статья 778. Улучшение нанимателем вещи, переданной в найм
1. Арендатор может улучшить вещь, которая является предметом договора аренды, лишь по согласию арендодателя.
2. Если улучшения могут быть отделены от вещи без ее повреждения, Арендатор имеет право на их изъятие.
3. Если улучшение вещи сделано по согласию арендодателя, Арендатор имеет право на возмещение стоимости необходимых затрат или на зачисление их стоимости в счет платы за пользование вещью.
4. Если в результате улучшения, сделанного по согласию арендодателя, создана новая вещь, Арендатор становится ее совладельцем. Доля арендатора в праве собственности отвечает стоимости его затрат на улучшение вещи, если другое не установлено договором или законом.
5. Если Арендатор без согласия арендодателя сделал улучшения, которые нельзя отделить без вреда для вещи, он не имеет права на возмещение их стоимости.

Статья 779. Последствия ухудшения вещи, переданной в найм
1. Арендатор обязан устранить ухудшение вещи, которые произошли по его вине.
2. В случае невозможности восстановление вещи арендодатель имеет право требовать возмещения причиненных ему убытков.
3. Арендатор не отвечает за ухудшение вещи, если это произошло вследствие нормального ее износа или упущений арендодателя.

Статья 780. Ответственность за вред, который причинен в связи с использованием вещью, переданной в найм
1. Вред, причиненый третьим лицам в связи с пользованием вещью, переданной в найм, возмещается нанимателем на общих основаниях.
2. Вред, причиненый в связи с пользованием вещью, возмещается арендодателем, если будет установлено, что это произошло вследствие особых свойств или недостатков вещи, о наличии которых Арендатор не был предупрежден арендодателем и о которых он не знал и не мог знать.
Условие договора аренды об освобождении арендодателя от ответственности за вред, причиненный вследствие особых свойств или недостатков вещи, о наличии которых Арендатор не был предупрежден арендодателем и о которых он не знал и не мог знать, является ничтожным.

Статья 781. Прекращение договора аренды
1. Договор найма прекращается в случае смерти физического лица - арендатора, если другое не установлено договором или законом.
2. Договор найма прекращается в случае ликвидации юридического лица, которое было нанимателем или арендодателем.

Статья 782. Право арендодателя отказаться от договора аренды
1. Арендодатель имеет право отказаться от договора аренды и требовать возвращения вещи, если Арендатор не вносит плату за пользование вещью на протяжении трех месяцев подряд.
2. В случае отказа арендодателя от договора аренды договор является разорванным с момента получения нанимателем сообщения арендодателя об отказе от договора.

Статья 783. Разрыв договора аренды по требованию арендодателя
1. Арендодатель имеет право требовать разрыва договора аренды, если:
Арендатор пользуется вещью вопреки договору или назначению вещи;
Арендатор без разрешения арендодателя передал вещь в пользование другому лицу;
Арендатор своим небрежным поведением создает угрозу повреждения вещи;
Арендатор не приступил к проведению капитального ремонта вещи, если обязанность проведения капитального ремонта была возложена на арендатора.

Статья 784. Разрыв договора аренды по требованию арендатора
1. Арендатор имеет право требовать разрыва договора аренды, если:
Арендодатель передал в пользование вещь, качество которой не отвечает условиям договора и назначению вещи;
Арендодатель не выполняет своей обязанности относительно проведения капитального ремонта вещи.

Статья 785. Обязанности арендатора в случае прекращения договора аренды
1. В случае прекращения договора аренды Арендатор обязан немедленно возвратить наймодателю вещь в состоянии, в котором она была получена, с учетом нормального сноса, или в состоянии, которое было обусловлено в договоре.
2. Если Арендатор не выполняет обязанности относительно возвращения вещи, арендодатель имеет право требовать от арендатора уплаты неустойки в размере двойной платы за пользование вещью за время просрочки.

Статья 786. Исковая давность, которая применяется к требованиям, вытекающим из договора аренды
1. К требованиям о возмещении убытков в связи с повреждением вещи, которая была передана в пользование арендатору, а также к требованиям о возмещении затрат на улучшение вещи применяется исковая давность в один год.
2. Течение исковой давности относительно требований арендодателя начинается с момента возвращения вещи нанимателем, а относительно требований арендатора - с момента прекращения договора аренды.

Параграф 2. Прокат

Статья 787. Договор проката
1. По договору проката арендодатель, который осуществляет предпринимательскую деятельность по передачи вещей в найм, передает или обязуется передать движимое имущество арендатору в пользование за плату на определенный срок.
2. Договор проката является договором присоединения. арендодатель может устанавливать типовые условия договора проката. Типовые условия договора проката не могут нарушать права нанимателей, установленных законом.
Условия договора проката, которые ухудшают положение арендатора по сравнению с установленными типовыйми условиями договора, являются ничтожными.
3. Договор проката является публичным договором.

Статья 788. Предмет договора проката
1. Предметом договора проката является движимое имущество, которое используется для удовлетворения бытовых непроизводственных потребностей.
2. Предмет договора проката может использоваться для производственных потребностей, если это установлено договором.

Статья 789. Плата за прокат вещи
1. Плата за прокат вещи устанавливается по тарифам арендодателя.

Статья 790. Право арендатора на отказ от договора проката
1. Арендатор имеет право отказаться от договора проката и возвратить вещь наймодателю в любое время.
2. Плата за прокат вещи, уплаченная нанимателем за весь срок договора, уменьшается соответственно продолжительности фактического пользования вещью.

Статья 791. Особенности договора проката
1. Арендатор не имеет права на заключение договора субаренды.
2. Арендатор не имеет преобладающего права на куплю вещи в случае ее продажи арендодателем.
3. Капитальный и текущий ремонт вещи осуществляет арендодатель за свой счет, если он не докажет, что повреждение вещи произошло по вине арендатора.

Параграф 3. Найм (аренда) земельного участка

Статья 792. договор аренды земельного участка
1. По договору найма (аренды) земельного участка арендодатель обязуется передать арендатору земельный участок на установленный договором срок во владение и пользование за плату.
Земельный участок может передаваться в аренду вместе с насаждениями, зданиями, сооружениями, водоемами, которые находятся на нем, или без них.
2. Отношения относительно (найма) аренды земельного участка регулируются законом.

Параграф 4. Найм здания или другого капитального сооружения

Статья 793. Форма договора аренды здания или другого капитального сооружения
1. Договор аренды здания или другого капитального сооружения (их отдельной части) составляется в письменной форме.
2. Договор найма здания или другого капитального сооружения (их отдельной части) сроком на три года и более подлежит нотариальному удостоверению, кроме договора, предметом которого является имущество государственной или коммунальной собственности, который подлежит нотариальному удостоверению в случае, если он заключен по результатам электронного аукциона сроком более чем на пять лет.

Статья 794. Государственная регистрация права пользования недвижимым имуществом, которое возникает на основании договора найма здания или другого капитального сооружения
1. Право пользования недвижимым имуществом, которое возникает на основании договора найма здания или другого капитального сооружения (их отдельной части), заключенного на срок не менее трех лет, подлежит государственной регистрации в соответствии с законом, за исключением случая, предусмотренного частью второй статьи 793 настоящего Кодекса , если договор, заключенный по результатам электронного аукциона, предметом которого является имущество государственной или коммунальной собственности.

Статья 795. Передача здания или другого капитального сооружения в найм
1. Передача арендатору здания или другого капитального сооружения (их отдельной части) оформляется соответствующим документом (актом), подписываемым сторонами договора. С этого момента начинается вычисление срока договора аренды, если другое не установлено договором.
2. Возвращение нанимателем предмета договора аренды оформляется соответствующим документом (актом), подписываемым сторонами договора. С этого момента договор найма прекращается.

Статья 796. Предоставление арендатору права пользования земельным участком
1. Одновременно с правом найма здания или другого капитального сооружения (их отдельной части) арендатору предоставляется право пользования земельным участком, на котором они находятся, а также право пользования земельным участком, который прилегает к зданию или сооружению, в размере, необходимом для достижения цели найма.
2. В договоре аренды стороны могут определить размер земельного участка, который передается арендатору. Если размер земельного участка в договоре не определен, арендатору предоставляется право пользования всем земельным участком, которым владел арендодатель.
3. Если арендодатель не является собственником земельного участка, считается, что собственник земельного участка соглашается на предоставление арендатору права пользования земельным участком, если другое не установлено договором арендодателя с собственником земельного участка.

Статья 797. Плата за пользование
1. Плата, которая взимается с арендатора здания или другого капитального сооружения (их отдельной части), состоит из платы за пользование им и платы за пользование земельным участком.

Параграф 5. Найм (аренда) транспортного средства

Статья 798. Предмет договора аренды
1. Предметом договора аренды транспортного средства могут быть воздушные, морские, речные судна, а также наземные самоходные транспортные средства и т.п..
2. Договором аренды транспортного средства может быть установлено, что оно передается в найм с экипажем, который его обслуживает.
3. Стороны могут договориться о предоставлении арендодателем арендатору комплекса услуг для обеспечения нормального использования транспортного средства.

Статья 799. Форма договора аренды транспортного средства
1. Договор аренды транспортного средства составляется в письменной форме.
2. Договор аренды транспортного средства с участием физического лица подлежит нотариальному удостоверению.

Статья 800. Деятельность арендатора транспортного средства
1. Арендатор самостоятельно осуществляет использование транспортного средства в своей деятельности и имеет право без согласия арендодателя составлять от своего имени договора перевозки, а также другие договора согласно назначению транспортного средства.

Статья 801. Затраты, связанные с использованием транспортного средства
1. Арендатор обязан поддерживать транспортное средство в надлежащем техническом состоянии.
2. Затраты, связанные с использованием транспортного средства, в том числе с уплатой налогов и других платежей, несет Арендатор.

Статья 802. Страхование транспортного средства
1. Страхование транспортного средства осуществляется арендодателем.
2. Порядок страхования ответственности арендатора за вред, который может быть причинен другому лицу в связи с использованием транспортного средства, устанавливается законом.

Статья 803. Правовые последствия повреждения транспортного средства
1. Арендатор обязан возместить убытки, причиненные в связи с потерей или повреждением транспортного средства, если он не докажет, что это произошло не по его вине.

Статья 804. Правовые последствия причинения вреда другому лицу в связи с использованием транспортного средства
1. Арендатор обязан возместить вред, причиненный другому лицу в связи с использованием транспортного средства, согласно главе 82 этого Кодекса.

Статья 805. Особенности найма транспортного средства с экипажем, который его обслуживает
1. Управление и техническая эксплуатация транспортного средства, переданного в найм с экипажем, ведутся его экипажем. Экипаж не прекращает трудовых отношений с арендодателем. Затраты на содержание экипажа несет арендодатель.
2. Экипаж транспортного средства обязан отказаться от выполнения распоряжений арендатора, если они противоречат условиям договора аренды, условиям использования транспортного средства, а также если они могут быть опасными для экипажа, транспортного средства, прав других лиц.
3. Законом могут устанавливаться также другие особенности договора аренды транспортного средства с экипажем.

Параграф 6. Лизинг

Статья 806. Договор лизинга
1. По договору лизинга одна сторона (лизингодатель) передает или обязуется передать второй стороне (лизингополучателю) в пользование имущество, которое приналежит лизингодателю на правах собственности и было приобретено ним без предшествующей договоренности с лизингополучателем (прямой лизинг), или имущество, специально приобретенное лизингодателем у продавца (поставщика) согласно установленных лизингополучателем спецификациям и условиям (косвенный лизинг), на определенный срок и за установленную плату (лизинговые платежи).
2. К договору лизинга применяются общие положения про найм (аренду) с учетом особенностей, установленных этим параграфом и законом.
К отношениям, связанным с лизингом, применяются общие положения о купле-продаже и положение о договоре поставки, если другое не установлено законом.
3. Особенности отдельных видов и форм лизинга устанавливаются законом.

Статья 807. Предмет договора лизинга
1. Предметом договора лизинга может быть непотребительская вещь, определенная индивидуальными признаками, отнесенная согласно законодательству к основным фондам.
2. Не могут быть предметом договора лизинга земельные участки и прочие естественные объекты, а также другие вещи, установленные законом.

Статья 808. Ответственность продавца (поставщика) предмета договора лизинга
1. Если согласно договору косвенного лизинга выбор продавца (поставщика) предмета договора лизинга был осуществлен лизингополучателем, продавец (поставщик) несет ответственность перед лизингополучателем за нарушение обязательства относительно качества, комплектности, исправности предмета договора лизинга, его доставки, замены, безвозмездного устранения недостатков, монтажа и запуска в эксплуатацию и т.п. Если выбор продавца (поставщика) предмета договора лизинга был осуществлен лизингодателем, продавец (поставщик) и лизингодатель несут перед лизингополучателем солидарную ответственность по обязательствам относительно продажи (поставки) предмета договора лизинга.
2. Ремонт и техническое обслуживание предмета договора лизинга осуществляются продавцом (поставщиком) на основании договора между лизингополучателем и продавцом (поставщиком).

Статья 809. Риск случайного уничтожения или случайного повреждения предмета договора лизинга
1. Риск случайного уничтожения или случайного повреждения предмета договора лизинга несет лизингополучатель, если другое не установлено договором или законом.
2. Если лизингодатель или продавец (поставщик) просрочили передачу предмета договора лизинга лизингополучателю или лизингополучатель просрочил возвращенияе предмета договора лизинга лизингодателю, риск случайного уничтожения или случайного повреждения несет просрочившая сторона.
"""
GKU_g_59 = """ 
Глава 59 - Гражданского кодекса
Найм (аренда) жилья

Статья 810. Договор аренды жилья
1. По договору аренды (аренды) жилья одна сторона - собственник жилья (арендодатель) передает или обязуется передать второй стороне (нанимателю) жилье для проживания в нем на определенный срок за плату.
2. Основания, условия, порядок заключения и прекращения договора аренды жилья, которое является объектом права государственной или коммунальной собственности, устанавливаются законом.
3. К договору аренды жилья, кроме аренды жилья, которое является объектом права государственной или коммунальной собственности, применяются положения Гражданского кодекса Украины, если другое не установлено законом.

Статья 810-1. Аренда жилья с выкупом
1. Аренда жилья с выкупом является особым видом найма (аренды) жилья может предусматривать уступку арендодателем права требования долга другому лицу - выгодоприобретателю.
2. По договору аренды жилья с выкупом одна сторона - предприятие-арендодатель передает другой стороне - физическому лицу (Лицу-арендатору) жилье за плату на долговременный (до 30 лет) срок, по истечении которого или досрочно, при условии полной уплаты арендных платежей, жилье переходит в собственность арендатора.
3. Предприятие-арендодатель приобретает право собственности на предварительно избранное лицом-арендатором жилье с целью последующей передачи такого жилья в долгосрочную аренду с выкупом такому лицу и осуществляет распоряжение таким жильем до его полного выкупа.
4. Заключения и прекращения договора аренды жилья с выкупом осуществляются на условиях и в порядке, определенных законом.
5. Существенными условиями договора аренды жилья с выкупом являются:
наименование сторон;
характеристики жилья, по которому устанавливаются отношения аренды с выкупом;
срок, на который заключается договор;
размеры, порядок формирования, способ, форма и сроки внесения арендных платежей и условия их пересмотра;
условия досрочного расторжения договора;
порядок возврата средств в случае досрочного расторжения или прекращения договора;
права и обязательства сторон;
ответственность сторон;
иные условия, определенные законом.
6. К договору аренды жилья с выкупом применяются положения статей 811, 813-820, 823, части второй статьи 825, статей 826, 1232-1 настоящего Кодекса с учетом особенностей, установленных законом.
7. Договор аренды жилья с выкупом является документом, свидетельствующим о переходе права собственности на недвижимое имущество от предприятия-арендодателя к лицу-арендатора с отлагательными обстоятельствами, определенными законом.

Статья 811. Форма договора аренды жилья
1. Договор аренды жилья составляется в письменной форме.
2. Договор аренды жилья с выкупом подлежит обязательному нотариальному удостоверению.
3. Исключен

Статья 812. Предмет договора аренды жилья
1. Предметом договора найма жилья могут быть помещение, в частности квартира или ее часть, жилой дом или его часть.
2. Помещение может быть пригодным для постоянного проживания в нем.
3. Арендатор жилья в многоквартирном жилом доме имеет право пользования имуществом, которое обслуживает дом.

Статья 813. Стороны в договоре аренды жилья
1. Сторонами в договоре аренды жилья могут быть физические и юридические лица.
2. Если арендатором является юридическое лицо, оно может использовать жилье лишь для проживания в нем физических лиц.

Статья 814. Правопреемство в случае изменения собственника жилья, переданного в аренду
1. В случае изменения собственника жилья, переданного в аренду, к новому собственнику переходят права и обязанности арендодателя.

Статья 815. Обязанности арендатора жилья
1. Арендатор обязан использовать жилье лишь для проживания в нем, обеспечивать сохранение жилья и поддерживать его в надлежащем состоянии.
2. Арендатор не имеет права проводить переустройство и реконструкцию жилья без согласия арендодателя.
3. Арендатор обязан своевременно вносить плату за жилье. Арендатор обязан самостоятельно вносить плату за коммунальные услуги, если другое не установлено договором аренды.

Статья 816. Арендатор и лица, которые постоянно проживают вместе с ним
1. В договоре аренды жилья должны быть указаны лица, которые будут проживать вместе с арендатором. Эти лица приобретают равные с арендатором права и обязанности относительно пользования жильем.
2. Арендатор несет ответственность перед арендодателем за нарушение условий договора лицами, которые проживают вместе с ним.
3. Если арендаторами жилья являются несколько лиц, их обязанности по договору аренды жилья являются солидарными.
4. Порядок пользования жильем арендатором и лицами, которые постоянно проживают вместе с ним, определяется по договоренности между ними, а в случае спора - устанавливается по решению суда.

Статья 817. Право арендатора и лиц, которые постоянно проживают вместе с ним, на вселение других лиц в жилье
1. Арендатор и лица, которые постоянно проживают вместе с ним, имеют право по их взаимному согласию и по согласию арендодателя вселить в жилье других лиц для постоянного проживания в нем.
2. Лица, которые вселились в жилье согласно части первой этой статьи, приобретают равные с другими лицами права пользования жильем, если другое не было предусмотрено при их вселении.

Статья 818. Временные жители
1. Арендатор и лица, которые постоянно проживают вместе с ним, по их взаимному согласию и с предшествующим сообщением арендодателя могут разрешить временное проживание в помещении другого лица (лиц) без взыскания платы за пользование жильем (временных жителей).
2. Временные жители не имеют самостоятельного права пользования жильем.
3. Временные жители должны освободить жилье по истечению согласованного с ними срока проживания или не позднее семи дней со дня предъявления к ним арендатором или арендодателем требования об освобождении помещения.

Статья 819. Ремонт жилья, переданного в аренду
1. Текущий ремонт жилья, переданного в аренду, обязан осуществлять Арендатор, если другое не установлено договором.
2. Капитальный ремонт жилья, переданного в аренду, обязан осуществлять арендодатель, если другое не установлено договором.
3. Переоборудование жилого дома, в котором находится жилье, переданное в аренду, если такое переоборудование существенным образом изменит условия пользования жильем, не допускается без согласия арендатора.

Статья 820. Плата за пользование жильем
1. Размер платы за пользование жильем устанавливается в договоре аренды жилья.
Если законом установлен максимальный размер платы за пользование жильем, плата, установленная в договоре, не может превышать этого размера.
2. Одностороннее изменение размера платы за пользование жильем не допускается, если другое не установлено договором или законом.
3. Арендатор вносит плату за пользование жильем в срок, установленный договором аренды жилья.
Если срок внесения платы за пользование жильем не установлен договором, Арендатор вносит ее ежемесячно.
4. Арендные платежи по договору аренды жилья с выкупом - периодические платежи, которые лицо-арендатор платит предприятию-арендодателю согласно условиям договора аренды жилья с выкупом в течение всего срока действия договора. Арендные платежи включают платежи на выкуп выбранного лицом-арендатором жилья, вознаграждение (доход) арендодателя. Лицо-арендатор также обязана компенсировать предприятию-арендодателю расходы, определенные законом.

Статья 821. Срок договора аренды жилья
1. Договор найма жилья составляется на срок, установленный договором. Если в договоре срок не установлен, договор считается заключенным на пять лет.
2. К договору аренды жилья, заключенного на срок до одного года (краткосрочная аренда), не применяются положения части первой статьи 816, положение статьи 818 и статей 822-824 Гражданского кодекса Украины.

Статья 822. Преобладающие права арендатора жилья
1. В случае истечения срока договора аренды жилья Арендатор имеет преобладающее право на заключение договора аренды жилья на новый срок.
Не позднее чем за три месяца до истечения срока договора аренды жилья арендодатель может предложить нанимателю заключить договор на тех же или других условиях или предупредить арендатора об отказе от заключения договора на новый срок. Если арендодатель не предупредил арендатора, а Арендатор не освободил помещение, договор считается заключенным на таких же условиях и на тат же срок.
Если арендодатель отказался от заключения договора на новый срок, но на протяжении одного года заключил договор аренды жилья с другим лицом, Арендатор имеет право требовать перевода на него прав арендатора и (или) возмещения убытков, причиненных отказом заключить с ним договор на новый срок.
2. В случае продажи жилья, которое было предметом договора аренды, Арендатор имеет преобладающее перед другими лицами право на его приобретение.

Статья 823. Договор субаренды жилья
1. По договору субаренды жилья Арендатор по согласию арендодателя передает на определенный срок часть или все нанятое ним помещение в пользование субарендатору. Субарендатор не приобретает самостоятельного права пользования жильем.
2. Договор субаренды жилья является оплатным. Размер платы за пользование жильем устанавливается договором субаренды.
3. Срок договора субаренды не может превышать срока договора аренды жилья.
4. В случае досрочного прекращения договора аренды жилья одновременно с ним прекращается договор субаренды.
5. К договору субаренды не применяется положение о преобладающем праве на заключение договора на новый срок.

Статья 824. Замена арендатора в договоре аренды жилья
1. По требованию арендатора и других лиц, которые постоянно проживают вместе с ним, и по согласию арендодателя Арендатора в договоре аренды жилья может быть заменен одним из совершеннолетних лиц, которое постоянно проживает вместе с арендатором.
2. В случае смерти арендатора или убытия его из жилья арендаторами могут стать все другие совершеннолетние лица, которые постоянно проживали с бывшим арендатором, или, по согласованию с арендодателем, одно или несколько из этих лиц. В этом случае договор найма жилья остается действующим на предшествующих условиях.

Статья 825. Разрыв договора аренды жилья
1. Арендатор жилья имеет право по согласию других лиц, которые постоянно проживают вместе с ним, в любое время отказаться от договора аренды, письменно предупредив об этом арендодателя за треи месяца.
Если Арендатор освободил помещения без предупреждения, арендодатель имеет право требовать от него плату за пользование жильем за треи месяца, если арендодатель докажет, что он не мог заключить договор аренды жилья на таких же самых условиях с другим лицом.
Арендатор имеет право отказаться от договора аренды жилья, если жилье стало непригодным для постоянного проживания в нем.
Досрочное расторжение договора аренды жилья с выкупом до момента вступления арендодателем права на жилье осуществляется в порядке, определенном законом. Договор аренды жилья с выкупом может быть расторгнут в случаях, определенных законом.
2. Договор аренды жилья может быть разорван по решению суда по требованию арендодателя в случае:
невнесения арендатором платы за жилье за шесть месяцев, если договором не установлен более продолжительный срок, а при краткосрочном найме - свыше двух раз;
разрушение или порча жилья арендатором или другими лицами, за действия которых он отвечает.
По решению суда нанимателю может быть предоставлен срок не более одного года для восстановления жилья.
Если на протяжении срока, определенного судом, Арендатор не устранит допущенных нарушений, суд по повторному иску арендодателя постановляет решение о разрыве договора аренды жилья. По просьбе арендатора суд может отсрочить выполнение решения не больше чем на один год.
3. Договор аренды части дома, квартиры, комнаты (части комнаты) может быть разорван по требованию арендодателя в случае необходимости использования жилья для проживания самого арендодателя и членов его семьи.
Арендодатель должен предупредить арендатора о разрыве договора не более поздний чем за два месяца.
4. Если Арендатор жилья или другие лица, за действия которых он отвечает, используют жилье не по назначению или систематически нарушают права и интересы соседей, арендодатель может предупредить арендатора о необходимости устранения этих нарушений.
Если Арендатор или другие лица, за действия которых он отвечает, после предупреждения продолжают использовать жилье не по назначению или нарушать права и интересы соседей, арендодатель имеет право требовать разрыва договора аренды жилья.

Статья 826. Правовые последствия разрыва договора аренды жилья
1. В случае разрыва договора аренды жилья Арендатор и прочие лица, которые проживали в помещении, подлежат выселению из жилья на основании решения суда, без предоставления им другого жилья.
"""
GKU_g_60 = """ 
Глава 60 - Гражданского кодекса
Ссуда

Статья 827. Договор ссуды
1. По договору ссуды одна сторона (cсудодатель) безвозмездно передает или обязуется передать второй стороне (пользователю) вещь для пользования на протяжении установленного срока.

2. Пользование вещью считается безвозмездным, если стороны прямо договорились об этом или если это вытекает из сути отношений между ними.

3. К договору ссуды применяются положения главы 58 Гражданского кодекса Украины.

Статья 828. Форма договора ссуды
1. Договор ссуды вещи бытового назначения между физическими лицами может составляться устно.

2. Договор ссуды между юридическими лицами, а также между юридическим и физическим лицом составляется в письменной форме.

3. Договор ссуды здания, другого капитального сооружения (их отдельной части) составляется в форме, определенной согласно статье 793 Гражданского кодекса Украины.

4. Договор ссуды транспортного средства (кроме наземных самоходных транспортных средств), в котором хотя бы одной стороной является физическое лицо, составляется в письменной форме и подлежит нотариальному удостоверению.

Статья 829. Заимодатель
1. Заимодателем может быть физическое или юридическое лицо.

Лицо, которое осуществляет управление имуществом, может быть Заимодателем по согласию собственника.

2. Юридическое лицо, которое осуществляет предпринимательскую деятельность, не может передавать вещи в безвозмездное пользование лицу, которое является ее основателем, участником, руководителем, членом ее органа управления или контроля.

Статья 830. Правовые последствия невыполнения обязанности передать вещь в пользование
1. Если cсудодатель не выполняет обязанности передать вещь в пользование, вторая сторона имеет право требовать разрыва договора ссуды и возмещения причиненных убытков.

Статья 831. Срок договора ссуды
1. Если стороны не установили срока пользования вещью, он определяется согласно цели пользования ею.

Статья 832. Право заимодателя на отчуждение вещи
1. Ссудодатель имеет право на отчуждение вещи, переданной им в пользование. К приобретателю вещи переходят права и обязанности заимодателя.

2. Пользователь не имеет преобладающего права перед другими лицами на покупку вещи, переданной ему в пользование.

Статья 833. Обязанности пользователя
1. Пользователь несет обычные затраты относительно поддержания надлежащего состояния вещи, переданной ему в пользования.

2. Пользователь обязан:

пользоваться вещью за ее назначению или согласно цели, определенной в договоре;
пользоваться вещью лично, если другое не установлено договором;
возвратить вещь после окончания срока договора в таком же состоянии, в котором она была на момент его передачи.
Статья 834. Разрыв договора ссуды
1. Пользователь имеет право возвратить вещь, переданную ему в пользование, в любое время до истечения срока договора. Если вещь требует особого ухода или сохранения, пользователь обязан сообщить заимодателю об отказе от договора (ссуды) не позднее чем за семь дней до возвращения вещи.

2. Ссудодатель имеет право требовать разрыва договора и возвращения вещи в случае, если:

в связи с непредвиденными обстоятельствами вещь постояно нужна ему самому;
пользование вещью не отвечает ее назначению и условиям договора;
вещь самовольно передана в пользование другому лицу;
в результате небрежного обращения с вещью она может быть уничтожена или повреждена.
3. Лицо, которое стало собственником вещи, переданной в пользование, имеет право требовать разрыва договора, который заключен без определения срока. О разрыве договора пользователь должен быть осведомлен заранее, в срок, который отвечает цели ссуды.

Статья 835. Прекращение договора ссуды
1. Договор ссуды прекращается в случае смерти физического лица или ликвидации юридического лица, которому вещь была передана в пользование, если другое не установлено договором.

Статья 836. Правовые последствия невозвращения вещи после окончания срока пользования ею
1. Если после прекращения договора пользователь не возвращает вещь, ссудодатель имеет право требовать ее принудительного возвращения, а также возмещения причиненных убытков.
"""
GKU_g_61 = """ 
Глава 61 - Гражданского кодекса
Подряд

Параграф 1. Общие положения о подряде

Статья 837. Договор подряда
1. По договору подряда одна сторона (подрядчик) обязуется на свой риск выполнить определенную работу по заданию второй стороны (заказчика), а заказчик обязуется принять и оплатить выполненную работу.

2. Договор подряда может составляться на изготовление, обработку, переработку, ремонт вещи или на выполнение другой работы с передачей ее результата заказчику.

3. Для выполнения отдельных видов работ, установленных законом, подрядчик (субподрядчик) обязан получить специальное разрешение.

4. К отдельным видам договоров подряда, установленных параграфами 2-4 этой главы, положение этого параграфа применяются, если другое не установлено положениями этого Кодекса об этих видах договоров.

Статья 838. Генеральный подрядчик и субподрядчик
1. Подрядчик имеет право, если другое не установлено договором, привлечь к выполнению работы других лиц (субподрядчиков), оставаясь ответственным перед заказчиком за результат их работы. В этом случае подрядчик выступает перед заказчиком как генеральный подрядчик, а перед субподрядчиком - как заказчик.

2. Генеральный подрядчик отвечает перед субподрядчиком за невыполнение или ненадлежащее выполнение заказчиком своих обязанностей по договору подряда, а перед заказчиком - за нарушение субподрядчиком своей обязанности.

Заказчик и субподрядчик не имеют права предъявлять друг другу требования, связанные с нарушением договоров, заключенных любым из них с генеральным подрядчиком, если другое не установлено договором или законом.

Статья 839. Выполнение работы из материала подрядчика и его средствами
1. Подрядчик обязан выполнить работу, определенную договором подряда, из своего материала и своими средствами, если другое не установлено договором.

2. Подрядчик отвечает за ненадлежащее качество предоставленных им материала и оборудования, а также за предоставление материала или оборудования, отягощенного правами третьих лиц.

Статья 840. Выполнение работы из материала заказчика
1. Если работа выполняется частично или в полном объеме из материала заказчика, подрядчик отвечает за неправильное использование этого материала. Подрядчик обязан предоставить заказчику отчет об использовании материала и возвратить его остаток.

2. Если работа выполняется из материала заказчика, в договоре подряда должны быть установлены нормы затрат материала, сроки возвращения его остатка и основных отходов, а также ответственность подрядчика за невыполнение или ненадлежащее выполнение своих обязанностей.

3. Подрядчик отвечает за невыполнение или ненадлежащее выполнение работы, вызванное недостатками материала, предоставленного заказчиком, если не докажет, что эти недостатки не могли быть им выявлены при надлежащем приеме материала.

Статья 841. Обязанность подрядчика сохранять предоставленное ему имущество
1. Подрядчик обязан принимать все меры относительно сохранения имущества, переданного ему заказчиком, и отвечает за потерю или повреждение этого имущества.

Статья 842. Риск случайного уничтожения или случайного повреждения материала
1. Риск случайного уничтожения или случайного повреждения (порча) материала до наступления срока сдачи подрядчиком определенного договором подряда работы несет сторона, которая предоставила материал, а после наступления этого срока - сторона, которая пропустила срок, если другое не установлено договором или законом.

Статья 843. Цена работы
1. В договоре подряда определяется цена работы или способы ее определения.

2. Если в договоре подряда не установлена цена работы или способы ее определения, цена устанавливается по решению суда на основе цен, которые обычно применяются за аналогичные работы с учетом необходимых затрат, определенных сторонами.

3. Цена работы в договоре подряда включает возмещение затрат подрядчика и плату за выполненную им работу.

Статья 844. Смета
1. Цена в договоре подряда может быть определена в смете. Если работа выполняется согласно смете, составленной подрядчиком, смета вступает в силу и становится частью договора подряда с момента подтверждения его заказчиком.

2. Смета на выполнение работ может быть приблизительной или твердой. Смета является твердой, если другое не установлено договором.

3. Изменения в твердую смету могут вноситься лишь по согласованию сторон.

В случае превышения твердой сметы все связанные с этим затраты несет подрядчик, если другое не установлено законом.

4. Если возникла необходимость проведения дополнительных работ и в связи с этим существенное превышение определенной приблизительной сметы, подрядчик обязан своевременно предупредить об этом заказчика. Заказчик, который не согласился на превышение сметы, имеет право отказаться от договора подряда. В этом случае подрядчик может требовать от заказчика оплаты выполненной части работы.

Подрядчик, который своевременно не предупредил заказчика о необходимости превышения приблизительной сметы, обязан выполнить договор подряда по цене, установленной договором.

5. Подрядчик не имеет права требовать увеличения твердой сметы, а заказчик - ее уменьшения в случае, если на момент заключения договора подряда нельзя было предусмотреть полный объем работы или необходимые для этого затраты.

В случае важного возрастания после заключения договора стоимости материала, оборудования, которые должны были быть предоставлены подрядчиком, а также стоимости услуг, которые предоставлялись ему другими лицами, подрядчик имеет право требовать увеличения сметы. В случае отказа заказчика от увеличения сметы подрядчик имеет право требовать разрыва договора.

Статья 845. Бережливость подрядчика
1. Подрядчик имеет право на экономное ведение работ при условии обеспечения надлежащего их качества.

2. Если фактические затраты подрядчика оказались меньше тех, которые предполагалось при определении цены (сметы), подрядчик имеет право на оплату работы по цене, установленной договором подряда, если заказчик не докажет, что полученное подрядчиком сбережение обусловило ухудшение качества работы.

3. Стороны могут договориться о распределении между ними сбережения, полученного подрядчиком.

Статья 846. Сроки выполнения работы
1. Сроки выполнения работы или ее отдельных этапов устанавливаются в договоре подряда.

2. Если в договоре подряда не установлены сроки выполнения работы, подрядчик обязан выполнить работу, а заказчик имеет право требовать ее выполнения в разумные сроки, согласно сути обязательства, характера и объемов работы и обычаев делового оборота.

Статья 847. Обстоятельства, о которых подрядчик обязан предупредить заказчика
1. Подрядчик обязан своевременно предупредить заказчика:

о недоброкачественности или непригодности материала, полученного от заказчика;
о том, что соблюдение указаний заказчика угрожает качеству или пригодности результата работы;
о наличии других обстоятельств, которые не зависят от подрядчика, которые угрожают качеству или пригодности результата работы.
Статья 848. Правовые последствия невыполнения заказчиком требований подрядчика
1. Если заказчик, несмотря на своевременное предупреждение со стороны подрядчика, в соответствующий срок не заменит недоброкачественный или непригодный материал, не изменит указаний о способе выполнения работы или не устранит других обстоятельств, которые угрожают качеству или пригодности результата работы, подрядчик имеет право отказаться от договора подряда и право на возмещение убытков.

2. Если использование недоброкачественного или непригодного материала или соблюдения указаний заказчика угрожает жизни и здоровью людей или приводит к нарушению экологических, санитарных правил, правил безопасности людей и других требований, подрядчик обязан отказаться от договора подряда, имея право на возмещение убытков.

Статья 849. Права заказчика во время выполнения работы
1. Заказчик имеет право в любое время проверить ход и качество работы, не вмешиваясь в деятельность подрядчика.

2. Если подрядчик своевременно не начал работу или выполняет ее настолько медленно, что окончание ее в срок становится явным образом невозможным, заказчик имеет право отказаться от договора подряда и требовать возмещения убытков.

3. Если во время выполнения работы станет очевидным, что она не будет выполнена надлежащим образом, заказчик имеет право назначить подрядчику срок для устранения недостатков, а в случае невыполнения подрядчиком этого требования - отказаться от договора подряда и требовать возмещения убытков или поручить исправление работы другому лицу за счет подрядчика.

4. Заказчик имеет право в любое время до окончания работы отказаться от договора подряда, выплатив подрядчику плату за выполненную часть работы и возместив нему убытки, причиненные разрывом договора.

Статья 850. Содействие заказчика
1. Заказчик обязан оказывать содействие подрядчику в выполнении работы в случаях, в объеме и в порядке, установленных договором подряда.

В случае невыполнения заказчиком этой обязанности подрядчик имеет право требовать возмещения причиненных убытков, включая дополнительные затраты, вызванные простоем, перенесением сроков выполнения работы, или повышения цены работы.

2. Если выполнение работы по договору подряда стало невозможным вследствие действий или недосмотра заказчика, подрядчик имеет право в уплату ему установленной цены с учетом платы за выполненную часть работы, за вычетом сумм, которые подрядчик получил или мог получить в связи с невыполнением заказчиком договора.

Статья 851. Невыполнение заказчиком обязанностей по договору подряда
1. Подрядчик имеет право не начинать работу, а начатую работу остановить, если заказчик не предоставил материала, оборудование или вещь, которая подлежит переработке, и этим создал невозможность выполнения договора подрядчиком

Статья 852. Права заказчика в случае нарушения подрядчиком договора подряда
1. Если подрядчик отступил от условий договора подряда, что ухудшило работу, или допустил другие недостатки в работе, заказчик имеет право по своему выбору требовать безвозмездного исправления этих недостатков в разумный срок или исправить их за свой счет с правом на возмещение своих затрат на исправление недостатков или соответствующего уменьшения платы за работу, если другое не установлено договором.

2. При наличии в работе важных отступлений от условий договора подряда или других важных недостатков заказчик имеет право требовать разрыва договора и возмещения убытков

Статья 853. Обязанность заказчика принять работу, выполненную подрядчиком
1. Заказчик обязан принять работу, выполненную подрядчиком согласно договору подряда, осмотреть ее и в случае выявления допущенных в работе отступлений от условий договора или других недостатков немедленно заявить о них подрядчику.

Если заказчик не сделает такого заявления, он теряет право в дальнейшем ссылаться на эти отступления от условий договора или недостатки в выполненной работе.

2. Заказчик, который принял работу без проверки, лишается прав ссылаться на недостатки работы, которые могли быть установлены при обычном способе ее принятия (явные недостатки).

3. Если после принятия работы заказчик обнаружил отступления от условий договора подряда или другие недостатки, которые не могли быть установлены при обычном способе ее принятия (скрытые недостатки), в том числе преднамеренно скрытые подрядчиком, он обязан немедленно сообщить об этом подрядчику.

4. В случае возникновения между заказчиком и подрядчиком спора по поводу недостатков выполненной работы или их причин по требованию кого-нибудь из них может быть назначена экспертиза. Затраты на проведение экспертизы несет подрядчик, кроме случаев, если экспертизой установлено отсутствие нарушений договора подряда или причинной связи между действиями подрядчика и выявленными недостатками. В этих случаях затраты на проведение экспертизы несет сторона, которая требовала ее назначения, а если экспертиза назначена по согласованию сторон, - обе стороны поровну.

5. Если заказчик в течение одного месяца уклоняется от принятия выполненной работы, подрядчик имеет право после двукратного предупреждения продать результат работы, а сумму выручки, с вычетом всех причитающихся подрядчику платежей, внести в депозит нотариуса, нотариальной конторы на имя заказчика, если иное не установлено договором.

6. Если уклонение заказчика от принятия выполненной работы послужило причиной изменения срока сдачи работы, считается, что право собственности на изготовленную (переработанную) вещь перешло к заказчику в момент, когда должна была состояться ее передача.

Статья 854. Порядок оплаты работы
1. Если договором подряда не предусмотрена предшествующая оплата выполненной работы или отдельных ее этапов, заказчик обязан уплатить подрядчику обусловленную цену после окончательной сдачи работы при условии, что работа выполнена надлежащим образом и в согласованный срок или, по согласию заказчика, - досрочно.

2. Подрядчик имеет право требовать выплаты ему аванса лишь в случае и в размере, установленных договором.

Статья 855. Расчеты между сторонами в случае случайного уничтожения предмета договора подряда или невозможности окончанияработы
1. Если предмет договора подряда до сдачи его заказчику был случайно уничтожен или окончание работы стало невозможным без вины сторон, подрядчик не имеет права требовать платы за работу.

Подрядчик имеет право на оплату, если уничтожение предмета договора подряда или невозможность окончания работы произошли из-за недостатков материала, переданного заказчиком, или вследствие его указаний о способе выполнения работы или если такое уничтожение или невозможность окончания работы произошли после пропуска заказчиком срока принятия выполненной работы.

Статья 856. Право подрядчика на приостановление
1. Если заказчик не уплатил установленной цены работы или другой суммы, надлежащей подрядчику в связи с выполнением договора подряда, подрядчик имеет право приостановить результат работы, а также оборудование, остаток неиспользованного материала и прочее имущество заказчика, который есть у подрядчика.

Статья 857. Качество работы
1. Работа, выполненная подрядчиком, должна отвечать условиям договора подряда, а в случае их отсутствия или неполноты - требованиям, которые обычно относятся к работе соответствующего характера.

2. Выполненная работа должна отвечать качеству, определенному в договоре подряда, или требованиям, которые обычно выдвигаются, на момент передачи ее заказчику.

3. Результат работы в границах разумного срока может быть пригодным для использования согласно договору подряда или для обычного использования работы такого характера.

Статья 858. Ответственность подрядчика за ненадлежащее качество работы
1. Если работа выполнена подрядчиком с отступлениями от условий договора подряда, которые ухудшили работу, или с другими недостатками, которые делают ее непригодной для использования согласно договору или для обычного использования работы такого характера, заказчик имеет право, если другое не установлено договором или законом, по своему выбору требовать от подрядчика:

безвозмездного устранения недостатков в работе в разумный срок;
пропорционального уменьшения цены работы;
возмещения своих затрат на устранение недостатков, если право заказчика устранять их установлено договором.
2. Подрядчик имеет право вместо устранения недостатков работы, за которые он отвечает, безвозмездно выполнить работу заново с возмещением заказчику убытков, причиненных просрочкой выполнения. В этом случае заказчик обязан возвратить ранее переданную ему работу подрядчику, если по характеру работы такое возвращение возможно.

3. Если отступления в работе от условий договора подряда или другие недостатки в работе являются важными и не устранимыми, или не были устранены в установленный заказчиком разумный срок, заказчик имеет право отказаться от договора и требовать возмещения убытков.

4. Условие договора подряда об освобождении подрядчика от ответственности за определенные недостатки работы не освобождает его от ответственности за недостатки, которые возникли вследствие умышленных действий или бездеятельности подрядчика.

5. Подрядчик, который предоставил материал для выполнения работы, отвечает за его качество согласно положениям об ответственности продавца за товары ненадлежащего качества.

Статья 859. Гарантия качества работы
1. Если договором или законом предусмотрено предоставления подрядчиком заказчику гарантии качества работы, подрядчик обязан передать заказчику результат работы, которая может отвечать требованиям статьи 857 Гражданского кодекса Украины на протяжении всего гарантийного срока.

2. Гарантия качества работы распространяется на все, что составляет результат работы, если другое не установлено договором подряда.

Статья 860. Порядок вычисления гарантийного срока
1. Истечение гарантийного срока начинается с момента, когда выполненная работа была принята или должна была быть принята заказчиком, если другое не установлено договором подряда.

2. К исчислению гарантийного срока по договору подряда применяются положения статьи 676 Гражданского кодекса Украины, если другое не установлено договором или законом.

Статья 861. Обязанность подрядчика передать информацию заказчику
1. Подрядчик обязан передать заказчику вместе с результатом работы информацию относительно эксплуатации или другого использования предмета договора подряда, если это предусмотрено договором или если без такой информации использование результата работы для целей, определенных договором, является невозможным.

Статья 862. Конфиденциальность полученной сторонами информации
1. Если сторона в договоре подряда вследствие выполнения договора получила от второй стороны информацию о новых решениях и технических знаниях, в том числе и не защищенных законом, а также сведения, которые могут рассматриваться как коммерческая тайна, она не имеет права сообщать их другим лицам без согласия второй стороны.

Статья 863. Исковая давность, которая применяется к требованиям относительно ненадлежащего качества работы
1. К требованиям относительно ненадлежащего качества работы, выполненной по договору подряда, применяется исковая давность в один год, а относительно зданий и сооружений - три года со дня принятия работы заказчиком.

Статья 864. Начало хода исковой давности в отдельных случаях
1. Если договором подряда или законом установлен гарантийный срок и заявление по поводу недостатков работы сделано в границах гарантийного срока, истечение исковой давности начинается со дня заявления о недостатках.

2. Если согласно договору подряда работа была принята заказчиком частями, истечение исковой давности начинается со дня принятия работы в целом.

Параграф 2. Бытовой подряд

Статья 865. Договор бытового подряда
1. По договору бытового подряда подрядчик, который осуществляет предпринимательскую деятельность, обязуется выполнить по заданию физического лица (заказчика) определенную работу, предназначенную для удовлетворения бытовых и других личных потребностей, а заказчик обязуется принять и оплатить выполненную работу.

2. Договор бытового подряда является публичным договором.

3. К отношениям по договору бытового подряда, не урегулированных этим Кодексом, применяется законодательство о защите прав потребителей.

Статья 866. Форма договора бытового подряда
1. Договор бытового подряда считается заключенным в надлежащей форме, если подрядчик выдал заказчику квитанцию или другой документ, который подтверждает заключение договора.

Отсутствие у заказчика этого документа не лишает его права привлекать свидетелей для подтверждения факта заключения договора или его условий.

Статья 867. Гарантии прав заказчика
1. Подрядчик не имеет права навязывать заказчику включения в договор бытового подряда дополнительных оплатных работ или услуг. В случае нарушения этого требования заказчик имеет право отказаться от оплаты соответствующих работ или услуг.

2. Заказчик имеет право в любое время до сдачи ему работы отказаться от договора бытового подряда, уплатив подрядчику часть установленной цены работы пропорционально работе, фактически выполненной до сообщения об отказе от договора, и возместив ему затраты, осуществленные до этого момента с целью выполнения договора, если они не входят в часть цены работы, которая подлежит уплате. Условия договора, которые лишают заказчика этого права, являются ничтожными.

Статья 868. Предоставление заказчику информации о работе
1. Подрядчик обязан до заключения договора бытового подряда предоставить заказчику необходимую и достоверную информацию о предложенных работах, их видах и особенностях, о цене и форме оплаты работы, а также сообщить заказчику по его просьбе другие сведения, которые касаются договора. Подрядчик обязан назвать заказчику конкретное лицо, которое будет выполнять работу, если по характеру работы это имеет значение.

Статья 869. Публичное предложение работы
1. К рекламе и другим предложениям относительно работы, которая выполняется по договору бытового подряда, применяются положения статьи 641 этого Кодекса.

2. При сдаче работ заказчику подрядчик обязан сообщить его о требованиях, которые необходимо соблюдать для эффективного и безопасного использования изготовленной или переработанной вещи или другой выполненной работы, а также про возможные для заказчика или других лиц последствия несоблюдения соответствующих требований.

3. Заказчик имеет право требовать разрыва договора бытового подряда и возмещения убытков, если вследствие неполноты или недостоверности информации, полученной от подрядчика, был заключен договор на выполнение работ, которые не имеют тех свойств, которые имел в виду заказчик.

Статья 870. Выполнение работы по договору бытового подряда из материала подрядчика
1. По договору бытового подряда подрядчик выполняет работу со своего материала, а по желанию заказчика - из его материала.

2. Если работа выполняется из материала подрядчика, стоимость материала оплачивается заказчиком частично или в полном объеме, по согласованию сторон, с окончательным расчетом при получении заказчиком выполненной подрядчиком работы. В случаях, предусмотренных договором, материал может быть предоставлен подрядчиком в кредит (с рассрочкой платежа). Дальнейшее изменение цены предоставленного в кредит материала не приводит к перерасчету, если другое не установлено договором.

Статья 871. Выполнение работы по договору бытового подряда из материала заказчика
1. Если работа выполняется из материала заказчика, в квитанции или другом документе, который выдается подрядчиком при заключении договора бытового подряда, указываются точное наименование материала, его количество и оценка, осуществленная по согласованию сторон.

Статья 872. Права заказчика в случае существенного нарушения подрядчиком договора бытового подряда
1. Если подрядчиком были допущены важные отступления от условий договора бытового подряда или другие важные недостатки в работе, выполненной из материала заказчика, он имеет право требовать по своему выбору:

изготовления другой вещи из однородного материала такого же качества;
разрыва договора и возмещения убытков.
2. В случае выявления других отступлений от условий договора или других недостатков в работе заказчик имеет право по своему выбору требовать безвозмездного устранения этих недостатков в разумный срок или возмещения его затрат на устранение недостатков или соответствующего уменьшения оплаты.

3. Требование о безвозмездном устранении недостатков работы, выполненной по договору бытового подряда, которые могут представлять опасность для жизни или здоровья заказчика и других лиц, может быть предъявлено заказчиком или его правопреемником на протяжении десяти лет с момента принятия работы, если в установленном законом порядке не предусмотрены более продолжительные сроки (сроки службы). Такое требование может быть предъявлено независимо от того, если выявлены эти недостатки, в том числе и при выявлении их после окончания гарантийного срока.

В случае невыполнения подрядчиком этого требования заказчик имеет право на протяжении этого же срока требовать возвращения части цены, уплаченной за работу, или возмещение его затрат на устранение недостатков.

Статья 873. Размер оплаты по договору бытового подряда
1. Стоимость работ, выполненных по договору бытового подряда, определяется по согласованию сторон, если другое не предусмотрено в установленном порядке прейскурантами (ценниками), тарифами и т.п..

2. Работа оплачивается заказчиком после ее окончательной передачи подрядчиком. По согласию заказчика работа может быть им оплачена при заключении договора бытового подряда путем выдачи аванса или в полном объеме.

Статья 874. Правовые следствия неявки заказчика за получением работы
1. В случае неявки заказчика за получением выполненной работы или иного уклонения заказчика от его принятия подрядчик имеет право, письменно предупредив заказчика, по истечении двух месяцев со дня такого предупреждения продать предмет договора бытового подряда за разумную цену, а сумму выручки, за вычетом всех надлежащих подрядчику платежей, внести в депозит нотариуса, нотариальной конторы на имя заказчика.

2. Подрядчик имеет право в случаях, определенных частью первой этой статьи, вместо продажи предмета договора бытового подряда придержать его или требовать возмещения.

Параграф 3. Строительный подряд

Статья 875. Договор строительного подряда
1. По договору строительного подряда подрядчик обязуется выстроить и показать в установленный срок объект или выполнить другие строительные работы согласно проектно-сметной документации, а заказчик обязуется предоставить подрядчику строительную площадку (фронт работ), передать утвержденную проектно-сметную документацию, если эта обязанность не возлагается на подрядчика, принять объект или законченные строительные работы и оплатить их.

2. Договор строительного подряда составляется на проведение нового строительства, капитального ремонта, реконструкции (технического переоснащения) предприятий, зданий (в частности жилых домов), сооружений, выполнение монтажных, пусконаладочных и других работ, неразрывно связанных с местонахождением объекта.

3. К договору строительного подряда применяются положения этого Кодекса, если другое не установлено законом.

Статья 876. Право собственности на объект строительства
1. Собственником объекта строительства или результата других строительных работ является заказчик, если иное не предусмотрено договором.

Статья 877. Проектно-сметная документация
1. Подрядчик обязан осуществлять строительство и связанные с ним строительные работы согласно проектной документации, которая определяет объем и содержание работ и прочие требования, которые относятся к работам и в смету, которая определяет цену работ.

Подрядчик обязан выполнить все работы, определенные в проектной документации и в смете (проектно-сметной документации), если другое не установлено договором строительного подряда.

2. Договором строительного подряда должны быть определены состав и содержание проектно-сметной документации, а также может быть определено, какая из сторон и в какой срок обязана предоставить соответствующую документацию.

3. Подрядчик, который обнаружил в ходе строительства не учтенные проектной документацией работы и необходимость в связи с этим проведения дополнительных работ и увеличения сметы, обязан сообщить об этом заказчику.

В случае неполучения от заказчика в разумный срок ответа на свое сообщение подрядчик обязан остановить соответствующие работы с отнесением убытков, причиненных этой остановкой, на заказчика. Заказчик освобождается от возмещения этих убытков, если докажет, что в проведении дополнительных работ нет необходимости.

4. Если подрядчик не выполнил обязанности, установленые частью третьей этой статьи, он лишается прав требовать от заказчика оплату за выполненные дополнительные работы и право на возмещение причиненных этим убытков, если не докажет, что его немедленные действия были необходимыми в интересах заказчика, в частности в связи с тем, что остановка работы могла привести к уничтожению или повреждению объекта строительства.

Статья 878. Внесение изменений в проектно-сметную документацию
1. Заказчик имеет право вносить изменения в проектно-сметную документацию до начала работ или во время их выполнения при условии, что дополнительные работы, вызванные такими изменениями, по стоимости не превышают десяти процентов определенной в смете цены и не изменяют характера работ, определенных договором.

2. Внесение в проектно-сметную документации изменений, которые требуют дополнительных работ, стоимость которых превышает десять процентов определенной в смете цены, допускается лишь по согласию подрядчика. В этом случае подрядчик имеет право отказаться от договора и требовать возмещения убытков.

Статья 879. Обеспечение строительства и оплата работ
1. Материально-техническое обеспечение строительства возлагается на подрядчика, если другое не установлено договором строительного подряда. Договором на заказчика может быть возложена обязанность оказывать содействие подрядчику в обеспечении строительства водоснабжением, электроэнергией и т.п., а также в предоставлении других услуг.

2. Подрядчик, который обязан осуществлять материально-техническое обеспечение строительства, несет риск невозможности использования предоставленного им материала (деталей, конструкций) или оборудования без ухудшения качества работ.

3. В случае невозможности использование материала (деталей, конструкций) или оборудования, предоставленного заказчиком, без ухудшения качества выполняемых работ подрядчик имеет право отказаться от договора и требовать от заказчика уплаты цены работ пропорционально их выполненной части, а также возмещения убытков, не покрытых этой суммой.

4. Оплата работ ведется после принятия заказчиком построенного объекта (выполненных работ), если другой порядок расчетов не установлен по согласованию сторон.

5. В случае разрушения или повреждения объекта строительства вследствие непреодолимой силы до истечения установленного договором строительного подряда срока сдачи объекта, а также в случае невозможности завершить строительство (строительные работы) по другой причине, которые не зависят от заказчика, подрядчик не имеет права требовать от заказчика оплату за работу или оплату затрат, если другое не установлено договором.

6. В случае необходимости консервации строительства по независимым от сторон обстоятельствам заказчик обязан оплатить подрядчику выполненные до консервации работы и возместить ему затраты, связанные с консервацией.

Статья 880. Риск случайного уничтожения или случайного повреждения объекта
1. Отнесение риска случайного уничтожения или случайного повреждения объекта строительства на заказчика или подрядчика к его принятия заказчиком устанавливается в соответствии с требованиями закона, кроме случаев, когда это произошло вследствие обстоятельств, зависели от заказчика.

Статья 881. Страхование объекта строительства
1. Страхование объекта строительства или комплекса работ осуществляется подрядчиком или заказчиком в соответствии с законодательства..

Сторона, на которую полагается обязанность относительно страхования, может предоставить второй стороне в порядке, установленном договором, доказательства заключения ею договора страхования, включая сведения о страхователе, размере страховой суммы и застрахованных рисках.

2. Недостатки работ или используемого для работ материала, допущенные по вине подрядчика (или субподрядчика), должны быть устранены подрядчиком за его счет.

3. Заказчик имеет право с целью осуществления контроля и надзора за строительством и принятия от своего имени соответствующих решений заключить договор о предоставлении такого вида услуг со специализированной организацией или специалистом. В этом случае в договоре строительного подряда определяются функции и полномочия такого специалиста.

Статья 882. Передача и принятие работ
1. Заказчик, который получил сообщение подрядчика о готовности к передаче работ, выполненных по договору строительного подряда, или, если это предусмотрено договором, - этапа работ, обязан немедленно начать их принятие.

2. Заказчик организовывает и осуществляет принятие работ за свой счет, если другое не установлено договором. В принятии работ должны принимать участие представители органов государственной власти и органов местного самоуправления в случаях, установленных законом или другими нормативно-правовыми актами.

3. Заказчик, который предварительно принял отдельные этапы работ, несет риск их уничтожения или повреждения не по вине подрядчика, в том числе и в случаях, если договором строительного подряда предусмотрены выполнения работ на риск подрядчика.

4. Передача работ подрядчиком и принятие их заказчиком оформляется актом, подписанным обоими сторонами. В случае отказа одной из сторон от подписания акта об этом указывается в акте и он подписывается второй стороной.

Акт, подписанный одной стороной, может быть признан судом недействительным лишь в случае, если мотивы отказа второй стороны от подписания акта признаны судом обоснованными.

5. Принятие работ может осуществляться после предшествующего испытания, если это предусмотрено договором строительного подряда или вытекает из характера работ. В этом случае принятие работ может осуществляться лишь в случае положительного результата предшествующего испытания.

6. Заказчик имеет право отказаться от принятия работ в случае выявления недостатков, которые исключают возможность использования объекта для указанной в договоре цели и не могут быть устранены подрядчиком, заказчиком или третьим лицом.

Статья 883. Ответственность подрядчика
1. Подрядчик отвечает за недостатки построенного объекта, за просрочку передачи ее заказчику и за другие нарушения договора (за недостижение проектной мощности, других запроектированных показателей и т.п.), если не докажет, что эти нарушения произошли не по его вине.

2. За невыполнение или ненадлежащее выполнение обязанностей по договору строительного подряда подрядчик платит неустойку, установленную договором или законом, и возмещает убытки в полном объеме.

3. Суммы неустойки (пени), уплаченные подрядчиком за нарушение сроков выполнение отдельных работ, возвращаются подрядчику в случае окончания всех работ до установленного договором предельного срока.

Статья 884. Гарантии качества в договоре строительного подряда
1. Подрядчик гарантирует достижение объектом строительства определенных в проектно-сметной документации показателей и возможность эксплуатации объекта согласно договору на протяжении гарантийного срока, если другое не установлено договором строительного подряда. Гарантийный срок составляет десять лет со дня принятия объекта заказчиком, если больший гарантийный срок не установлен договором или законом.

2. подрядчик отвечает за дефекты, выявленные в границах гарантийного срока, если он не докажет, что они произошли вследствие: естественного сноса объекта или его частей; неправильной его эксплуатации или неправильност инструкций относительно его эксплуатации, разработанных самим заказчиком или привлеченными им другими лицами; ненадлежащего ремонта объекта, который осуществлен самым заказчиком или привлеченными им третьими лицами.

3. Гарантийный срок продолжается во время, на протяжении которого объект не мог эксплуатироваться вследствие недостатков, за которые отвечает подрядчик.

4. В случае выявления на протяжении гарантийного срока недостатков заказчик должен заявить о них подрядчику в разумный срок после их выявления.

5. Договором строительного подряда может быть установлено право заказчика уплатить предусмотренную договором часть цены работ, определенной в смете, после окончания гарантийного срока.

Статья 885. Устранение недостатков за счет заказчика
1. Договором строительного подряда может быть предусмотрена обязанность подрядчика отстранять по требованию заказчика и за его счет недостатки, за которые подрядчик не отвечает.

Подрядчик имеет право отказаться от выполнения этой обязанности, если устранение недостатков не связано непосредственно с предметом договора или не может быть осуществлено подрядчиком по независимым от него причинам.

Статья 886. Ответственность заказчика
1. В случае невыполнения или ненадлежащего выполнения заказчиком обязанностей по договору строительного подряда он платит подрядчику неустойку, установленную договором или законом, и возмещает убытки в полном объеме, если не докажет, что нарушение договора произошло не по его вине.

Параграф 4. Подряд на проектные и поисковые работы

Статья 887. Договор подряда на проведение проектных и поисковых работ
1. По договору подряда на проведение проектных и поисковых работ подрядчик обязуется разработать по заданию заказчика проектную или другую техническую документацию и (или) выполнить поисковые работы, а заказчик обязуется принять и оплатить их.

2. К договору подряда на проведение проектных и поисковых работ применяются положения этого Кодекса, если другое не установлено законом.

Статья 888. Исходные данные для проведения проектных и поисковых работ
1. По договору подряда на проведение проектных и поисковых работ заказчик обязан передать подрядчику задание на проектирование, а также другие исходные данные, необходимые для составления проектно-сметной документации. Задание на проектирование может быть подготовлено по доверенности заказчика подрядчиком. В этом случае задание становится обязательным для сторон с момента его утверждения заказчиком.

2. Подрядчик обязан соблюдать требования, которые указаны в задании и других исходных данных для проектирования и выполнения поисковых работ, и имеет право отступить от них лишь по согласию заказчика.

Статья 889. Обязанности заказчика
1. Заказчик обязан, если другое не установлено договором подряда на проведение проектных и поисковых работ:

уплатить подрядчику установленную цену после завершения всех работ или уплатить ее частями после завершения отдельных этапов работ или в другом порядке, установленном договором или законом;
использовать проектно-сметную документацию, полученную от подрядчика, лишь для целей, установленных договором, не передавать проектно-сметную документацию другим лицам и не разглашать данные, которые указаны в ней, без согласия подрядчика;
предоставлять услуги подрядчику в выполнении проектных и поисковых работ в объеме и на условиях, установленных договором;
принимать участие вместе с подрядчиком в согласовании готовой проектно-сметной документации с уполномоченными органами государственной власти и органами местного самоуправления;
возместить подрядчику дополнительные затраты, связанные с изменением исходных данных для проведения проектных и поисковых работ вследствие обстоятельств, которые не зависят от подрядчика;
привлечь подрядчика к участию в деле по иску, предъявленному заказчику другим лицом в связи с недостатками составленной проектной документации или выполненных поисковых работ.
Статья 890. Обязанности подрядчика
1. Подрядчик обязан:

выполнять работы согласно исходных данных для проведения проектирования и в соответствии с договором;
согласовывать готовую проектно-сметную документацию с заказчиком, а в случае необходимости - также с уполномоченными органами государственной власти и органами местного самоуправления;
передать заказчику готовую проектно-сметную документацию и результаты поисковых работ;
не передавать без согласия заказчика проектно-сметную документацию другим лицам;
гарантировать заказчику отсутствие у других лиц права воспрепятствовать или ограничить выполнение работ на основе подготовленной по договору проектно-сметной документации.
Статья 891. Ответственность подрядчика за недостатки документации и работ
1. Подрядчик отвечает за недостатки проектно-сметной документации и поисковых работ, включая недостатки, выявленные со временем в ходе строительства, а также в процессе эксплуатации объекта, созданного на основе выполненной проектно-сметной документации и результатов поисковых работ.

2. В случае выявления недостатков в проектно-сметной документации или в поисковых роботах, подрядчик по требованию заказчика обязан безвозмездно переработать проектно-сметную документацию или осуществить необходимые дополнительные поисковые работы, а также возместить причиненные убытки, если другое не установлено договором или законом.
"""
GKU_g_62 = """ 
Глава 62 - Гражданского кодекса
Выполнение научно-исследовательских или опытно-конструкторских и технологических работ

Статья 892. Договор на выполнение научно-исследовательских или опытно-конструкторских и технологических работ
1. По договору на выполнение научно-исследовательских или опытно-конструкторских и технологических работ подрядчик (исполнитель) обязуется провести по заданию заказчика научные исследования, разработать образец нового изделия и конструкторскую документацию на него, новую технологию и т.п., а заказчик обязуется принять выполненную работу и оплатить ее.

Договор может охватывать весь цикл проведения научных исследований, разработку и изготовление образцов или его отдельные этапы.

Статья 893. Выполнение работ
1. Исполнитель обязан провести научные исследования лично, если другое не установлено договором на выполнение научно-исследовательских или опытно-конструкторских и технологических работ.

Исполнитель имеет право привлекать к выполнению научно-исследовательских работ других лиц лишь по согласию заказчика.

Исполнитель имеет право привлекать другие лица (субисполнителей) к выполнению опытно-конструкторских и технологических работ, если другое не установлено договором.

Статья 894. Передача, принятие и оплата работ
1. Исполнитель обязан передать, а заказчик принять и оплатить полностью завершенные научно-исследовательские или опытно-конструкторские и технологические работы. Договором могут быть предусмотрены принятие и оплата отдельных этапов работ или другой способ оплаты.

2. Плата за выполнение научно-исследовательских или опытно-конструкторских работ и технологических работ, установленная договором, может быть уменьшена заказчиком в зависимости от фактически полученных результатов сравнительно с результатами, предусмотренными договором, если это не зависело от заказчика, а возможность такого уменьшения и его границы были предусмотрены договоренностью сторон.

Статья 895. Конфиденциальность сведений о договоре
1. Исполнитель и заказчик обязанные обеспечить конфиденциальность сведений относительно предмета договора на выполнение научно-исследовательских или опытно-конструкторских и технологических работ, хода его выполнения и полученных результатов, если другое не установлено договором. Объем сведений, которые относятся к конфиденциальным, устанавливается договором.

Статья 896. Права сторон на результаты работ
1. Заказчик по договору на выполнение научно-исследовательских или опытно-конструкторских и технологических работ имеет право использовать переданные ему результаты работ в границах и на условиях, установленных договором.

2. Исполнитель имеет право использовать полученный им результат работ также для себя, если другое не установлено договором.

Договором может быть предусмотрено право исполнителя передавать результаты работ другим лицам.

Статья 897. Обязанности исполнителя
1. Исполнитель по договору на выполнение научно-исследовательских или опытно-конструкторских и технологических работ обязан:

выполнить работы соответственно согласованной с заказчиком программы (технико-экономических показателей) или тематики и передать заказчику результат в срок, установленный договором;
соблюдать требования, связанные с охраной прав интеллектуальной собственности;
воздержаться от публикации без согласия заказчика научно-технических результатов, полученных при выполнении работ;
принимать меры для защиты полученных при выполнении работ результатов, которые подлежат правовой охране, и информировать об этом заказчика;
своими силами и за свой счет устранять допущенные по его вине недостатки в технической документации, которые могут повлечь отступления от технико-экономических показателей, предусмотренных в технической задаче заказчика или в договоре;
немедленно информировать заказчика о выявленной невозможности получить ожидаемые результаты или нецелесообразность продолжать работу.
Статья 898. Обязанности заказчика
1. Заказчик по договору на выполнение научно-исследовательских или опытно-конструкторских и технологических работ обязан:

выдать исполнителю техническую задачу и согласовать с ним программу (технико-экономические показатели) или тематику работ;
передать исполнителю необходимую для выполнения работ информацию;
принять выполненные работы и оплатить их.
Статья 899. Последствия невозможности достижения результата
1. Если в ходе научно-исследовательских работ обнаруживается невозможность достижения результата вследствие обстоятельств, которые не зависят от исполнителя, заказчик обязан оплатить работы, проведенные до выявления невозможности получить предусмотренные договором результаты, но не выше соответствующей части цены работ, определенной договором.

2. Если в ходе выполнения опытно-конструкторских и технологических работ обнаруживается невозможность достижения результата вследствие обстоятельств, которые возникли не по вине исполнителя, заказчик обязан возместить затраты исполнителя.

Статья 900. Ответственность исполнителя за нарушение договора
1. Исполнитель отвечает перед заказчиком за нарушение договора на выполнение научно-исследовательских или опытно-конструкторских и технологических работ, если не докажет, что нарушение договора произошло не по его вине.

2. Исполнитель обязан возместить заказчику реальные убытки в границах цены работ, в которых выявлены недостатки, если договором установлено, что они подлежат возмещению в границах общей цены работ по договору.

Упущенная выгода подлежит возмещению в случаях, установленных законом.
"""
GKU_g_63 = """ 
Глава 63 - Гражданского кодекса
Услуги. Общие положения

Статья 901. Договор о предоставлении услуг
1. По договору о предоставлении услуг одна сторона (исполнитель) обязуется по заданию второй стороны (заказчика) предоставить услугу, которая потребляется в процессе совершения определенного действия или осуществления определенной деятельности, а заказчик обязуется оплатить исполнителю указанную услугу, если другое не установлено договором.

2. Положения этой главы могут применяться ко всем договорам о предоставлении услуг, если это не противоречит сути обязательства.

Статья 902. Выполнение договора о предоставлении услуг
1. Исполнитель должен предоставить услугу лично.

2. В случаях, установленных договором, исполнитель имеет право возложить выполнение договора о предоставлении услуг на другое лицо, оставаясь ответственным в полном объеме перед заказчиком за нарушение договора.

Статья 903. Оплата по договору о предоставлении услуг
1. Если договором предусмотрены предоставления услуг за оплату, заказчик обязан оплатить предоставленную ему услугу в размере, в сроки и в порядке, установленными договором.

2. В случае невозможности выполнить договор о предоставлении услуг, возникшей не по вине исполнителя, заказчик обязан выплатить исполнителю разумную плату. Если невозможность выполнить договор возникла по вине заказчика, он обязан выплатить исполнителю оплату в полном объеме, если другое не установлено договором или законом.

Статья 904. Возмещение исполнителю фактических затрат по договору о безвозмездном предоставлении услуг
1. По договору о безвозмездном предоставлении услуг заказчик обязан возместить исполнителю все фактические затраты, необходимые для выполнения договора.

2. Положения части первой этой статьи применяются также в случаях, когда невозможность выполнить договор о безвозмездном предоставлении услуг возникла по вине заказчика или вследствие непреодолимой силы.

Статья 905. Срок договора о предоставлении услуг
1. Срок договора о предоставлении услуг устанавливается по договоренности сторон, если другое не установлено законом или другими нормативно-правовыми актами.

Статья 906. Ответственность исполнителя за нарушение договора о предоставлении услуг
1. Убытки, причиненные заказчику невыполнением или ненадлежащим выполнением договора о предоставлении услуг за плату, подлежат возмещению исполнителем, в случае наличия его вины, в полном объеме, если другое не установлено договором. Исполнитель, который нарушил договор о предоставлении услуг за плату при осуществлении им предпринимательской деятельности, отвечает за это нарушение, если не докажет, что надлежащее выполнение оказалось невозможным вследствие непреодолимой силы, если другое не установлено договором или законом.

2. Убытки, причиненные невыполнением или ненадлежащим выполнением договора о безвозмездном предоставлении услуг, подлежат возмещению исполнителем в размере, который не превышает двух не облагаемых налогами минимумов доходов граждан, если другой размер ответственности исполнителя не установлен договором.

Статья 907. Разрыв договора о предоставлении услуг
1. Договор о предоставлении услуг может быть разорван, в том числе путем одностороннего отказа от договора, в порядке и на основаниях, установленных Гражданским кодексом Украины, другим законом или по договоренности сторон.

Порядок и последствия расторжения договора о предоставлении услуг определяются договоренностью сторон или законом.
"""
GKU_g_64 = """ 
Глава 64 - Гражданского кодекса
Перевозка

Статья 908. Общие положения о перевозке
1. Перевозка груза, пассажиров, багажа, почты осуществляется по договору перевозки.

2. Общие условия перевозки определяются Гражданским кодексом Украины, другими законами, транспортными кодексами (уставами), другими нормативно-правовыми актами и правилами, которые издаются согласно им.

Условия перевозки груза, пассажиров и багажа отдельными видами транспорта, а также ответственность сторон относительно этих перевозок устанавливаются договором, если другое не установлено Гражданским кодексом Украины, другими законами, транспортными кодексами (уставами), другими нормативно-правовыми актами и правилами, которые выдаются согласно им.

Статья 909. Договор перевозки груза
1. По договору перевозки груза одна сторона (перевозчик) обязуется доставить доверенный ей второй стороной (отправителем) груз до пункта назначения и выдать его лицу, которое имеет право на получение груза (получателю), а отправитель обязуется уплатить за перевозку груза установленную плату.

2. Договор перевозки груза составляется в письменной форме.

3. Заключение договора перевозки груза подтверждается составлением транспортной накладной (коносамента или другого документа, установленного транспортными кодексами (уставами).

4. Законом могут быть предусмотрены особенности заключения и выполнения договора перевозки груза.

Статья 910. Договор перевозки пассажира и багажа
1. По договору перевозки пассажира одна сторона (перевозчик) обязуется перевезти другую сторону (пассажира) к пункту назначения, а в случае сдачи багажа - также доставить багаж к пункту назначения и выдать его лицу, которое имеет право на получение багажа, а пассажир обязуется уплатить установленную плату за проезд, а в случае сдачи багажа - также за его провоз.

2. Заключение договора перевозки пассажира и багажа подтверждается выдачей соответственно билета и багажной квитанции, формы которых устанавливаются соответственно транспортным кодексам (уставов).

Статья 911. Права пассажира
1. Пассажир имеет право:

получить место в транспортном средстве в соответствии с приобретенным билетом;
провозить с собою безвозмездно одного ребенка возрастом до шести лет без права занятия им отдельного места;
покупать для детей возрастом от шести до четырнадцати лет детские билеты по льготной цене;
перевозить с собой безвозмездно ручную кладь в границах норм, установленных транспортными кодексами (уставами);
сделать не более одной остановки в дороге с удлинением срока действия проездных документов (билета) не более чем на десять пор, а в случае болезни - на все время болезни;
отказаться от поездки, возвратить билет и получить назад полную или частичную стоимость билета - в зависимости от срока сдачи билета в соответствии с правилами, установленными транспортными кодексами (уставами);
получать полную и своевременную информацию о времени и месте отправления транспортного средства по указанному в транспортном документе (билете) маршрутом.
2. Пассажир может иметь также другие права, установленные Гражданским кодексом Украины, другими законами, транспортными кодексами (уставами), другими нормативно-правовыми актами и правилами, которые выдаются согласно им.

Статья 912. Договор чартера (фрахтования)
1. По договору чартера (фрахтования) одна сторона (фрахтовщик) обязуется предоставить второй стороне (фрахтовщику) за плату всю или часть объема в одном или нескольких транспортных средствах на одном или нескольких рейсах для перевозки груза, пассажиров, багажа, почты или с другой целью, если это не противоречит закону и другим нормативно-правовым актам.

2. Порядок заключения договора чартера (фрахтования), а также форма настоящего договора устанавливаются транспортными кодексами (уставами).

Статья 913. Перевозка в прямом смешанном сообщении
1. Перевозка груза, пассажиров, багажа, почты может осуществляться несколькими видами транспорта за единым транспортным документом (прямое смешанное сообщение).

2. Отношения организаций, предприятий транспорта, которые осуществляют перевозку в прямом смешанном сообщении, определяются по договоренности между ними.

Статья 914. Долгосрочный договор
1. Перевозчик и собственник (владелец) груза в случае необходимости осуществления систематических перевозок могут заключить долгосрочный договор.

2. По долгосрочному договору перевозчик обязуется в установленные сроки принимать, а собственник (владелец) груза - передавать для перевозки грузы в установленном объеме. В долгосрочном договоре перевозки груза устанавливаются объем, сроки и прочие условия предоставления транспортных средств и передача груза для перевозки, порядок расчетов, а также другие условия перевозки.

Статья 915. Перевозка транспортом общего пользования
1. Перевозка, которая осуществляется юридическим лицом, считается перевозкой транспортом общего пользования, если из закона, других нормативно-правовых актов или лицензии, выданной этой организации, вытекает, что оно может осуществлять перевозку груза, пассажиров, багажа, почты по обращению любого лица.

2. Договор перевозки транспортом общего пользования является публичным договором.

Статья 916. Провозная плата
1. За перевозку груза, пассажиров, багажа, почты взимается провозная плата в размере, который определяется по договоренности сторон, если другое не установлено законом или другими нормативно-правовыми актами. Если размер провозной платы не определен, взимается разумная плата.

2. Плата за перевозку груза, пассажиров, багажа, почты, которая осуществляется транспортом общего пользования, определяется по договоренности сторон, если она не определена тарифами, утвержденными в установленном порядке.

Льготные условия перевозки груза, пассажиров, багажа, почты транспортом общего пользования могут устанавливаться организацией, предприятием транспорта за их счет или за счет соответствующего бюджета в случаях, установленных законом и другими нормативно-правовыми актами.

3. Работа и услуги, которые выполняются по требованию собственника (владельца) груза и не предусмотрены тарифами, оплачиваются дополнительно по договоренности сторон.

4. Перевозчик имеет право придержать переданный ему для перевозки груз для обеспечения внесения провозной платы и других платежей, если другое не установлено законом, другими нормативно-правовыми актами или не вытекает из сути обязательства.

Статья 917. Предоставление транспортных средств и предъявление груза к перевозке
1. Перевозчик обязан предоставить транспортные средства под загрузку в срок, установленный договором.

Отправитель груза имеет право отказаться от предоставленного транспортного средства, если он является непригодным для перевозки этого груза.

2. Отправитель должен предъявить в установленный срок грузы, подлежащие перевозке, в надлежащей таре и (или) упаковке; груз может быть также замаркирован согласно установленным требованиям.

3. Перевозчик имеет право отказаться от принятия груза, представленного в таре и (или) упаковке, которые не отвечают установленным требованиям, а также в случае отсутствия или ненадлежащего маркирования груза.

Статья 918. Загрузка и разгрузка груза
1. Загрузка (разгрузка) груза осуществляется организацией, предприятием транспорта или отправителем (получателем) в порядке, установленном договором, с соблюдением правил, установленных транспортными кодексами (уставами), другими нормативно-правовыми актами и правилами, которые выдаются согласно им.

2. Загрузка (разгрузка) груза, который осуществляется отправителем (получателем) груза, может вестись в сроки, установленные договором, если такие сроки не установлены транспортными кодексами (уставами), другими нормативно-правовыми актами и правилами, которые выдаются соответственно им.

Статья 919. Срок доставки груза, пассажира, багажа, почты
1. Перевозчик обязан доставить груз, пассажира, багаж, почту к пункту назначения в срок, установленный договором, если другой срок не установлен транспортными кодексами (уставами), другими нормативно-правовыми актами и правилами, которые выдаются соответственно им, а в случае отсутствия таких сроков - в разумный срок.

2. Груз, не выданный получателю по его требованию на протяжении тридцати дней после истечения срока его доставки, если более продолжительный срок не установлен договором, транспортными кодексами (уставами), считается утраченным.

Получатель груза должен принять груз, который прибыл после истечения указанных выше сроков, и возвратить сумму, выплаченную ему перевозчиком за потерю груза, если другое не установлено договором, транспортными кодексами (уставами).

Статья 920. Ответственность по обязательствам, вытекающим из договора перевозки
1. В случае нарушения обязательств, которые вытекают из договора перевозки, стороны несут ответственность, установленную по договоренности сторон, если другое не установлено Гражданским кодексом Украины, другими законами, транспортными кодексами (уставами).

Статья 921. Ответственность перевозчика за непредоставление транспортного средства и ответственность отправителя за неиспользование предоставленного транспортного средства
1. Перевозчик за непредоставление транспортного средства для перевозки груза, а отправитель за непредоставление груза или неиспользование предоставленного транспортного средства по другой причине несут ответственность, установленную договором, если другое не установлено транспортными кодексами (уставами).

2. Перевозчик и отправитель груза освобождаются от ответственности, если непредоставление транспортного средства или неиспользование предоставленного транспортного средства произошло не по их вине, в частности в случае прекращения (ограничения) перевозка груза в определенных направлениях, установленного в случаях и порядке, предусмотренных транспортными кодексами (уставами).

Статья 922. Ответственность перевозчика за задержку отправления пассажира и нарушение срока доставки пассажира в пункт назначения
1. За задержку в отправлении транспортного средства, которое перевозит пассажира, или опоздание в прибытии такого транспортного средства в пункт назначения перевозчик платит пассажиру штраф в размере, установленном по договоренности сторон, транспортными кодексами (уставами), если перевозчик не докажет, что эти нарушения произошли вследствие непреодолимой силы, устранения неисправности транспортного средства, которое угрожало жизни или здоровью пассажиров, или других обстоятельств, которые не зависели от перевозчика.

2. В случае отказа пассажира от перевозки по причине задержки отправление транспортного средства перевозчик обязан возвратить пассажиру провозную плату.

3. Если поездка пассажира из пункта пересадки не состоялась вследствие опоздания транспортного средства, которое доставило его в этот пункт, перевозчик обязан возместить пассажиру причиненные убытки.

Статья 923. Ответственность перевозчика за просрочку доставки груза
1. В случае просрочки доставки груза перевозчик обязан возместить второй стороне убытки, причиненные нарушением срока перевозки, если другие формы ответственности не установлены договором, транспортными кодексами (уставами).

Статья 924. Ответственность перевозчика за потерю, недостаток, порча или повреждение груза, багажа, почты
1. Перевозчик отвечает за сохранение груза, багажа, почты c момента принятия их к перевозке и до выдачи получателю, если не докажет, что потеря, недостаток, порча или повреждение груза, багажа, почты произошли вследствие обстоятельств, которые перевозчик не мог предотвратить и устранение которых от него не зависело.

2. Перевозчик отвечает за потерю, недостаток, порчу или повреждение принятых к перевозке груза, багажа, почты в размере фактического вреда, если не докажет, что это произошло не по его вине.

Статья 925. Предъявление претензий и исков, которые вытекают из договора перевозки
1. До предъявления перевозчику иска, вытекающего из договора перевозки груза, почты возможно предъявление ему претензии в порядке, установленном законом, транспортными уставами и кодексами.

2. Иск против перевозчика может быть предъявлен отправителем груза или его получателем в случае полного или частичного отказа перевозчика удовлетворить претензию или неполучения от перевозчика ответа в месячный срок.

3. К требованиям, которые вытекают из договора перевозки груза, почты, применяется исковая давность в один год из момента, который определяется согласно транспортным кодексам (уставам).

Статья 926. Иски относительно перевозки в заграничном собщении
1. Исковая давность, порядок предъявления исков в спорах, связанных с перевозками в заграничном сообщении, устанавливаются международными договорами Украины, транспортными кодексами (уставами).

Статья 927. Страхование грузов, пассажиров и багажа
1. Страхование грузов, пассажиров и багажа проводится согласно закона.

Статья 928. Ответственность перевозчика за вред, причиненный увечьем, другим повреждением здоровья или смертью пассажира
1. Ответственность перевозчика за вред, причиненный увечьем, другим повреждением здоровья или смертью пассажира, определяется согласно главе 82 Гражданского кодекса Украины, если договором или законом не установлена ответственность перевозчика без вины.
"""
GKU_g_65 = """ 
Глава 65 - Гражданского кодекса
Транспортное экспедирование

Статья 929. Договор транспортного экспедирования
1. По договору транспортного экспедирования одна сторона (экспедитор) обязуется за плату и за счет второй стороны (клиента) выполнить или организовать выполнение определенных договором услуг, связанных с перевозкой груза.

Договором транспортного экспедирования может быть установлена обязанность экспедитора организовать перевозку груза транспортом и по маршруту, выбранному экспедитором или клиентом, обязательство экспедитора заключить от своего имени или от лица клиента договор перевозки груза, обеспечить отправку и получение груза, а также другие обязательства, связанные с перевозкой.

Договором транспортного экспедирования может быть предусмотрено предоставление дополнительных услуг, необходимых для доставки груза (проверка количества и состояния груза, его загрузка и разгрузка, уплата таможенной пошлины, сборов и затрат, возложенных на клиента, сохранение груза до его получения в пункте назначения, получение необходимых для экспорта и импорта документов, выполнение таможенных формальностей и т.п.).

2. Положения этой главы распространяются также на случаи, когда обязанности экспедитора выполняются перевозчиком.

3. Условия договора транспортного экспедирования определяются по договоренности сторон, если другое на установлено законом, другими нормативно-правовыми актами.

Статья 930. Форма договора транспортного экспедирования
1. Договор транспортного экспедирования составляется в письменной форме.

2. Клиент должен выдать экспедитору доверенность, если она необходима для выполнения его обязанностей.

Статья 931. Плата по договору транспортного экспедирования
1. Размер платы экспедитору устанавливается договором транспортного экспедирования, если другое не установлено законом. Если размер платы не установлен, клиент должен выплатить экспедитору разумную плату.

Статья 932. Выполнение договора транспортного экспедирования
1. Экспедитор имеет право привлечь к выполнению своих обязанностей других лиц.

2. В случае привлечения экспедитором к выполнению своих обязанностей по договору транспортного экспедирования других лиц экспедитор отвечает перед клиентом за нарушение договора.

Статья 933. Документы и другая информация, которая предоставляется экспедитору
1. Клиент обязан предоставить экспедитору документы и другую информацию о свойствах груза, условиях его перевозки, а также информацию, необходимую для выполнения экспедитором обязанностей, установленных договором.

2. Экспедитор должен сообщить клиенту о выявленных недостатках полученной информации, а в случае ее неполноты - требовать у клиента необходимую дополнительную информацию.

3. В случае непредоставления клиентом документов и необходимой информации экспедитор имеет право отложить выполнение своих обязанностей по договору транспортного экспедирования до предоставления документов и информации в полном объеме.

4. Клиент отвечает за убытки, причиненные экспедитору в связи с нарушением обязанности относительно предоставления документов и информации, определенных частью первой этой статьи.

Статья 934. Ответственность экспедитора по договору транспортного экспедирования
1. За нарушение обязанностей по договору транспортного экспедирования экспедитор отвечает перед клиентом согласно главе 51 Гражданского кодекса Украины.

Статья 935. Отказ от договора транспортного экспедирования
1. Клиент или экспедитор имеет право отказаться от договора транспортного экспедирования, предупредив об этом другую сторону в разумный срок. Сторона, которая заявила о таком отказе, обязана возместить второй стороне убытки, причиненные ей в связи с разрывом договора.
"""
GKU_g_66 = """ 
Глава 66 - Гражданского кодекса
Хранение

Параграф 1. Общие положения о хранении

Статья 936. Договор хранения
1. По договору хранения одна сторона (хранитель) обязуется сохранять вещь, переданную ей второй стороной (поклажедателем), и возвратить ее поклажедателю в сохранности.

2. Договором хранения, в котором хранителем является лицо, которое осуществляет сохранение на складах предпринимательской деятельности (профессиональный хранитель), может быть установлена обязанность хранителя сохранять вещь, которая будет передана хранителю в будущем.

3. Договор хранения является публичным, если сохранение вещей осуществляется субъектом предпринимательской деятельности на складах (в камерах, помещениях) общего пользования.

Статья 937. Форма договора хранения
1. Договор хранения составляется в письменной форме в случаях, установленных статьей 208 Гражданского кодекса Украины.

Договор хранения, по которому хранитель обязуется принять вещь на сохранение в будущем, может быть заключен в письменной форме, независимо от стоимости вещи, которая будет передана на сохранение.

Письменная форма договора считается соблюденной, если принятие вещи на сохранение удостоверено распиской, квитанцией или другим документом, подписанным хранителем.

2. Принятие вещи на сохранение при пожаре, наводнении, внезапном заболевании или при других чрезвычайных обстоятельствах может подтверждаться показанием свидетелей.

3. Принятие вещи на сохранение может подтверждаться выдачей поклажедателю номерного жетона, другого знака, который заверяет принятие вещи на хранение, если это установлено законом, другими актами гражданского законодательства или является обычным для этого вида хранения.

Статья 938. Срок хранения
1. Хранитель обязан сохранять вещь на протяжении срока, установленного в договоре хранения.

2. Если срок хранения в договоре хранения не установлен и не может быть определен исходя из его условий, хранитель обязан сохранять вещь до предъявления поклажедателем требования о его возвращении.

3. Если срок хранения вещи определен моментом предъявления поклажедателем требования о его возвращении, хранитель имеет право по истечении обычного при этих обстоятельствах срока хранения требовать от поклажедателя забрать эту вещь в разумный срок.

Статья 939. Правовые последствия отказа поклажедателя от передачи вещи на сохранение
1. Хранитель, который обязался принять в будущем вещь на сохранение, не имеет права требовать ее передачи на хранение.

2. Поклажедатель, который не передал вещь на сохранение, обязан возместить хранителю убытки, причиненные ему в связи с тем, что сохранение не состоялось, если он в разумный срок не предупредил хранителя об отказе от договора хранения.

Статья 940. Обязанность принять вещь на сохранение
1. Профессиональный хранитель, который сохраняет вещи на складах (в камерах, помещениях) общего пользования, не имеет права отказаться от заключения договора хранения при наличии у него такой возможности.

2. Хранитель освобождается от обязанности принять вещь на сохранение, если в связи с обстоятельствами, которые имеют важное значение, он не может обеспечить ее сохранности.

Если вещь должна была быть передана на сохранение в будущем, хранитель освобождается от обязанности принять вещь на сохранение, если в связи с обстоятельствами, которые имеют важное значение, он не может обеспечить ее сохранности.

Статья 941. Сохранение вещей, определенных родительными признаками
1. По согласию поклажедателя хранитель имеет право смешать вещи одного рода и одного качества, переданные на сохранение.

Статья 942. Обязанность хранителя относительно обеспечения сохранности вещи
1. Хранитель обязан принимать все меры, установленные договором, законом, другими актами гражданского законодательства, для обеспечения сохранности вещи.

2. Если сохранение осуществляется безвозмездно, хранитель обязан проявлять заботу о вещи, как о своей собственной.

Статья 943. Выполнение договора хранения
1. Хранитель обязан исполнять свои обязанности по договору хранения лично.

2. Хранитель имеет право передать вещь на сохранение другому лицу в случае, если он вынужден это сделать в интересах поклажедателя и не имеет возможности получить его согласия.

О передаче вещи на сохранение другому лицу хранитель обязан своевременно сообщить поклажедателю.

3. В случае передачи хранителем вещи на сохранение другому лицу условия договора хранения являются действующими и первоначальный хранитель отвечает за действия лица, которому он передал вещь на сохранение.

Статья 944. Пользование вещью, переданной на сохранение
1. Хранитель не имеет права без согласия поклажедателя пользоваться вещью, переданной ему на сохранение, а также передавать ее в пользование другому лицу.

Статья 945. Изменение условий хранения
1. Хранитель обязан немедленно сообщить поклажедателя о необходимости изменения условий сохранение вещи и получить его ответ.

В случае опасности потери, недостатка или повреждения вещи хранитель обязан изменить способ, место и прочие условия его хранения, не ожидая ответа поклажедателя.

2. Если вещь повреждена или возникли реальная угроза ее повреждения или другие обстоятельства, которые не дают возможности обеспечить ее сохранность, а употребление мероприятий со стороны поклажедателя ожидать невозможно, хранитель имеет право продать вещь или ее часть.

Если указанные обстоятельства возникли по причине, за которые хранитель не отвечает, он имеет право возместить свои затраты из суммы выручки, полученной от продажи вещи. Наличие указанных обстоятельств определяется хранителем.

Статья 946. Плата за сохранение
1. Плата за сохранение и сроки ее внесения устанавливаются договором хранения.

2. Если сохранение прекратилось досрочно из-за обстоятельств, за которые хранитель не отвечает, он имеет право на пропорциональную часть оплаты.

3. Если Поклажедатель после окончания срока договора хранения не забрал вещь, он обязан внести плату за все фактическое время его хранения.

4. Учредительным документом юридического лица или договором может быть предусмотрено безвозмездное сохранение вещи.

Статья 947. Возмещение затрат на сохранение
1. Затраты хранителя на сохранение вещи могут быть включены в оплату за хранение.

2. Затраты, которые стороны не могли предусмотреть при заключении договора хранения (чрезвычайные затраты), возмещаются сверх оплаты, которая полагается хранителю.

3. При безвозмездном сохранении Поклажедатель обязан возместить хранителю осуществленные им затраты на сохранение вещи, если другое не установлено договором или законом.

Статья 948. Обязанность поклажедателя забрать вещь после окончания срока хранения
1. Поклажедатель обязан забрать вещь от хранителя после окончания срока сохранения.

Статья 949. Обязанность хранителя возвратить вещь
1. Хранитель обязан возвратить поклажедателю вещь, которая была передана на сохранение, или соответствующее количество вещей такого жа рода и такого же качества.

2. Вещь может быть возвращена поклажедателю в таком состоянии, в котором она была принята на хранение, с учетом изменения его естественных свойств.
Хранитель обязан передать плоды и доходы, которые были им получены от вещи.

3. Тождественность вещи, которая была принята на сохранение, и вещи, которая была возвращена поклажедателю, может подтверждаться показанием свидетелей.

Статья 950. Ответственность хранителя за потерю (недостаток) или повреждение вещи
1. За потерю (недостаток) или повреждение вещи, принятой на сохранение, хранитель отвечает на общих основаниях.

2. Профессиональный хранитель отвечает за потерю (недостаток) или повреждение вещи, если не докажет, что это произошло вследствие непреодолимой силы, или из-за таких свойств вещи, о которых хранитель, принимая ее на сохранение, не знал и не мог знать, или вследствие умысла или грубой неосторожности поклажедателя.

3. Хранитель отвечает за потерю (недостаток) или повреждение вещи после окончания срока хранения лишь при наличии его умысла или грубой неосторожности.

Статья 951. Возмещение убытков, причиненных поклажедателю
1. Убытки, причиненные поклажедателю потерей (недостатком) или повреждением вещи, возмещаются хранителем:

в случае потери (недостатка) вещи - в размере ее стоимости;
в случае повреждения вещи - в размере суммы, на которую снизилась ее стоимость.
2. Если вследствие повреждения вещи ее качество изменилось настолько, что она не может быть использована по первоначальному назначению, Поклажедатель имеет право отказаться от этой вещи и требовать от хранителя возмещения ее стоимости.

Статья 952. Возмещение убытков, причиненных хранителю
1. Поклажедатель обязан возместить хранителю убытки, причиненные свойствами вещи, переданной на сохранение, если хранитель, принимая ее на сохранение, не знал и не мог знать об этих свойствах.

Статья 953. Возвращение вещи по требованию поклажедателя
1. Хранитель обязан по первому требованию поклажедателя возвратить вещь, даже если срок ее хранения не закончился.

Статья 954. Сохранение по закону
1. Положение этой главы применяется к сохранению, которое осуществляется на основании закона, если другое не установлено законом.

Статья 955. Применение общих положений о хранении к отдельных его видам
1. Положение параграфа 1 этой главы применяются к отдельным видам хранения, если другое не установлено положениями этого Кодекса об отдельных видах хранения или законом.

Параграф 2. Сохранение на товарном складе

Статья 956. Понятие товарного склада
1. Товарным складом является организация, которая сохраняет товар и предоставляет услуги, связанные с сохранением, на основах предпринимательской деятельности.

2. Товарный склад является складом общего пользования, если согласно закона, других нормативно-правовых актов или разрешения (лицензии) он обязан принимать на сохранение товары от любого лица.

Статья 957. Договор складского хранения
1. По договору складского хранения Товарный склад обязуется за плату сохранять товар, переданный ему поклажедателем, и возвратить этот товар в сохранности.

2. Договор складского хранения, заключенный складом общего пользования, является публичным договором.

3. Договор складского хранения составляется в письменной форме. Письменная форма договора складского хранения считается соблюденной, если принятие товара на Товарный склад удостоверено складским документом.

Статья 958. Сохранение вещей, определенных родительными признаками, с правом распоряжения ими
1. Если Товарный склад имеет право распоряжаться вещами, определенными родительными признаками, к отношениям сторон применяются положения о договоре займа, а время и место возвращения товаров определяются общими положениями о сохранении.

Статья 959. Осмотр товара
1. Товарный склад обязан за свой счет осмотреть товар при принятии его на сохранение для определения его количества и внешнего состояния.

2. Товарный склад обязан предоставлять поклажедателю возможность осмотреть товар или его образцы на протяжении всего времени хранения, а если предметом хранения являются вещи, определенные родительными признаками, - взять пробы и принять меры, необходимые для обеспечения его сохранности.

3. Товарный склад или Поклажедатель при возвращении товара имеет право требовать его осмотра и проверки качества. Затраты, связанные с осмотром вещей, несет сторона, которая требовала осмотра и проверки. Если при возвращении товара он не был совместно осмотрен или проверен Товарным складом и поклажедателем, Поклажедатель может заявить о недостатке или повреждении товара в письменной форме одновременно с его получением, а относительно недостатка и повреждения, которые не могли быть выявлены при обычном способе принятия товара, - на протяжении трех дней после его получения. В случае отсутствия заявления поклажедателя считается, что Товарный склад возвратил товар согласно условиям договора.

Статья 960. Изменение условий хранения и состояния товара
1. Если для обеспечения сохранности товара нужно немедленное изменение условий его хранения, Товарный склад обязан самостоятельно употребить соответствующих неотложных мероприятий и сообщить о них поклажедателю.

2. В случае выявления повреждений товара склад обязан немедленно составить акт и в тот же день сообщить об этом поклажедателю.

Статья 961. Складские документы
1. Товарный склад на подтверждение принятия товара выдает один из таких складских документов:

складскую квитанцию;
простое складское свидетельство;
двойное складское свидетельство.
2. Товар, принятый на сохранение за простым или двойным складским свидетельством, может быть предметом залога на протяжении срока сохранениz товара на основании залога этого свидетельства.

Статья 962. Двойное складское свидетельство
1. Двойное складское свидетельство состоит из двух частей - складского свидетельства и заставного свидетельства (варанта), которые могут быть отделены один от одного.

2. В любой с двух частей двойного складского свидетельства должны быть одинаково указаны:

наименование и местонахождение товарного склада, который принял товар на сохранение;
номер свидетельства за реестром товарного склада;
наименование юридического лица или имени физического лица, от которго принят товар на сохранение, его местонахождение или местожительство;
наименование и количество принятого на сохранение товара - число единиц и (или) товарных мест и (или) мера (вес, объем) товара;
срок, на который принят товар на сохранение, или указание на то, что товар принят на сохранение до востребования;
размер платы за сохранение или тарифы, на основании которых она вычисляется, и порядок ее уплаты;
дата выдачи свидетельства.
Любая с двух частей двойного складского свидетельства должна также содержать идентичные подписи уполномоченного лица и печати товарного склада.

3. Документ, который не отвечает требованиям этой статьи, не является двойным складским свидетельством.

Статья 963. Права владельца складского и заставного свидетельства
1. Владелец складского и заставного свидетельства имеет право распоряжаться товаром, который сохраняется на товарном складе.

2. Только владелец складского свидетельства имеет право распоряжаться товаром, но этот товар не может быть взят со склада до погашения кредита, выданного по заставному свидетельству.

3. Только владелец заставного свидетельства имеет право залога на товар на сумму согласно суммы кредита и процентов за пользование им. В случае залога товара отметка об этом делается на складском свидетельстве.

Статья 964. Передача складского и заставного свидетельства
1. Складское и заставное свидетельства могут передаваться вместе или в отдельности за передающими записями.

Статья 965. Простое складское свидетельство
1. Простое складское свидетельство выдается на предъявителя.

2. Простое складское свидетельство может содержать сведения, установленные пунктами 1, 2, 4, 7 и абзацем девятым части второй статьи 962 Гражданского кодекса Украины, а также указание на то, что оно выдано на предъявителя.

3. Документ, который не отвечает требованиям этой статьи, не является простым складским свидетельством.

Статья 966. Выдача товара по двойному складскому свидетельству
1. Товарный склад выдает товары владельцу складского и заставного свидетельства (двойного складского свидетельства) лишь в обмен на оба свидетельства вместе.

2. Владельцу складского свидетельства, которое не имеет заставного свидетельства, но уплатил сумму долга по нему, склад выдает товар лишь в обмен на складское свидетельство и при условии предоставления вместе с ним квитанции об уплате всей суммы долга по заставному свидетельству.

Товарный склад, который выдал товар владельцу складского свидетельства, которое не имеет заставного свидетельства и не уплатил сумму долга по нему, отвечает перед владельцем заставного свидетельства за платеж всей суммы, обеспеченной по нему.

3. Владелец складского и заставного свидетельства имеет право требовать выдачи товара частями. При этом в обмен на первоначальные свидетельства ему выдаются новые свидетельства на товар, который остался на складе.

Параграф 3. Специальные виды хранения

Статья 967. Сохранение вещи в ломбарде
1. Договор хранения вещи, принятой ломбардом от физического лица, оформляется выдачей именной квитанции.

2. Цена вещи определяется по договоренности сторон.

3. Ломбард обязан страховать в пользу поклажедателя за свой счет вещи, принятые на сохранение, исходя из полной суммы их оценки.

Статья 968. Продажа вещи, которую Поклажедатель не забрал из ломбарда
1. Вещь, которую Поклажедатель не забрал из ломбарда после истечения трех месяцев со дня окончания срока договора хранения, может быть продана ломбардом в порядке, установленном законом.

2. Из суммы выручки, полученной от продажи вещи, высчитываются плата за сохранение и прочие платежи, которые надлежит сделать ломбарду. Остаток суммы выручки возвращается поклажедателю.

Статья 969. Сохранение ценностей в банке
1. Банк может принять на сохранение документы, ценные бумаги, драгоценные металлы, камни, другие драгоценности и ценности.

2. Банк может быть уполномочен поклажедателем на совершение сделок с ценными бумагами, принятыми на сохранение.

3. Заключение договора хранения ценностей в банке удостоверяется выдачей банком поклажедателю именного документа, предъявление которого является основанием для возвращения ценностей поклажедателю.

Статья 970. Договор о предоставлении индивидуального банковского сейфа, который охраняется банком
1. Банк может передать поклажедателю индивидуальный банковский сейф (его часть или специальное помещение) для хранения в нем ценностей и работы с ними.

2. Банк выдает поклажедателю ключ от сейфа, карточку, которая идентифицирует поклажедателя, другой знак или документ, который заверяет право его предъявителя на доступ к сейфу и получения из него ценностей.

3. Банк принимает от поклажедателя ценности, контролирует их помещение в сейф и получение их из сейфа.

Статья 971. Договор о предоставлении индивидуального банковского сейфа, который не охраняется банком
1. К договору о предоставлении лицу банковского сейфа без ответственности банка за содержимое сейфа применяются положения этого Кодекса про имущественный найм (аренду).

Статья 972. Сохранение вещей в камерах хранения организаций, предприятий транспорта
1. Камеры хранения общего пользования, которые находятся в ведении организаций, предприятий транспорта, обязаны принимать на сохранение вещи пассажиров и других лиц независимо от наличия у них проездных документов.

2. На подтверждение принятия вещи на сохранение в камере хранения (кроме автоматических камер) поклажедателю выдается квитанция или номерной жетон.

3. Убытки, причиненные поклажедателю вследствие потери, недостатка или повреждения вещи, сданной в камеру хранения, возмещаются на протяжении срока с момента предъявления требования про их возмещение в размере суммы оценки вещи, осуществленной при передаче ее на хранение.

4. Срок, на протяжении которого камера хранения обязана сохранять вещь, устанавливается правилами, которые выдаются согласно транспортным кодексам (уставам), или по договоренности сторон. Если сторона не забрала вещь в установленные сроки, камера хранения обязана сохранять ее на протяжении трех месяцев. По истечении этого срока вещь может быть продана в порядке, установленном законом.

5. В случае потери квитанции или номерного жетона вещь, сданная в камеру хранения, выдается поклажедателю после предоставления доказательств принадлежности ему этой вещи.

6. К договору о хранении вещи в автоматических камерах хранения применяются положения Гражданского кодекса Украины про имущественный найм (аренду).

Статья 973. Сохранение вещей в гардеробе организации
1. Если вещь сдана в гардероб организации, хранителем является эта организация.
Хранитель вещи, сданной в гардероб, независимо от того, осуществляется ли хранение за плату или безвозмездно, обязан принять все необходимые меры относительно обеспечения сохранности вещи.

2. Положения этой статьи применяются в случае хранения верхней одежды, головных уборов в местах, специально отведенных для этого, в учреждениях здравоохранения и других учреждениях.

Статья 974. Сохранение вещей пассажира при его перевозке
1. Перевозчик обязан обеспечить сохранность чемодана (сумки), личных вещей пассажира (кроме драгоценностей и денег), которые пассажир перевозит в отведенном месте.

Статья 975. Сохранение вещей в гостинице
1. Гостиница отвечает за сохранность вещей, внесенных в Гостиницу лицом, которое проживает в нем. Вещь считается внесенной в Гостиницу, если она переданаработникам гостиницы или находится в отведенном для лица помещении.

2. Гостиница отвечает за потерю денег, других ценностей (ценных бумаг, ценностей) лишь при условии, что они были отдельно переданы гостинице на хранение.

3. В случае потери или повреждения вещи лицо обязано немедленно сообщить об этом гостинице.
Если до окончания срока проживания лицо не предъявило свои требования к отелю, считается, что его вещи не были утрачены или повреждены.

4. Положения этой статьи применяются к сохранению вещей физических лиц в общежитиях, мотелях, домах отдыха, пансионатах, санаториях и других организациях, в помещениях которых лицо временно проживает.

Статья 976. Сохранение вещей, являющихся предметом спора
1. Два или болье лиц, между которыми возник спор о праве на вещь, могут передать эту вещь третьему лицу, которое берет на себя обязанность после решения спора возвратить вещь лицу, определенному по решению суда или по согласованию всех лиц, между которыми имеется спор.

2. Вещь, которая является предметом спора, может быть передана на хранение по решению суда.

Хранителем в этом случае может быть лицо, определенное судом, или лицо, определенное по договоренности сторон, между которыми имеется спор. Вещь передается на сохранение другому лицу по его согласию, если другое не установлено законом. Хранитель имеет право на плату за счет сторон, между которыми ведется спор.

Статья 977. Сохранение автотранспортных средств
1. Если сохранение автотранспортных средств осуществляется субъектом предпринимательской деятельности, такой договор является публичным.

2. По договору хранения транспортного средства в боксах и гаражах, на специальных стоянках хранитель обязуется не допускать проникновения в них посторонних лиц и выдать транспортное средство по первому требованию поклажедателя.

Договор хранения транспортного средства распространяется также на отношения между гаражно-строительным или гаражным кооперативом и их членами, если другое не установлено законом или уставом кооператива.

Принятие автотранспортного средства на сохранение заверяется квитанцией (номером, жетоном).

Статья 978. Договор охраны
1. По договору охраны охранник, который является субъектом предпринимательской деятельности, обязуется обеспечить неприкосновенность лица или имущества, которые охраняются. Владелец такого имущества или лицо, которое охраняют, обязаны выполнять предусмотренные договором правила личной и имущественной безопасности и ежемесячно платить охраннику установленную плату.
"""
GKU_g_67 = """ 
Глава 67 - Гражданского кодекса
Страхование

Статья 979. Договор страхования
1. По договору страхования одна сторона (страховщик) обязуется в случае наступления определенного события (страхового случая) выплатить второй стороне (страхователю) или иному лицу определенному в договоре, денежную сумму (страховую выплату), а страхователь обязуется платить страховые платежи и выполнять другие условия договора.

Статья 980. Предмет договора страхования
1. Предметом договора страхования могут быть имущественные интересы, не противоречащие закону и связанные с:

жизнью, здоровьем, трудоспособностью и пенсионным обеспечением (личное страхование);
владением, пользованием и распоряжением имуществом (имущественное страхование);
возмещением вреда, причиненного страхователем (страхование ответственности).
Статья 981. Форма договора страхования
1. Договор страхования заключается в письменной форме. Договор страхования может заключаться путем выдачи страховщиком страхователю страхового свидетельства (полиса, сертификата).

2. В случае несоблюдения письменной формы договора страхования такой договор является ничтожным.

Статья 982. Существенные условия договора страхования
1. Существенными условиями договора страхования являются предмет договора страхования, страховой случай, размер денежной суммы, в пределах которой страховщик обязан произвести выплату в случае наступления страхового случая (страховая сумма), размер страхового платежа и сроки его уплаты, срок договора и другие условия, определенные актами гражданского законодательства.

Статья 983. Момент вступления в силу договора страхования
1. Договор страхования вступает в силу с момента внесения страхователем первого страхового платежа, если иное не установлено договором.

Статья 984. Стороны в договоре страхования
1. Страховщиком является юридическое лицо, специально созданное для осуществления страховой деятельности и получившее в установленном порядке лицензию на осуществление страховой деятельности.

Требования, которым должны отвечать страховщики, порядок лицензирования их деятельности и осуществления государственного надзора за страховой деятельностью устанавливаются законом.

2. Страхователем может быть физическое или юридическое лицо.

Статья 985. Заключение договора страхования в пользу третьего лица
1. Страхователь имеет право заключить со страховщиком договор в пользу третьего лица, которому страховщик обязан осуществить страховую выплату в случае достижения им определенного возраста или наступления другого страхового случая.

2. Страхователь имеет право при заключении договора страхования назначить физическое или юридическое лицо для получения страховой выплаты (выгодоприобретателя), а также заменять его до наступления страхового случая, если иное не установлено договором страхования.

3. Особенности заключения договора страхования в пользу третьего лица устанавливаются законом.

Статья 986. Сострахование
1. С согласия страхователя предмет договора страхования может быть застрахован по одному договору страхования несколькими страховщиками (сострахование) с определением прав и обязанностей каждого из страховщиков.

2. По согласованию между состраховиками и страхователем один из состраховиков может представлять всех других состраховиков в отношениях со страхователем, оставаясь ответственным перед ним в размерах своей доли.

Статья 987. Договор перестрахования
1. По договору перестрахования страховщик, заключивший договор страхования, страхует у другого страховщика (перестраховщика) риск выполнения части своих обязательств перед страхователем.

2. Страховщик, заключивший договор перестрахования, остается ответственным перед страхователем в полном объеме в соответствии с договором страхования.

Статья 988. Обязанности страховщика
1. Страховщик обязан:

1) ознакомить страхователя с условиями и правилами страхования;

2) в течение двух рабочих дней, как только станет известно о наступления страхового случая, принять меры относительно оформления всех необходимых документов для своевременного осуществления страховой выплаты страхователю;

3) в случае наступления страхового случая осуществить страховую выплату в срок, установленный договором.

Страховая выплата по договору личного страхования осуществляется независимо от сумм, выплачиваемых по государственным социальным страхованием, социальным обеспечением, а также от возмещения вреда.

Страховая выплата по договору имущественного страхования и страхования ответственности (страховое возмещение) не может превышать размера реальных убытков. Другие убытки считаются застрахованными, если это установлено договором.

Страховая выплата по договору имущественного страхования осуществляется страхователем в пределах страховой суммы, которая устанавливается в пределах стоимости имущества на момент заключения договора;

4) возместить расходы, понесенные страхователем в случае наступления страхового случая с целью предотвращения или уменьшения убытков, если это установлено договором;

5) по заявлению страхователя в случае осуществления им мероприятий, уменьшили страховой риск, или в случае увеличения стоимости имущества внести соответствующие изменения в договор страхования;

6) не разглашать сведения о страхователе и его имущественном положении, кроме случаев, установленных законом.

2. Договором страхования могут быть установлены и другие обязанности страховщика.

Статья 989. Обязанности страхователя
1. Страхователь обязан:

1) своевременно вносить страховые платежи (взносы, премии) в размере, установленном договором;

2) при заключении договора страхования предоставить страховщику информацию обо всех известных ему обстоятельствах, имеющих существенное значение для оценки страхового риска, и в дальнейшем информировать его о любых изменениях страхового риска;

3) при заключении договора страхования сообщить страховщику о других договорах страхования, заключенных относительно объекта страхования.

Если страхователь не уведомил страховщика о том, что объект уже застрахован, новый договор страхования является ничтожным;

4) принимать меры по предотвращению убытков, причиненных наступлением страхового случая, и их уменьшения;

5) сообщить страховщику о наступлении страхового случая в срок, установленный договором.

2. Договором страхования могут быть установлены и другие обязанности страхователя.

Статья 990. Условия и порядок осуществления страховой выплаты
1. Страховщик осуществляет страховую выплату в соответствии с условиями договора на основании заявления страхователя (его правопреемника) или другого лица, определенного договором, и страхового акта (аварийного сертификата).

2. Страховой акт (аварийный сертификат) составляется страховщиком или уполномоченным им лицом в форме, устанавливаемой страховщиком.

Статья 991. Отказ от осуществления страховой выплаты
1. Страховщик имеет право отказаться от осуществления страховой выплаты в случае:

умышленных действий страхователя или лица, в пользу которого заключен договор страхования, если они были направлены на наступление страхового случая, кроме действий, связанных с выполнением ими гражданского или служебного долга, совершенных в состоянии необходимой обороны (без превышения ее пределов), или по защите имущества, жизни, здоровья, чести, достоинства и деловой репутации;
совершение страхователем или лицом, в пользу которого заключен договор страхования, умышленного преступления, приведшего к страховому случаю;
предоставление страхователем заведомо ложных сведений об объекте страхования или о факте наступления страхового случая;
получение страхователем полного возмещения убытков по договору имущественного страхования от лица, которое их нанесло;
несвоевременного сообщения страхователем без уважительных на то причин о наступлении страхового случая или создания страховщику препятствий в определении обстоятельств, характера и размера убытков;
наличия других оснований, установленных законом.
2. Договором страхования могут быть предусмотрены также другие основания для отказа осуществить страховую выплату, если это не противоречит закону.

3. Решение страховщика об отказе осуществить страховую выплату сообщается страхователю в письменной форме с обоснованием причин отказа.

Статья 992. Ответственность страховщика
1. В случае неуплаты страховщиком страхователю или иному лицу страховой выплаты страховщик обязан оплатить неустойку в размере, установленном договором или законом.

Статья 993. Переход к страховщику прав страхователя относительно лица, ответственного за причиненный ущерб
1. К страховщику, который выплатил страховое возмещение по договору имущественного страхования, в пределах фактических расходов переходит право требования, которое страхователь или иное лицо, получившее страховое возмещение, имеет к лицу, ответственному за причиненные убытки.

Статья 994. Изменение страхователя - физического лица в договоре страхования
1. В случае смерти страхователя, который заключил договор имущественного страхования, его права и обязанности переходят к лицам, получившим это имущество по наследству.

В других случаях права и обязанности страхователя могут перейти к третьим лицам только с согласия страховщика, если иное не установлено договором страхования.

2. В случае смерти страхователя, заключившего договор личного страхования в пользу третьего лица, его права и обязанности могут перейти к этому лицу или к лицам, на которых в соответствии с законом возложены обязанности по охране прав и интересов застрахованного лица.

Статья 995. Последствия прекращения юридического лица - страхователя
1. Если юридическое лицо - страхователь прекращается и устанавливаются его правопреемники, права и обязанности страхователя переходят к правопреемникам.

Статья 996. Последствия признания страхователя - физического лица недееспособным или ограничения его гражданской дееспособности
1. Права и обязанности страхователя - физического лица, признанное судом недееспособным, осуществляются его опекуном с момента признании лица недееспособным.

Договор страхования ответственности физического лица, признанное судом недееспособным, прекращается с момента признания лица недееспособной.

2. Страхователь - физическое лицо, гражданская дееспособность которого ограничена судом, осуществляет свои права и обязанности страхователя только с согласия попечителя.

Статья 997. Прекращение договора страхования
1. Договор страхования прекращается в случаях, установленных договором и законом.

2. Если страхователь просрочил внесение страхового платежа и не уплатил его в течение десяти рабочих дней после предъявления страховщиком письменного требования об уплате страхового платежа страховщик может отказаться от договора страхования, если иное не установлено договором.

Страхователь или страховщик может отказаться от договора страхования в других случаях, установленных договором.

3. Страхователь или страховщик обязан уведомить вторую сторону о своем намерении отказаться от договора страхования не позднее чем за тридцать дней до прекращения договора, если иное не установлено договором.

Страховщик не вправе отказаться от договора личного страхования без согласия страхователя, который не допускает нарушение договора, если иное не установлено договором или законом.

4. Если страхователь отказался от договора страхования (кроме договора страхования жизни), страховщик возвращает ему страховые платежи за период, оставшийся до окончания срока договора, за вычетом нормативных затрат на ведение дела, определенных при расчете страхового тарифа, и фактически произведенных страховщиком страховых выплат.

Если отказ страхователя от договора обусловлен нарушением условий договора страховщиком, страховщик возвращает страхователю уплаченные им страховые платежи полностью.

5. Если страховщик отказался от договора страхования (кроме договора страхования жизни), страховщик возвращает страхователю уплаченные им страховые платежи полностью.

Если отказ страховщика от договора обусловлен невыполнением страхователем условий договора страхования, страховщик возвращает страхователю страховые платежи за период, оставшийся до окончания срока договора, за вычетом нормативных затрат на ведение дела, определенных при расчете страхового тарифа, и фактически осуществленных страховых выплат.

Последствия отказа от договора страхования жизни устанавливаются законом.

6. Если страхователь или страховщик отказался от договора страхования, договор прекращается.

Статья 998. Недействительность договора страхования
1. Договор страхования является ничтожным или признается недействительным в случаях, установленных настоящим Кодексом.

Договор страхования также признается судом недействительным, если:

он заключен после наступления страхового случая;
объектом договора страхования является имущество, подлежащее конфискации.
2. Последствия недействительности договора страхования определяются согласно положениям о недействительности сделок, установленных настоящим Кодексом.

Статья 999. Обязательное страхование
1. Законом может быть установлена обязанность физического или юридического лица быть страхователем жизни, здоровья, имущества или ответственности перед другими лицами за свой счет или за счет заинтересованного лица (обязательное страхование).

2. К отношениям, вытекающим из обязательного страхования, применяются положения настоящего Кодекса, если иное не установлено актами гражданского законодательства.
"""
GKU_g_68 = """ 
Глава 68 - Гражданского кодекса
Поручение

Статья 1000. Договор поручения
1. По договору поручения одна сторона (поверенный) обязуется совершить от имени и за счет другой стороны (доверителя) определенные юридические действия. Сделка, совершенная поверенным, создает, изменяет, прекращает гражданские права и обязанности доверителя.

2. Договором поручения может быть установлено исключительное право поверенного на совершение от имени и за счет доверителя всех или части юридических действий, предусмотренных договором. В договоре могут быть установлены срок действия такой доверенности и / или территория, в пределах которой действует исключительное право поверенного.

Статья 1001. Срок договора поручения
1. Договору поручения может быть определен срок, в течение которого поверенный вправе действовать от имени доверителя.

Статья 1002. Право поверенного на плату
1. Поверенный имеет право на плату за выполнение своего долга по договору поручения, если иное не установлено договором или законом.

2. Если в договоре поручения не определен размер платы поверенному или порядок ее выплаты, она выплачивается после выполнения поручения в соответствии с обычными ценами на такие услуги.

Статья 1003. Содержание поручения
1. В договоре поручения или в выданной на основании договора доверенности должны быть четко определены юридические действия, которые предстоит совершить поверенному. Действия, которые предстоит совершить поверенному, должны быть правомерными, конкретными и выполнимыми.

Статья 1004. Исполнение поручения
1. Поверенный обязан совершать действия в соответствии с содержанием данного ему поручения. Поверенный может отступить от содержания доверенности, если этого требуют интересы доверителя и поверенный не мог предварительно cпросить доверителя либо не получил в разумный срок ответа на свой запрос. В этом случае поверенный должен сообщить доверителю о допущенных отступлениях от содержания поручения как только это станет возможным.

2. Поверенному, который действует как коммерческий представитель (статья 243 Гражданского кодекса Украины), доверителем может быть предоставлено право отступать в интересах доверителя от содержания поручения без предварительного запроса об этом. Коммерческий представитель должен в разумный срок уведомить доверителя о допущенных отступлениях от его поручения, если иное не установлено договором.

Статья 1005. Личное выполнение договора поручения
1. Поверенный обязан исполнить данное ему поручение лично. Поверенный вправе передать исполнение поручения другому лицу (заместителю), если это предусмотрено договором или если поверенный был принужден к этому силою обстоятельств, в целях охраны интересов доверителя. Поверенный, передавший исполнение поручения заместителей, должен немедленно сообщить об этом доверителю. В этом случае поверенный отвечает лишь за выбор заместителя.

2. Доверитель имеет право в любое время отклонить заместителя, которого выбрал поверенный.

3. Если заместитель поверенного был указан в договоре поручения, поверенный не отвечает за выбор заместителя и за совершенные им действия.

4. Если договором поручения не предусмотрена возможность совершения действий заместителем поверенного или такая возможность предусмотрена, но заместитель в договоре не указан, поверенный отвечает за выбор заместителя.

Статья 1006. Обязанности поверенного
1. Поверенный обязан:

сообщать доверителю по его требованию все сведения о ходе выполнения его поручения;
после выполнения поручения или в случае прекращения договора поручения до его выполнения немедленно возвратить доверителю доверенность, срок которой не истек, и предоставить отчет о выполнении поручения и оправдательные документы, если это требуется по условиям договора и по характеру поручения;
немедленно передать доверителю все полученное в связи с выполнением поручения.
Статья 1007. Обязанности доверителя
1. Доверитель обязан выдать поверенному доверенность на совершение юридических действий, предусмотренных договором поручения.

2. Доверитель обязан, если иное не установлено договором:

обеспечить поверенного средствами, необходимыми для выполнения поручения;
возместить поверенному расходы, связанные с выполнением поручения.
3. Доверитель обязан немедленно принять от поверенного все полученное им в связи с исполнением поручения.

4. Доверитель обязан выплатить поверенному плату, если она ему принадлежит.

Статья 1008. Прекращение договора поручения
1. Договор поручения прекращается на общих основаниях прекращения договора, а также в случае:

отказа доверителя или поверенного от договора;
признания доверителя или поверенного недееспособным, ограничения дееспособности или признания безвестно отсутствующим;
смерти доверителя или поверенного.
2. Доверитель или поверенный имеют право отказаться от договора поручения в любое время. Отказ от права на отказ от договора поручения ничтожен.

3. Если поверенный действует как предприниматель, сторона, отказывающаяся от договора, должна уведомить другую сторону об отказе от договора не позднее чем за один месяц до его прекращения, если более длительный срок не установлен договором.

В случае прекращения юридического лица, являющегося коммерческим представителем, доверитель вправе отказаться от договора поручения без предварительного уведомления об этом поверенного.

Статья 1009. Последствия прекращения договора поручения
1. Если договор поручения прекращен до того, как поручение было полностью выполнено поверенным, доверитель должен возместить поверенному расходы, связанные с выполнением поручения, а если поверенному подлежит плата - также выплатить ему плату пропорционально выполненной им работе. Это положение не применяется к исполнению поверенным поручения после того, как он узнал или должен был узнать о прекращении договора поручения.

2. Отказ доверителя от договора поручения не является основанием для возмещения убытков, причиненных поверенному прекращением договора, кроме случая прекращения договора, по которому поверенный действовал как коммерческий представитель.

3. Отказ поверенного от договора поручения не является основанием для возмещения убытков, причиненных доверителю прекращением договора, кроме случая отказа поверенного от договора при таких условиях, когда доверитель лишен возможности иначе обеспечить свои интересы, а также отказа от договора, по которому поверенный действовал как коммерческий представитель.

Статья 1010. Обязанности наследника поверенного и ликвидатора юридического лица - поверенного
1. В случае смерти поверенного его наследники должны уведомить доверителя о прекращении договора поручения и принять меры, необходимые для охраны имущества доверителя, в частности сохранить его вещи, документы и передать их доверителю.

2. В случае ликвидации юридического лица - поверенного ликвидатор должен уведомить доверителя о прекращении договора поручения и принять меры, необходимые для охраны имущества доверителя, сохранить его вещи, документы и передать доверителю.
"""
GKU_g_69 = """ 
Глава 69 - Гражданского кодекса
Комиссия

Статья 1011. Договор комиссии
1. По договору комиссии одна сторона (комиссионер) обязуется по доверенности второй стороны (комитента) за плату совершить одну или несколько сделок от своего имени, но за счет комитента.

Статья 1012. Условия договора комиссии
1. Договор комиссии может быть заключен на определенный срок или без определения срока, с определением или без определения территории его выполнения, с условием или без условия относительно ассортимента товаров, которые являются предметом комиссии.

2. Комитент может быть обязан воздержаться от заключения договора комиссии с другими лицами.

3. Существенными условиями договора комиссии, по которым комиссионер обязуется продать или купить имущество, являются условия об этом имуществе и его цене.

Статья 1013. Комиссионная плата
1. Комитент должен выплатить комиссионеру плату в размере и порядке, установленными в договоре комиссии.

2. Если комиссионер поручился за выполнение сделки третьим лицом, он имеет право на дополнительную плату.

3. Если договором комиссии размер платы не определен, она выплачивается после выполнения договора комиссии исходя из обычных цен за такие услуги.

4. Если договор комиссии не был выполнен по причине, которые зависели от комитента, комиссионер имеет право на комиссионную плату на общих основаниях.

5. В случае разрыва или одностороннего отказа от договора комиссии комиссионер имеет право на плату за фактически совершенные действия.

Статья 1014. Выполнение договора комиссии
1. Комиссионер обязан совершать сделки на условиях, наиболее выгодных для комитента, и согласно его указаниям. Если в договоре комиссии таких указаний нет, комиссионер обязан совершать сделки согласно обычаям делового оборота или требований, которые обычно применяются.

2. Если комиссионер совершил сделку на условиях более выгодных, чем те, что были определены комитентом, дополнительно полученная выгода принадлежит комитенту.

Статья 1015. Субкомиссия
1. По согласию комитента комиссионер имеет право заключить договор субкомиссии с третьим лицом (субкомиссионером), оставаясь ответственным за действия субкомиссионера перед комитентом.

По договору субкомиссии комиссионер приобретает относительно субкомиссионера права и обязанности комитента.

2. В исключительных случаях, если этого требуют интересы комитента, комиссионер имеет право заключить договор субкомиссии без согласия комитента.

3. Комитент не имеет права без согласия комиссионера вступать в отношения с субкомиссионером.

Статья 1016. Выполнение договора, заключенного комиссионером с третьим лицом
1. Комитент обязан обеспечить комиссионера всем необходимым для выполнения обязанности перед третьим лицом.

2. По договору, заключенному с третьим лицом, комиссионер приобретает права даже тогда, когда комитент был назван в договоре или принял от третьего лица выполнение договора.

3. Комиссионер не отвечает перед комитентом за невыполнение третьим лицом договора, заключенного с ним за счет комитента, кроме случаев, когда комиссионер был неосмотрительным при выборе этого лица или поручился за выполнение договора (делькредере).

4. В случае нарушения третьим лицом договора, заключенного с ею комиссионером, комиссионер обязан немедленно сообщить об этом комитента, собрать и обеспечить необходимые доказательства. Комитент имеет право требовать от комиссионера уступки права требования к этому лицу.

Статья 1017. Отступление от указаний комитента
1. Комиссионер имеет право отступить от указаний комитента, если этого требуют интересы комитента и комиссионер не мог предварительно спросить комитента или не получил в разумный срок ответа на свой запрос. В этом случае комиссионер должен сообщить комитенту о допущенных отступлениях от его указаний как только это станет возможным.

2. Комиссионеру, который является предпринимателем, может быть предоставлено право отступать от указаний комитента без предварительного запроса об этом, но с обязательным сообщением комитенту о допущенных отступлениях.

3. Комиссионер, который продал имущество по низшей цене, должен заплатить разницу комитенту, если комиссионер не докажет, что он не имел возможности продать имущество по согласованной цене, а его продажа по низшей цене предупредила большие убытки.

Если для отступления от указаний комитента нужен был предшествующий запрос, комиссионер может также доказать, что он не мог предварительно спросить комитента или получить в разумный срок ответа на свой запрос.

4. Если комиссионер купил имущество по высшей цене, чем была согласована, комитент имеет право не принять его, заявив об этом комиссионеру в разумный срок после получения от него сообщение об этой покупке.

Если комитент не пришлет комиссионеру сообщения об отказе от покупкенного для него имущества, оно считается принятым комитентом.

5. Если комиссионер при покупке имущества заплатил разницу в цене, комитент не имеет права отказаться от принятия выполнения договора.

Статья 1018. Право собственности комитента
1. Имущество, приобретенное комиссионером за счет комитента, является собственностью комитента.

Статья 1019. Право комиссионера на удержание вещи
1. Комиссионер имеет право для обеспечения своих требований по договору комиссии придержать вещь, которая должна быть передана комитенту.

2. В случае объявления комитента банкротом комиссионер считается заставодержателем удержанной им вещи.

Статья 1020. Право комиссионера на отчисление из денежных средств, которые принадлежат комитенту
1. Комиссионер имеет право отсчитывать принадлежащие ему по договору суммы из всех денежных средств, которые поступили к нему для комитента, если другие кредиторы комитента не имеют преобладающего перед ним права на удовлетворение своих требований из денежного средства, которые принадлежат комитенту.

Статья 1021. Обязанность комиссионера сохранять имущество комитента
1. Комиссионер отвечает перед комитентом за потерю, нехватку или повреждение имущества комитента.

2. Если при принятии комиссионером имущества, которое поступило от комитента, или имущества, которое поступило для комитента, будут выявлены нехватка или повреждение, а также в случае причинения вреда имуществу комитента комиссионер должен немедленно сообщить об этом комитенту и принять меры относительно охраны его прав и интересов.

3. Комиссионер, который не застраховал имущество комитента, отвечает за потерю, нехватку, повреждение имущества комитента, если он был обязан застраховать имущество за счет комитента согласно договору или обычаев делового оборота.

Статья 1022. Отчет комиссионера
1. После совершения сделки по доверенности комитента комиссионер должен предоставить комитенту отчет и передать ему все полученное по договору комиссии.

2. Комитент, который имеет возражение относительно отчета комиссионера, должен сообщить ему об этом на протяжении тридцати дней от дня получения отчета. Если такие возражения не поступят, отчет считается принятым

Статья 1023. Принятие комитентом выполнения по договору комиссии
1. Комитент обязан:

принять от комиссионера все надлежаще выполненное по договору комиссии;
осмотреть имущество, приобретенное для него комиссионером, и немедленно сообщить комиссионеру о выявленных в этом имуществе недостатках.
Статья 1024. Право комиссионера на возмещение затрат, сделанных им в связи с выполнением договора комиссии
1. Комиссионер имеет право на возмещение затрат, сделанных им в связи с выполнением своих обязанностей по договору комиссии, в частности в случае, если он или субкомиссионер принял все меры относительно совершения сделки, но не мог ее совершить из-за обстоятельств, которые от него не зависели.

Статья 1025. Право комитента на отказ от договора комиссии
1. Комитент имеет право отказаться от договора комиссии.

2. Если договор комиссии заключен без определения срока, комитент должен известить комиссионера об отказе от договора не позднее чем за тридцать дней.

3. В случае отказа комитента от договора комиссии он должен в срок, установленный договором, а если такой срок не установлен, - немедленно распорядиться своим имуществом, которое находится у комиссионера. В случае невыполнения комитентом этой обязанности комиссионер имеет право передать это имущество на сохранение за счет комитента или продать имущество по наивыгоднейшей для комитента цене.

4. В случае отказа комитента от договора комиссии комиссионер имеет право на возмещение затрат, сделанных им в связи с выполнением договора.

Статья 1026. Право комиссионера на отказ от договора комиссии
1. Комиссионер имеет право отказаться от договора комиссии лишь тогда, когда срок не установлен договором. Комиссионер должен сообщить комитенту об отказе от договора не позднее чем за тридцать дней.

Комиссионер, который отказался от договора комиссии, должен принять меры, необходимые для сохранности имущества комитента.

2. В случае отказа комиссионера от договора комиссии комитент должен распорядиться своим имуществом, которое находится у комиссионера, на протяжении пятнадцати дней со дня получения сообщения об отказе комиссионера от договора. В случае невыполнения комитентом этой обязанности комиссионер имеет право передать это имущество на сохранение за счет комитента или продать имущество по наивыгоднейшей для комитента цене.

Статья 1027. Последствия смерти физического лица или прекращение юридического лица - комиссионера
1. В случае смерти физического лица или ликвидации юридического лица - комиссионера договор комиссии прекращается.

2. Если юридическое лицо - комиссионер прекращается и устанавливаются его правопреемники, права и обязанности комиссионера переходят к правопреемникам, если на протяжении срока, установленного для заявления кредиторами своих требований, комитент не сообщит об отказе от договора.

Статья 1028. Особенности отдельных видов комиссии
1. Законом могут быть установлены особенности договора комиссии относительно отдельных видов имущества.
"""
GKU_g_70 = """ 
Глава 70 - Гражданского кодекса
Управление имуществом

Статья 1029. Договор управления имуществом
1. По договору управления имуществом одна сторона (установщик управления) передает другой стороне (управляющему) на определенный срок имущество в управление, а другая сторона обязуется за плату осуществлять от своего имени управление этим имуществом в интересах установщика управления или указанного им лица (выгодоприобретателя).

2. Договор управления имуществом может удостоверять возникновение у управляющего права доверительной собственности на полученное в управление имущество.

Законом или договором управления имуществом могут быть предусмотрены ограничения права доверительной собственности управляющего.

Статья 1030. Предмет договора управления имуществом
1. Предметом договора управления имуществом могут быть предприятие как единый имущественный комплекс, недвижимая вещь, ценные бумаги, имущественные права и другое имущество.

2. Не могут быть предметом договора управления имуществом денежные средства, кроме случаев, когда право осуществлять управление денежными средствами прямо установлено законом.

3. Имущество, переданное в управление, должно быть отделено от иного имущества установщика управления и от имущества управляющего.

Имущество, переданное в управление, должно учитываться у управляющего на отдельном балансе, и по нему ведется отдельный учет.

Расчеты, связанные с управлением имуществом, осуществляются на отдельном банковском счете.

4. Имущество, приобретенное управляющим в результате управления имуществом, включается в состав полученного в управление имущества.

Статья 1031. Форма договора управления имуществом
1. Договор управления имуществом составляется в письменной форме.

2. Договор управления недвижимым имуществом подлежит нотариальному удостоверению и государственной регистрации.

Статья 1032. Учредитель
1. Учредителем управления является собственник имущества.

2. Если собственником имущества является физическое лицо, место пребывания которого неизвестно или он признан безвестно отсутствующим, учредителем управления является орган опеки и попечительства.

3. Если собственником имущества является малолетнее лицо или физическое лицо, признанное недееспособным, учредителем управления может быть опекун или орган опеки и попечительства.

4. Если собственником имущества является несовершеннолетний, учредителем управления является это лицо за разрешением родителей (усыновителей) или попечителя.

5. Если собственником имущества является лицо, гражданская дееспособность которого ограничена, учредителем управления является ее попечитель.

6. В случаях, установленных законом, учредителем управления может быть Национальное агентство Украины по вопросам выявления, розыска и управления активами, полученными от коррупционных и других преступлений.

7. В случае перехода права собственности на имущество, являющееся предметом договора управления, от учредителя управления к другому лицу договор управления не прекращается, кроме случаев, когда право собственности на имущество переходит в результате обращения на него взыскания.

Статья 1033. Управляющий
1. Управляющим может быть субъект предпринимательской деятельности.

2. Управляющим не может быть орган государственной власти, орган власти Автономной Республики Крым или орган местного самоуправления, если иное не установлено законом.

3. Выгодоприобретатель не может быть управляющим.

4. Управляющий действует без доверенности.

5. Управляющий, если это определено договором об управлении имуществом, является доверительным собственником этого имущества, которым он владеет, пользуется и распоряжается в соответствии с законом и договором управления имуществом. Договор об управлении имуществом не влечет перехода права собственности к управляющему на имущество, переданное в управления.

Статья 1034. Лицо, приобретающее выгоду от имущества, переданного в управление
1. Выгоды от имущества, переданного в управление, принадлежат установщику управления.

2. Установщик управления может указать в договоре лицо, которое имеет право приобретать выгоду от имущества, переданного в управление (выгодоприобретателя).

Статья 1035. Важные условия договора управления имуществом
1. Важными условиями договора управления имуществом является:

перечень имущества, которое передается в управление;
размер и форма оплаты за управление имуществом.
Статья 1036. Срок договора управления имуществом
1. Срок управления имуществом устанавливается в договоре управления имуществом. Если стороны не определили срока договора управления имуществом, он считается заключенным на пять лет.

2. В случае отсутствия заявления одной из сторон о прекращении или изменении договора управления имуществом после окончания его срока договор считается продолженным на такой же срок и на таких же условиях.

Статья 1037. Права и обязанности управляющего
1. Управляющий управляет имуществом согласно условиям договора. Управляющий может отчуждать имущество, переданное в управление, заключать относительно него договор залога лишь по согласию установщика управления.

2. Управляющий имеет право требовать устранения любых нарушений его прав на имущество, переданное в управление, согласно статье 396 Гражданского кодекса Украины.

Статья 1038. Осуществление управления имуществом
1. Управляющий управляет имуществом лично, кроме случаев, установленных статьей 1041 Гражданского кодекса Украины.

2. Управляющий, совершая фактические и юридические действия, связанные с управлением имуществом, обязан сообщать лицам, с которыми он совершается сделки, о том, что он является управляющим, а не собственником имущества.

3. В сделках относительно имущества, переданного в управление, которые совершаются в письменной форме, указывается о том, что они совершены управляющим. В случае отсутствия такого указания управляющий обязуется перед третьими лицами лично.

Статья 1039. Передача в управление имущества, которое является предметом договора залога
1. Имущество, которое является предметом договора залога, может быть передано в управление.

2. Установщик управления обязан предупредить управляющего о том, что имущество, которое передается в управление, является предметом договора залога.

Если установщик управления не предупредил управляющего и сам управляющий не знал и не мог знать о том, что имущество, передано в управление, является предметом договора залога, управляющий имеет право требовать расторжения договора и выплаты полагающейся ему по договору платы согласно срока управления этим имуществом.

Статья 1040. Обращение взыскания на имущество, переданное в управление, по требованию кредитора установщика управления
1. Обращение взыскания на имущество, переданное в управление, по требованию кредитора установщика управления не допускается, кроме случая признания установщика управления банкротом или обращения взыскания по требованию залогодержателя на имущество, которое является предметом договора залога. В случае признания установщика управления банкротом договор управления этим имуществом прекращается и оно включается в ликвидационную массу.

Статья 1041. Передача права управления имуществом другому лицу
1. Управляющий может поручить другому лицу (заместителю) совершить от его имени действия, необходимые для управления имуществом, если это предусмотрено договором управления имуществом или этого требуют интересы установщика управления или выгодоприобретателя в случае невозможности получить в разумный срок соответствующие указания установщика управления. Управляющий отвечает за действия избранного им заместителя, как за свои собственные.

Статья 1042. Право управляющего на оплату
1. Управляющий имеет право на плату, установленную договором, а также на возмещение необходимых расходов, произведенных им в связи с управлением имуществом.

2. Управляющий имуществом, если это предусмотрено законом или заключенным в соответствии с ним договором, имеет право отчислять причитающиеся ему в соответствии с частью первой настоящей статьи денежные суммы непосредственно из доходов от использования имущества, переданного в управления.

Статья 1043. Ответственность управляющего
1. Управляющий, который не обнаружил при управлении имуществом надлежащей заботливости об интересах установщика управления или выгодоприобретателя, обязан возместить установщику управления причиненные убытки, а Выгодоприобретателю - упущенную выгоду.

Управляющий отвечает за причиненные убытки, если не докажет, что они возникли вследствие непреодолимой силы, виновных действий установщика управления или выгодоприобретателя.

2. Управляющий несет субсидиарную ответственность по долгам, которые возникли в связи с осуществлением им управления, если стоимости имущества, переданного в управление, недостаточно для удовлетворения требований кредиторов.

3. Субсидиарная ответственность управляющего, установленная частью второй этой статьи, наступает также в случае совершения сделок с превышением предоставленных ему полномочий или установленных ограничений, при условии, что третьи лица, которые принимают участие в сделке, докажут, что они не знали и не могли знать о превышении управляющим полномочий или установленных ограничений. В этом случае установщик управления может требовать от управляющего возмещения причиненных им убытков.

Статья 1044. Прекращение договора управления имуществом
1. Договор управления имуществом прекращается в случае:

гибели имущества, переданного в управление;
прекращение договора по заявлению одной из сторон в связи с окончанием его срока;
смерти физического лица - выгодоприобретателя или ликвидации юридического лица - выгодоприобретателя, если иное не установлено договором;
отказа выгодоприобретателя от получения выгоды по договору;
признания управляющего недееспособным, безвестно отсутствующим, ограниченно дееспособным или смерти;
отказа управляющего или установщика управления от договора управления имуществом в связи с невозможностью управителя осуществлять управление имуществом;
отказа установщика управления от договора с иной, чем указанная в пункте 6 настоящей части, причины при условии выплаты управляющему платы, предусмотренной договором;
признания физического лица - установщика управления банкротом;
полного завершения исполнения сторонами договора управление имуществом;
досрочного прекращения управления имуществом, если это предусмотрено настоящим договором, или по решению суда.
2. В случае отказа одной стороны от договора управления имуществом она должна уведомить другую сторону об этом за три месяца до прекращения договора, если договором не установлен иной срок.

3. В случае прекращения договора управления имуществом имущество было передано в управление, или имущество, приобретенное от такого управления, передается установщику управления в порядке, определенном договором.

Статья 1045. Особенности управления ценными бумагами
1. Особенности управления ценными бумагами устанавливаются законом.
"""
GKU_g_71 = """ 
Глава 71 - Гражданского кодекса
Займ. Кредит. Банковский вклад

Параграф 1. Займ

Статья 1046. Договор займа
1. По договору займа одна сторона (заимодатель) передает в собственность второй стороне (заемщику) денежные средства или другие вещи, определенные родительными признаками, а заемщик обязуется возвратить заимодателю такую же сумму денежного средства (сумму займа) или такое же количество вещей того же рода и такого же качества.

Договор займа является заключенным с момента передачи денег или других вещей, определенных родительными признаками.

Статья 1047. Форма договора займа
1. Договор займа составляется в письменной форме, если его сумма не менее чем в десять раз превышает установленный законом размер не облагаемого налогами минимума доходов граждан, а в случаях, если заимодателем является юридическое лицо, - независимо от суммы.

2. На подтверждение заключения договора займа и его условий может быть представлена расписка заемщика или другой документ, который заверяет передачу ему заимодателем определенной денежной суммы или определенного количества вещей.

Статья 1048. Проценты по договору займа
1. Заимодатель имеет право на получение от заемщика процентов от суммы займа, если другое не установлено договором или законом. Размер и порядок получения процентов устанавливаются договором. Если договором не установлен размер процентов, их размер определяется на уровне учетной ставки Национального банка Украины.

В случае отсутствия другой договоренности сторон проценты выплачиваются ежемесячно до дня возвращения займа.

2. Договор займа считается беспроцентным, если:

он заключен между физическими лицами на сумму, которая не превышает пятидесятикратного размера не облагаемого налогами минимума доходов граждан, и не связан с осуществлением предпринимательской деятельности хотя бы одной из сторон;
заемщику переданы вещи, определенные родительными признаками.
Статья 1049. Обязанность заемщика возвратить заем
1. Заемщик обязан возвратить заимодателю заем (денежные средства в такой же сумме или вещи, определенные родительными признаками, в таком же количестве, такого же рода и такого же качества, которые были переданы ему заимодателем) в срок и в порядке, которые установлены договором.

Если договором не установлен срок возвращения займа или этот срок определен моментом предъявления требования, заем должен быть возвращен заемщиком на протяжении тридцати дней со дня предъявления заимодателем требования об этом, если другое не установлено договором.

2. Заем, предоставленый по договору беспроцентного займа, может быть возвращен заемщиком досрочно, если другое не установлено договором.

3. Заем считается возвращеным в момент передачи заимодателю вещей, определенных родительными признаками, или зачисления денежной суммы, которая занималась, на его банковский счет.

Статья 1050. Последствия нарушения договора заемщиком
1. Если заемщик своевременно не возвратил сумму займа, он обязан уплатить денежную сумму согласно статье 625 Гражданского кодекса Украины. Если заемщик своевременно не возвратил вещи, определенные родительными признаками, он обязан уплатить неустойку согласно статям 549-552 Гражданского кодекса Украины, которая начисляется со дня, когда вещи должны были быть возвращены, до дня их фактического возвращения заимодателю, независимо от уплаты процентов, принадлежащих ему согласно статье 1048 Гражданского кодекса Украины.

2. Если договором установлена обязанность заемщика возвратить заем частями (с рассрочкой), то в случае просрочки возвращения очередной части заимодатель имеет право требовать досрочного возвращения оставшейся части займа, и уплаты процентов, надлежащих ему согласно статье 1048 этого Кодекса.

Параграф 2. Кредит

Статья 1054. Кредитный договор
1. По кредитному договору банк или другое финансовое учреждение (кредитодатель) обязуется предоставить денежные средства (кредит) заемщику в размере и на условиях, установленных договором, а заемщик обязуется возвратить кредит и уплатить проценты.

2. К отношениям по кредитному договору применяются положения параграфа 1 этой главы, если другое не установлено этим параграфом и не вытекает из сути кредитного договора.

3. Особенности регулирования отношений по договору о предоставлении потребительского кредита установлены законом.

Статья 1055. Форма кредитного договора
1. Кредитный договор заключается в письменной форме.

2. Кредитный договор, заключенный с несоблюдением письменной формы, является ничтожным.

Статья 1056. Отказ от предоставления или получения кредита
1. Кредитодатель имеет право отказаться от предоставления заемщику предусмотренного договором кредита частично или в полном объеме в случае нарушения процедуры признания заемщика банкротом или при наличии других обстоятельств, которые явным образом свидетельствуют о том, что предоставленный заемщику кредит своевременно не будет возвращен.

2. Заемщик имеет право отказаться от получения кредита частично или в полном объеме, уведомив об этом кредитодателя до установленного договором срока его предоставления, если другое не установлено договором или законом.

3. В случае нарушения заемщиком установленной кредитным договором обязанности целевого использования кредита кредитодатель имеет право также отказаться от дальнейшего кредитования заемщика по договору.

Статья 1056-1. Проценты по кредитному договору
1. Процентная ставка по кредиту может быть фиксированной или изменяемой. Тип процентной ставки определяется кредитным договором.

2. Размер процентов, тип процентной ставки (фиксированная или изменяемая) и порядок их уплаты по кредитному договору определяются в договоре в зависимости от кредитного риска, предоставленного обеспечения, спроса и предложений, сложившихся на кредитном рынке, срока пользования кредитом, размера учетной ставки и других факторов на дату составления договора.

3. Фиксированная процентная ставка является неизменной в течение всего срока кредитного договора. Установленный договором размер фиксированной процентной ставки не может быть увеличен кредитором в одностороннем порядке. Условие договора относительно права кредитора изменять размер фиксированной процентной ставки в одностороннем порядке является ничтожной.

4. В случае применения изменяемой процентной ставки кредитор самостоятельно, с определенной в кредитном договоре периодичностью, имеет право увеличивать и обязан уменьшать процентную ставку согласно условиям и в порядке, установленных кредитным договором. Кредитодатель обязан письменно уведомить заемщика, поручителя и иных обязанных по договору лиц об изменении процентной ставки не позднее чем за 15 календарных дней до даты которые распространяется новая ставка. В кредитном договоре устанавливается порядок расчета изменяемой процентной ставки по применением согласованного сторонами индекса. Порядок расчета изменяемой процентной ставки должен позволять точно определить размер процентной ставки по кредиту на любой момент времени в течение срока действия кредитного договора. Кредитор не имеет права изменять установленный кредитным договором порядок расчета изменяемой процентной ставки без согласия заемщика.

5. Индекс, используемый в формуле определения изменяемой процентной ставки, должен отвечать следующим требованиям:

текущее значение индекса должно периодически, не реже одного раза в месяц, публиковаться в СМИ или обнародоваться через другие общедоступные регулярные источники информации. Кредитный договор должен содержать ссылки на источник информации о соответствующем индекс;
индекс должен основываться на объективных индикаторах финансовой сферы, позволяющие определить рыночную стоимость кредитных ресурсов;
значение индекса должно устанавливаться независимым учреждением с признанной деловой репутацией на рынке финансовых услуг.
6. В случае применения изменяемой процентной ставки в кредитном договоре должен определяться максимальный размер увеличение процентной ставки

7. Особенности применения изменяемой процентной ставки по договору о предоставлении потребительского кредита устанавливаются законом

Статья 1057. Коммерческий кредит
1. Договором, выполнение которого связано с передачей в собственность второй стороне денежных средств или вещей, которые определяются родительными признаками, может предполагаться предоставление кредита как аванса, предшествующей оплаты, отсрочки или рассрочки оплаты товаров, работ или услуг (коммерческий кредит), если другое не установлено законом.

2. К коммерческому кредиту применяются положения статей 1054-1056 Гражданского кодекса Украины, если другое не установлено положениями о договоре, из которого возникло соответствующее обязательство, и не противоречит сути такого обязательства.

Статья 1057-1. Правовые последствия недействительности кредитного договора
1. В случае признания кредитного договора недействительным суд по заявлению стороны в обязательном порядке применяет последствия недействительности сделки, предусмотренные частью первой статьи 216 настоящего Кодекса, и определяет денежную сумму, которая должна быть возвращена кредитодателю.

2. Признавая недействительным кредитный договор, в котором исполнения обязательства заемщика обеспечены залогом имущества заемщика или поручителя, суд по заявлению кредитодателя накладывает на такое имущество арест.

3. Арест на имущество подлежит снятию, если в течение 30 дней со дня вступления в законную силу решения суда о признании недействительным кредитного договора средства в размере, определенном судом, будут возвращены кредитодателю. Если в указанный срок обязательство возвратить средства не выполнено, кредитор имеет право обратиться в суд с иском об обращении взыскания на арестованное имущество.

4. Арест на имущество, наложенный в соответствии с частью второй настоящей статьи, подлежит снятию после выполнения обязательства вернуть кредитодателю средства в размере, определенном судом.

5. Признавая недействительным договор залога, который обеспечивал выполнение обязательства заемщика по кредитному договору, суд по заявлению кредитодателя налагает арест на имущество, которое было предметом залога. Такой арест подлежит снятию после выполнения обязательства вернуть кредитодателю средства по кредитному договору, а в случае признания кредитного договора недействительным - после выполнения обязательства вернуть кредитодателю средства в размере, определенном судом в соответствии с частью первой настоящей статьи

Параграф 3. Банковский вклад

Статья 1058. Договор банковского вклада
1. По договору банковского вклада (депозита) одна сторона (банк), которая приняла от второй стороны (вкладчика) или для него поступившую денежную сумму (вклад), обязуется выплачивать вкладчику такую сумму и проценты на нее или доход в другой форме на условиях и в порядке, установленных договором.

2. Договор банковского вклада, в котором вкладчиком является физическое лицо, является публичным договором (статья 633 Гражданского кодекса Украины).

3. К отношениям банка и вкладчика по счету, на который внесен вклад, применяются положения о договоре банковского счета (глава 72 Гражданского кодекса Украины), если другое не установлено этой главой или не вытекает из сути договора банковского вклада.

Статья 1059. Форма договора банковского вклада
1. Договор банковского вклада составляется в письменной форме. Письменная форма договора банковского вклада считается соблюденной, если внесение денежной суммы подтверждено договором банковского вклада с выдачей сберегательной книжки или сертификата или другого документа, который отвечает требованиям, установленным законом, другими нормативно-правовыми актами в сфере банковской деятельности (банковскими правилами) и обычаями делового оборота.

2. В случае несоблюдения письменной формы договора банковского вклада настоящий договор является ничтожным.

Статья 1060. Виды банковских вкладов
1. Договор банковского вклада составляется на условиях выдачи вклада по первому требованию (вклад по требованию) или на условиях возвращения вклада по истечению установленного договором срока (срочный вклад).

Договором может быть предусмотрены внесения денежной суммы на других условиях ее возвращения.

2. По договору банковского вклада по требованию банк обязан выдать вклад или его часть по первому требованию вкладчика.

Условие договора банковского вклада по требованию об отказе от права на получение вклада по первому требованию ничтожно.

3. По договору банковского срочного вклада банк обязан выдать вклад и начисленные проценты по этому вкладу с истечением срока, определенного в договоре банковского вклада.

Возвращение вкладчику банковского срочного вклада и начисленных процентов по этому вкладу по его требованию до истечения срока либо до наступления иных обстоятельств, определенных договором, возможно исключительно в случаях, если это предусмотрено условиями договора банковского срочного вклада.

4. Если вкладчик не требует возвращения суммы срочного вклада до истечения срока, установленного договором банковского вклада, или возвращение суммы вклада, внесенного на других условиях возвращения, после наступления определенных договором обстоятельств договор считается продленным на условиях вклада по требованию, если другое не установлено договором.

Статья 1061. Проценты на банковский вклад
1. Банк выплачивает вкладчику проценты на сумму вклада в размере, установленном договором банковского вклада.

Если договором не установлен размер процентов, банк обязан выплачивать проценты в размере учетной ставки Национального банка Украины.

2. Банк имеет право изменить размер процентов, которые выплачиваются на вклады по требованию, если другое не установлено договором.

В случае уменьшения банком размера процентов на вклады по требованию новый размер процентов применяется к вкладам, внесенным в уведомление вкладчиков об уменьшении процентов, по истечению одного месяца с момента соответствующего сообщения, если другое не установлено договором.

3. Установленный договором размер процентов на срочный вклад или на вклад, внесенный на условиях его возвращения в случае наступления определенных договором обстоятельств, не может быть односторонне уменьшен банком, если другое не установлено законом.

4. Условие договора относительно права банка изменять размер процентов на срочный вклад в одностороннем порядке является ничтожным.

6. Проценты на банковский вклад выплачиваются вкладчику по его требованию по истечению каждого квартала в отдельности от суммы вклада, а неистребованные в этот срок проценты увеличивают сумму вклада, на которую начисляются проценты, если другое не установлено договором банковского вклада.

В случае возвращения вклада выплачиваются все начисленные до этого момента проценты.

Статья 1062. Внесение денежных средств на счет вкладчика другим лицом
1. На счет по банковскому вкладу зачисляются денежные средства, которые поступили в банк на имя вкладчика от другого лица, если договором банковского вклада не предусмотрено другое. При этом считается, что вкладчик согласился на получение денежных средств от другого лица, предоставив ему необходимые данные о счете по вкладу.

2. Средства, по ошибке зачисленные на счет вкладчика, подлежат возвращению согласно статье 388 этого Кодекса.

Статья 1063. Договор банковского вклада в пользу третьего лица
1. Физическое или юридическое лицо может заключить договор банковского вклада (сделать вклад) в пользу третьего лица. Это лицо приобретаем право вкладчика с момента предъявления им в банк первого требования, которое вытекает из прав вкладчика, или выражения им другим способом намерения воспользоваться такими правами.

До обретения лицом, в пользу которого сделан банковский вклад, прав вкладчика эти права принадлежат лицу, которое сделало вклад.

Определение имени физического лица (статья 28 Гражданского кодекса Украины) или наименование юридического лица (статья 90 Гражданского кодекса Украины), в пользу которого сделан вклад, является важным условием договора банковского вклада.

2. Если лицо, в пользу которого сделан вклад, отказалось от него, лицо, которое заключило договор банковского вклада в пользу третьего лица, имеет право требовать возвращения вклада или перевести его на свое имя.

Статья 1064. Сберегательная книжка
1. Заключение договора банковского вклада с физическим лицом и внесение денежных средств на его счет по вкладу подтверждаются сберегательной книжкой.

В сберегательной книжке указываются наименование и местонахождение банка (его филиала), номер счета по вкладу, а также все денежные суммы, зачисленные на счет и списанные из счета, а также остаток денежных средств на счете на момент предъявления сберегательной книжки в банк.

2. Ведомости о вкладе, указанные в сберегательной книжке, являются основанием для расчетов по вкладу между банком и вкладчиком.

3. Выдача банковского вклада, выплата процентов по нему и выполнение распоряжений вкладчика о перечислении денежных средств со счета по вкладу другим лицам осуществляются банком в случае предъявления сберегательной книжки.

Если сберегательную книжка утрачена или приведен в непригодный для предъявления состояние, банк по заявлению вкладчика выдает ему новую сберегательную книжку.

Статья 1065. Сберегательный (депозитный) сертификат
1. Сберегательный (депозитный) сертификат подтверждает сумму вклада, внесенного в банк, и права вкладчика (владельца сертификата) на получение по истечению установленного срока суммы вклада и процентов, установленных сертификатом, в банке, который его выдал.

2. Исключена.
"""
GKU_g_72 = """ 
Глава 72 - Гражданского кодекса
Банковский счет. §1. Общие положени о банковском счете

Статья 1066. Договор банковского счета
1. По договору банковского счета банк обязуется принимать и зачислять на счет, открытый клиенту (владельцу счета), денежные средства, которые к нему поступают, выполнять распоряжения клиента о перечислении и выдаче соответствующих сумм со счета и проведении других операций по счету.

2. Банк имеет право использовать денежные средства на счету клиента, гарантируя его право беспрепятственно распоряжаться этими средствами.

3. Банк не имеет права определять и контролировать направления использования денежных средств клиента и устанавливать другие ограничения его права на распоряжение денежными средствами, не предусмотренные законом, договором между банком и клиентом или условиями обременения, предметом которого являются имущественные права на денежные средства, находящиеся на банковском счете.

4. Положения этой главы применяются к другим финансовым учреждениям при заключении ими договора банковского счета согласно предоставленной лицензии, а также применяются к корреспондентским счетам и другим счетам банков, если другое не установлено законом.

Статья 1067. Заключение договора банковского счета
1. Договор банковского счета заключается для открытия клиенту или определенному им лицу счета в банке на условиях, согласованных сторонами.

2. Банк обязан заключить договор банковского счета с клиентом, который обратился с предложением открыть счет на объявленных банком условиях, которые отвечают закону и банковским правилам.

Банк не имеет права отказать в открытии счета, совершении соответствующих операций предусмотренных законом, учредительными документами банка и предоставленной ему лицензией, кроме случаев, когда банк не имеет возможности принять на банковское обслуживание или когда такой отказ допускается законом или банковскими правилами.

В случае необоснованного уклонения банка от заключения договора банковского счета клиент имеет право на защиту согласно Гражданскому кодексу Украины.

Статья 1068. Операции со счетом, которые выполняются банком
1. Банк обязан совершать для клиента операции, предусмотренные для счетов данного вида законом, банковскими правилами и обычаями делового оборота, если другое не установлено договором банковского счета.

2. Банк обязан зачислить денежные средства, которые поступили на счет клиента, в день поступления в банк соответствующего расчетного документа, если другой срок не установлен договором банковского счета или законом.

3. Банк обязан по распоряжению клиента выдать или пересчитать с его счета денежные средства в день поступления в банк соответствующего расчетного документа, если другой срок не предусмотрен договором банковского счета или законом.

4. Клиент обязан уплатить плату за выполнение банком операций со счетом клиента, если это установлено договором.

Статья 1069. Кредитование счета
1. Если согласно договору банковского счета банк осуществляет платежи со счета клиента, несмотря на отсутствие на нем денежных средств (кредитование счета), банк считается предоставившим клиенту кредит на соответствующую сумму со дня осуществления этого платежа.

2. Права и обязанности сторон, связанные с кредитованием счета, определяются положениями о займе и кредите (параграфы 1 и 2 главы 71 Гражданского кодекса Украины), если другое не установлено договором или законом.

3. Размер платы за использование клиентом средств банка, который не установлен договором, не может превышать двойную учетную ставку Национального банка Украины.

Статья 1070. Проценты за пользование средствами, которые находятся на счету
1. За пользование денежными средствами, которые находятся на счету клиента, банк платит проценты, сумма которых зачисляется на счет, если другое не установлено договором банковского счета или законом. Сумма процентов зачисляется на счет клиента в сроки, установленные договором, а если такие сроки не установлены договором, - по истечению каждого квартала.

2. Проценты, предусмотренные частью первой этой статьи, платятся банком в размере, установленном договором, а если соответствующие условия не установлены договором, - в размере, который обычно платится банком по вкладу по требованию.

Статья 1071. Основания списания денежных средств со счета
1. Банк может списать денежные средства со счета клиента на основании его распоряжения.

2. Денежные средства могут быть списаны со счета клиента без его распоряжения на основании решения суда, а также в случаях, установленных законом, договором между банком и клиентом или условиями ограничения, предметом которого являются имущественные права на денежные средства, находящиеся на банковском счету.

Статья 1072. Очередность списания денежных средств со счета
1. Банк выполняет расчетные документы соответственно очередности их поступления и исключительно в границах остатка денежных средств на счету клиента, если другое не установлено договором между банком и клиентом.

2. В случае одновременного поступления в банк нескольких расчетных документов, на основании которых осуществляется списание денежных средств, банк списывает средства со счета клиента в такой очередности:

в первую очередь списываются денежные средства на основании решения суда для удовлетворения требований о возмещении вреда, причиненного увечьем, другим повреждением здоровья или смертью, а также требований о взыскании алиментов;
во вторую очередь списываются денежные средства на основании решения суда для расчетов относительно выплаты выходного пособия и оплаты работы лицам, которые работают по трудовому договору (контракту), а также выплаты по авторскому договору;
в третью очередь списываются денежные средства на основании других решений суда;
в четвертую очередь списываются денежные средства по расчетным документам, которые предусматривают платежи в бюджет;
в пятую очередь списываются денежные средства по другим расчетным документам в порядке очередности их поступления.
В случае одновременного поступления в банк расчетного документа, предоставленного согласно условий обременения, предметом которого являются имущественные права на денежные средства, находящиеся на банковском счете, и другого расчетного документа, на основании которого осуществляется списание денежных средств, банк списывает средства со счета клиента вне очереди за расчетным документом, предоставленным в соответствии с условиями такого обременения. В случае одновременного поступления в банк нескольких расчетных документов, предоставленных в соответствии с условиями обременений, предметом которых являются имущественные права на денежные средства, находящиеся на банковском счете, банк списывает средства со счета клиента за такими расчетными документами в соответствии с приоритетом соответствующих обременений

3. В случае отсутствия (недостаточности) денежных средств на счету клиента банк не ведет учета расчетных документов, если другое не установлено договором между банком и клиентом.

Статья 1073. Правовые последствия ненадлежащего выполнения банком операций по счету клиента
1. В случае несвоевременного зачисления на счет денежных средств, которые поступили клиенту, их безосновательного списания банком со счета клиента или нарушения банком распоряжения клиента о перечислении денежных средств с его счета, банк должен немедленно после выявления нарушения зачислить соответствующую сумму на счет клиента или надлежащего получателя, уплатить проценты и возместить причиненные убытки, если другое не установлено законом.

Статья 1074. Ограничение права распоряжение счетом
1. Ограничение прав клиента относительно распоряжения денежными средствами, находящимися на его счете, не допускается, кроме случаев ограничения права распоряжения счетом по решению суда или в иных случаях, установленных законом или условиями обременения, предметом которого являются имущественные права на денежные средства, находящиеся на счете, а также в случае остановки финансовых операций, которые могут быть связаны с легализацией (отмыванием) доходов, полученных преступным путем, или финансированием терроризма и финансированием распространения оружия массового уничтожения, предусмотренных законом. Банк не имеет права устанавливать запрет на установление обременения, но может устанавливать разумное вознаграждение.

2. Клиент не имеет права без письменного согласия обременителя предоставлять банку распоряжения, а банк не имеет права их выполнять, если в результате размер денежных средств на счете будет меньше размера, определенного в соответствии с условиями обременения, предметом которого являются имущественные права на денежные средства, находящиеся на соответствующем банковском счете.

3. После получения банком письменного уведомления обременителя о наличии оснований для обращения взыскания на предмет залога, которым являются имущественные права на денежные средства, находящиеся на банковском счете, клиент по соответствующему договору банковского счета не вправе без письменного согласия обременителя предоставлять банку распоряжения, а банк не вправе их выполнять, если в результате размер денежных средств на счету будет меньше размера обеспеченного обременением требования обременителя. Банк не проверяет наличие оснований, указанных в полученном им от обременителя сообщении.

4. Если на момент получения банком распоряжения клиента банк был письменно уведомлен клиентом о существовании обременения, банк, который нарушил требования частей второй и третьей этой статьи, отвечает перед обременителем в размере денежных средств, списанных им со счета во исполнение распоряжения клиента.

5. Согласие обременителя, предусмотренное частями второй и третьей настоящей статьи, может быть выражено в общей форме и/или содержать условия, при которых такое согласие считается предоставленным. Такое согласие может быть включено в условия договора, которым устанавливается обременение имущественных прав на денежные средства, находящиеся на банковском счету

Статья 1075. Разрыв договора банковского счета
1. Договор банковского счета расторгается по заявлению клиента в любое время. Клиент не имеет права без согласия обременителя по договоренности с банком или в одностороннем порядке, в том числе путем одностороннего отказа от исполнения обязательства, расторгать договор банковского счета или совершать иные действия, имеющие следствием прекращение договора, в случае если имущественные права на денежные средства, находящиеся на соответствующем счету, являются предметом залога, если иное не предусмотрено условиями обременения. Сделки, совершенные с нарушением этого требования, являются ничтожными.

Согласие обременителя может быть выражено в общей форме и/или содержать условия, при которых такое согласие считается предоставленным. Такое согласие может быть включено в условия договора, которым устанавливается обременение имущественных прав на денежные средства, находящиеся на банковском счету

2. Банк имеет право требовать расторжения договора банковского счета:

если сумма денежных средств, которые сохраняются на счету клиента, осталась меньше минимального размера, предусмотренного банковскими правилами или договором, если такая сумма не будет восстановлена в течение месяца со дня предупреждения банком об этом;
в случае отсутствия операций по этому счету на протяжении года, если другое не установлено договором;
3) в случаях, предусмотренных законодательством по урегулированию отношений в сфере предотвращения и противодействия легализации (отмыванию) доходов, полученных преступным путем, финансированию терроризма и финансированию распространения оружия массового уничтожения;
в других случаях, установленных договором или законом.
3. Остаток денежных средств на счете выдается клиенту либо по его указанию в порядке, установленном законом, перечисляется на другой счет в сроки и в порядке, установленные банковскими правилами.

4. Банк может отказаться от договора банковского счета и закрыть счет клиента в случае отсутствия операций по счету клиента на протяжении трех лет подряд и отсутствия остатка денежных средств на этом счету.

Статья 1075-1. Внесение изменений к договору банковского счета, имущественные права на денежные средства на котором являются предметом обременения
1. Любые изменения к договору банковского счета, имущественные права на денежные средства на котором являются предметом обременения (кроме изменений, указанных в части второй этой статьи), вносятся исключительно при условии предоставления предварительного письменного согласия на такие изменения обременителем.

Согласие обременителя может быть выражено в общей форме и/или содержать условия, при которых такое согласие считается предоставленным. Такое согласие может быть включено в условия договора, которым устанавливается обременение имущественных прав на денежные средства, находящиеся на банковском счету.

2. Изменения к договору банковского счета, имущественные права на денежные средства на котором являются предметом залога, могут вноситься без согласия обременителя, если такие изменения не ограничивают права обременителя, возникающие на основании обременения. В случае возникновения спора обязанность доказывания того, что соответствующие изменения к договору такого банковского счета не ущемляют права обременителя, возлагается на клиента.

3. В случае нарушения требований этой статьи клиент обязан возместить обременителю убытки, причиненные таким нарушением. Если на момент внесения соответствующих изменений банк был письменно уведомлен клиентом о существовании обременения, предметом которого являются имущественные права на денежные средства, находящиеся на соответствующем счете, обязанность по возмещению ущерба банк и клиент несут солидарно.

Статья 1076. Банковская тайна
1. Банк гарантирует тайну банковского счета, операций по счету и сведений о клиенте.

Ведомости об операциях и счетах могут быть предоставлены только самим клиентом или его представителем, другими лицам, в том числе органам государственной власти, их должностным и служебным лицам, такие сведения могут быть предоставлены исключительно в случаях и в порядке, установленных законом о банках и банковской деятельности.

2. В случае разглашения банком сведений, которые составляют банковскую тайну, клиент имеет право требовать от банка возмещения причиненных убытков и морального вреда.

3. Банк обязан по письменному требованию обременителя с отягощением, предметом которого являются имущественные права на денежные средства, находящиеся на банковском счету, предоставлять ему информацию об остатке денежных средств на соответствующем счете, операции по ним, обременения, в отношении которых в банк поступили сообщения и/или которые взяты банком на учет, иные ограничения права распоряжения счетом в срок, за который такая информация предоставляется клиенту, если право обременителя на получение соответствующей информации предусмотрено сделкой, на основании которой возникает такое обременение

§2. Счет условного хранения (эскроу)

Статья 1076-1. Договор счета условного хранения (эскроу)
1. По договору счета условного хранения (эскроу) банк обязуется принимать и зачислять на счет условного хранения (эскроу), открытый клиенту (владельцу счета), денежные средства, полученные от владельца счета и/или от третьих лиц, и перечислять такие средства лицу (лицам), указанному владельцем счета (бенефициару или бенефициарам), или вернуть такие средства владельцу счета при наступлении оснований, предусмотренных договором счета условного хранения (эскроу).

2. Если иное не предусмотрено договором счета условного хранения (эскроу), банк имеет право использовать денежные средства на счете условного хранения (эскроу), гарантируя своевременное перечисление таких средств бенефициару (бенефициарам) или возврата таких средств владельцу счета в соответствии с условиями договора счета условного хранения (эскроу).

3. К отношениям сторон в связи с открытием, обслуживанием и закрытием счета условного хранения (эскроу) применяются положения параграфа 1 этой главы, если другое не установлено этим параграфом и не вытекает из содержания правоотношений между банком, владельцем счета и бенефициаром.

Статья 1076-2. Операции по счету условного хранения (эскроу)
1. По счету условного хранения (эскроу) выполняются исключительно операции по зачислению полученных банком от владельца счета и/или от третьих лиц денежных средств, которые при наступлении оснований, определенных договором счета условного хранения (эскроу), предназначенные для перечисления бенефициару, а также операции по перечислению таких средств бенефициару или возврату их владельцу счета в соответствии с условиями договора счета условного хранения (эскроу). В случаях, установленных статьей 1076-6 настоящего Кодекса, по счету условного хранения (эскроу) также выполняются операции, связанные с обращением взыскания на имущественные права на денежные средства, находящиеся на счете условного хранения (эскроу), или права требования владельца счета или бенефициара в банке на основании договора счета условного хранения (эскроу).

2. Зачисление денежных средств на счет условного хранения (эскроу) осуществляется единовременно или периодически в порядке, установленном договором счета условного хранения (эскроу).

3. При наступлении оснований, предусмотренных договором счета условного хранения (эскроу), банк обязан в установленный договором срок (при его отсутствии - в течение пяти рабочих дней со дня наступления соответствующих оснований) перечислить сумму, находящуюся на счету условного хранения (эскроу), бенефициару. Договор счета условного хранения (эскроу) может предусматривать перечисление бенефициару суммы, находящейся на счету условного хранения (эскроу), частями в зависимости от наступления указанных в договоре оснований.

4. Договор счета условного хранения (эскроу) может предусматривать основания, при наступлении которых вся сумма, находящаяся на счету условного хранения (эскроу), или ее часть подлежит возврату владельцу счета.

Статья 1076-3. Проверка оснований для перечисления денежных средств со счета условного хранения (эскроу)
1. В случае если договор счета условного хранения (эскроу) предусматривает предоставление банку документов, подтверждающих наступление оснований для перечисления бенефициару или указанному им лицу денежных средств, находящихся на счету условного хранения (эскроу), или возврата таких средств владельцу счета, банк проверяет такие документы на соответствие условиям договора счета условного хранения (эскроу) исключительно по внешним признакам, если иное не предусмотрено законом или договором счета условного хранения (эскроу).

2. Если банк считает, что представленные лицом документы не отвечают условиям договора счета условного хранения (эскроу) по внешним признакам или иным требованиям, установленным договором счета условного хранения (эскроу), банк обязан отказать получателю в перечислении денежных средств с предоставлением письменного уведомления с указанием причин отказа в течение пяти рабочих дней со дня получения документов для перечисления денежных средств, находящихся на счету условного хранения (эскроу), если иное не предусмотрено договором счета условного хранения (эскроу).

3. Договором счета условного хранения (эскроу) на банк может быть возложена обязанность по проверке наступления оснований для перечисления денежных средств бенефициару или указанному им лицу или для возврата средств владельцу счета.

4. Договором счета условного хранения (эскроу) обязанность по проверке наступления оснований для перечисления денежных средств бенефициару или возврат средств владельцу счета может быть возложено на любое третье лицо, указанное в договоре. Договором устанавливаются порядок, обстоятельства и условия предоставления банку таким третьим лицом информации о наступлении условий для перечисления средств.

Статья 1076-4. Ограничения относительно распоряжения средствами на счете условного хранения (эскроу)
1. Если иное не предусмотрено договором счета условного хранения (эскроу), ни владелец счета, ни бенефициар не вправе распоряжаться денежными средствами, находящимися на счете условного хранения (эскроу).

2. В случае если договором счета условного хранения (эскроу) предусмотрена возможность распоряжения денежными средствами на счете владельцем счета или бенефициаром, стороны договора счета условного хранения (эскроу) могут установить в договоре ограничения относительно такого распоряжения.

Статья 1076-5. Вознаграждение банку по договору счета условного хранения (эскроу)
1. Договором счета условного хранения (эскроу) может предусматриваться вознаграждение банка за услуги, связанные с обслуживанием счета и совершением операций по ним.

2. Вознаграждение банка удерживается из денежных средств, находящихся на счету условного хранения (эскроу), если иное не предусмотрено договором счета условного хранения (эскроу).

Статья 1076-6. Статус денежных средств на счете условного хранения (эскроу)
1. Обращение взыскания и (или) наложение ареста на денежные средства, находящиеся на счете условного хранения (эскроу), по обязательствам банка, в котором открыт счет (в том числе в случае его ликвидации), не допускается, кроме суммы денежных средств на счете, которую банк имеет право удержать в качестве вознаграждения по состоянию на дату обращения взыскания или наложения ареста в соответствии с договором счета условного хранения (эскроу).

2. Обращение взыскания и/или наложения ареста на денежные средства, находящиеся на счете условного хранения (эскроу), по обязательствам владельца счета или бенефициара (в том числе в случае их ликвидации) не допускается. При этом допускается обращение взыскания и/или наложения ареста на право требования владельца счета или бенефициара в банке на основании договора счета условного хранения (эскроу), в том числе на право требования выплаты денежных средств (или их части), находящиеся на счете условного хранения (эскроу), при наступлении оснований, установленных договором счета условного хранения (эскроу).

Статья 1076-7. Внесение изменений в договора счета условного хранения (эскроу)
1. Любые изменения в договор счета условного хранения (эскроу), кроме указанных в части второй настоящей статьи, вносятся исключительно при условии предоставления письменного согласия на такие изменения бенефициаром независимо от того, является ли бенефициар стороной договора счета условного хранения (эскроу).

2. Если бенефициар не является стороной договора счета условного хранения (эскроу), без его согласия в такой договор вносятся изменения, которые не ограничивают права бенефициара, возникающие на основании договора счета условного хранения (эскроу). В случае возникновения спора обязанность доказывания того, что соответствующие изменения в договоре счета условного хранения (эскроу) не ограничивают права бенефициара, возлагается на банк.

3. Сделки по внесению изменений в договора счета условного хранения (эскроу), совершенные с нарушением требований настоящей статьи, являются ничтожными.

Статья 1076-8. Прекращение договора счета условного хранения (эскроу) и закрытия счета условного хранения (эскроу)
1. Договор счета условного хранения (эскроу) прекращается после окончания срока (наступления срока прекращения) договора счета условного хранения (эскроу) или при наступлении других обстоятельств, установленных договором счета условного хранения (эскроу).

2. Договор счета условного хранения (эскроу) прекращается в случае ликвидации банка, в котором открыт счет условного хранения (эскроу).

3. Расторжение договора счета условного хранения (эскроу) допускается в любое время по заявлению владельца счета и исключительно при условии получения письменного согласия бенефициара на расторжение договора. Договор считается расторгнутым с момента получения банком последнего из следующих документов: заявления владельца счета и письменного согласия бенефициара на расторжение договора, а если заявление владельца счета и письменное согласие бенефициара содержатся в одном документе - с момента получения банком такого документа.

4. В случае прекращения или расторжения договора счета условного хранения (эскроу) банк закрывает счет условного хранения (эскроу), а денежные средства, находящиеся на счете, возвращает владельцу счета, а при наступлении на момент прекращения или расторжения договора оснований, указанных в договоре счета условного хранения (эскроу), такие средства (или их часть, если это предусмотрено договором) перечисляются бенефициару или указанному им лицу.

В случае расторжения договора счета условного хранения (эскроу) по заявлению владельца счета и письменного согласия бенефициара владелец счета и бенефициар могут совместно указать в соответствующем заявлении и письменном согласии, что денежные средства (или их часть) перечисляются владельцу счета и/или бенефициару или указанному им лицу независимо от наступления оснований, установленных договором счета условного хранения (эскроу).

5. Положения статьи 1075 настоящего Кодекса не применяются к договору счета условного хранения (эскроу)
"""
GKU_g_73 = """ 
Глава 73 - Гражданского кодекса
Факторинг

Статья 1077. Понятие договора факторинга
1. По договору факторинга (финансирование под уступку права денежного требования) одна сторона (фактор) передает или обязуется передать денежные средства в распоряжение второй стороны (клиента) за плату (в любое предусмотренное договором способ), а клиент уступает или обязуется уступить фактору свое право денежного требования к третьему лицу (должнику).

Клиент может уступить фактору свое денежное требование к должнику с целью обеспечения выполнения обязательства клиента перед фактором.

2. Обязательство фактора по договору факторинга может предусматривать предоставление клиенту услуг, связанных с денежным требованием, право которого он уступает.

Статья 1078. Предмет договора факторинга
1. Предметом договора факторинга может быть право денежного требования, срок платежа за который наступил (имеющееся требование), а также право требования, которое возникнет в будущем (будущее требование).

2. Будущее требование считается переданным фактору со дня возникновения права требования к должнику. Если передача права денежного требования обусловлена определенным событием, оно считается переданным с момента наступления этого события.

В этих случаях дополнительное оформление уступки права денежного требования не требуется.

Статья 1079. Стороны в договоре факторинга
1. Сторонами в договоре факторинга является фактор и клиент.

2. Клиентом в договоре факторинга может быть физическое или юридическое лицо, являющееся субъектом предпринимательской деятельности.

3. Фактором может быть банк или другое финансовое учреждение, соответствии с законом имеет право осуществлять факторинговые операции.

Статья 1080. Недействительность запрета уступку права денежного требования
1. Договор факторинга являются действительным независимо от наличия договоренности между клиентом и должником о запрете уступки права денежного требования или его ограничения.

В этом случае клиент не освобождается от обязательств или ответственности перед должником в связи с нарушением клиентом условия о запрете или ограничении уступки права денежного требования.

Статья 1081. Ответственность клиента перед фактором
1. Клиент отвечает перед фактором за действительность денежного требования, право которго уступается, если другое не установлено договором факторинга.

2. Денежное требование, право которого уступается, соответствует действительности, если клиент имеет право уступить право денежного требования и в момент уступки этого требования ему не были известны обстоятельства, вследствие которых должник имеет право не выполнять требование.

3. Клиент не отвечает за невыполнение или ненадлежащее выполнение должником денежного требования, право которго уступается и которое предъявлено к выполнению фактором, если другое не установлено договором факторинга.

Статья 1082. Выполнение должником денежного требования фактору
1. Должник обязан произвести платеж фактору при условии, что он получил от клиента или фактора письменное сообщение про уступку права денежного требования фактору и в этом сообщении определено денежное требование, которое подлежит выполнению, а также назван фактор, которому может быть осуществлен платеж.

2. Должник имеет право требовать от фактора предоставления ему в разумный срок доказательств того, что уступка права денежного требования фактору в самом деле имела место. Если фактор не выполнит этой обязанности, должник имеет право произвести платеж клиенту для выполнение своей обязанности перед ним.

3. Выполнение должником денежного требования фактору согласно этой статье освобождает должника от его обязанности перед клиентом.

Статья 1083. Последующая уступка права денежного требования
1. Последующая уступка фактором права денежного требования третьему лицу не допускается, если другое не установлено договором факторинга.

2. Если договором факторинга допускается последующая уступка права денежного требования, она осуществляется согласно положениям этой главы.

Статья 1084. Права фактора
1. Если согласно условиям договора факторинга финансирование клиента осуществляется путем покупки у него фактором права денежного требования, фактор приобретает право на все суммы, которые он получит от должника на выполнение требования, а клиент не отвечает перед фактором, если полученные им суммы являются меньшими чем суммы, уплаченные фактором клиенту

2. Если уступка права денежного требования фактору осуществляется с целью обеспечения выполнения обязательств клиента перед фактором, фактор обязан предоставить клиенту отчет и передать сумму, которая превышает сумму долга клиента, который обеспечен уступкой права денежного требования, если другое не установлено договором факторинга.

Если сумма, полученная фактором от должника, оказалась меньше суммы долга клиента перед фактором, который обеспечен уступкой права требования, клиент обязан уплатить фактору остаток долга.

Статья 1085. Встречные требования должника
1. Если фактор предъявил должнику требование произвести платеж, должник имеет право предъявить до зачета свои денежные требования, которые основываются на договоре должника с клиентом, которые возникли у должника до момента, когда он получил сообщение про уступку права денежного требования фактору.

2. Должник не может предъявить фактору требования к клиенту в связи с нарушением им условия о запрете или ограничении уступки права денежного требования.

Статья 1086. Защита прав должника
1. В случае нарушения клиентом своих обязанностей по договору, заключенным с должником, должник не имеет права требовать от фактора возвращения сумм, уже уплаченных ему по уступленному денежному требованию, если должник имеет право получить эти суммы непосредственно от клиента.

2. Должник, который имеет право получить непосредственно от клиента суммы, уплаченные фактору по уступленному денежному требованию, имеет право требовать возвращения этих сумм фактором, если фактор не выполнил своего обязательства передать клиенту денежные средства, связанные с уступкой права денежного требования, или перадав клиенту денежные средства, зная о нарушении клиентом обязательств перед должником, связанных с уступкой права денежного требования.
"""
GKU_g_74 = """ 
Глава 74 - Гражданского кодекса
Расчеты

Параграф 1. Общие положения о расчетах

Статья 1087. Формы расчетов
1. Расчеты с участием физических лиц, не связанные с осуществлением ими предпринимательской деятельности, могут вестись в наличной или в безналичной форме с помощью расчетных документов в электронном или бумажном виде.

2. Расчеты между юридическими лицами, а также расчеты с участием физических лиц, связанные с осуществлением ими предпринимательской деятельности, ведутся в безналичной форме. Расчеты между этими лицами могут вестись также денежной наличностью, если другое не установлены законом.

3. Предельные суммы расчетов наличными для физических и юридических лиц, а также для физических лиц - предпринимателей в соответствии с настоящей статьей устанавливаются Национальным банком Украины.

Статья 1088. Виды безналичных расчетов
1. При осуществлении безналичных расчетов допускаются расчеты с применением платежных поручений, аккредитивов, расчетных чеков (чеков), расчеты за инкассо, а также другие расчеты, предусмотренные законом, банковскими правилами и обычаями делового оборота.

2. Стороны в договоре имеют право избрать любой вид безналичных расчетов на свое усмотрение.

3. Безналичные расчеты ведутся через банки, другие финансовые учреждения (далее - банки), в которых открыты соответствующие счета, если другое не вытекает из закона и не обусловлено видом безналичных расчетов.

4. Порядок осуществления безналичных расчетов регулируется этим Кодексом, законом и банковскими правилами.

Параграф 2. Расчеты с применением платежных поручений

Статья 1089. Общие положения о расчетах с применением платежных поручений
1. По платежному поручению банк обязуется по доверенности плательщика за счет денежных средств, размещенных на его счету в этом банке, перевести определенную денежную сумму на счет определенного плательщиком лица (получателя) в этом или в другом банке в срок, установленный законом или банковскими правилами, если другой срок не предусмотрен договором или обычаями делового оборота.

2. Положения этого параграфа применяются также к отношениям, связанным с перечислением денежных средств через банк лицом, которое не имеет счета в этом банке, если другое не установлено законом, банковскими правилами или не вытекает из сути отношений.

Статья 1090. Условия выполнения банком платежного поручения
1. Содержание и форма платежного поручения и расчетных документов, которые подаются вместе с ним, должны отвечать требованиям, установленным законом и банковскими правилами.

2. Банк не имеет права делать исправления в платежном поручении клиента, если другое не установлено законом или банковскими правилами.

3. Платежное поручение плательщика принимается банком к выполнению при условии, что сумма платежного поручения не превышает суммы денежных средств на счету плательщика, если другое не установлено договором между плательщиком и банком.

Статья 1091. Выполнение платежного поручения
1. Банк, который принял платежное поручение плательщика, должен пересчитать соответствующую денежную сумму банку получателя для ее зачисления на счет лица, определенного в платежном поручении.

2. Банк имеет право привлечь другой банк (исполняющий банк) для выполнения перевода денежных средств на счет, определенный в поручении клиента.

3. Банк должен немедленно информировать плательщика по его требованию о выполнении платежного поручения. Порядок оформления и требования к содержанию сообщения о выполнении банком платежного поручения устанавливаются законом, банковскими правилами или договором между банком и плательщиком.

Статья 1092. Ответственность за невыполнение или ненадлежащее выполнение платежного поручения
1. В случае невыполнения или ненадлежащего выполнения платежного поручения клиента банк несет ответственность согласно этого Кодекса и закона.

2. В случае невыполнения или ненадлежащего выполнения платежного поручения в связи с нарушением правил расчетных операций исполняющим банком ответственность может быть возложена судом на этот банк.

3. Если нарушение банком правил расчетных операций послужило причиной ошибочного перевода банком денежных средств, банк несет ответственность согласно Гражданскому кодексу Украины и закона.

Параграф 3. Расчеты по аккредитиву

Статья 1093. Аккредитив
1. В случае расчетов по аккредитиву банк (банк-эмитент) по доверенности клиента (плательщика) - заявителя аккредитива и согласно его указаниям или от своего имени обязуется провести платеж на условиях, определенных аккредитивом, или поручает другому (исполняющему) банку произвести этот платеж в пользу получателя денежных средств или определенного им лица - бенефициара.

2. В случае открытия покрытого аккредитива при его открытии бронируются денежные средства плательщика на отдельном счету в банке-эмитенте или исполняющем банке.

В случае открытия непокрытого аккредитива банк-эмитент гарантирует оплату по аккредитиву при временном отсутствии средств на счете плательщика за счет банковского кредита.

Статья 1094. Отзывной аккредитив
1. Отзывной аккредитив может быть изменен или аннулирован банком-эмитентом в любое время без предшествующего сообщения получателя денежных средств. Отзыв аккредитива не создает обязательств банка-эмитента перед получателем денежных средств.

2. Исполняющий банк должен произвести платеж или другие операции по отзывному аккредитиву, если до моменту их осуществления им не получены сообщения об изменении условий или аннулирования аккредитива.

Статья 1095. Безотзывный аккредитив
1. Безотзывный аккредитив может быть аннулирован или его условия могут быть изменены лишь по согласию на это получателя денежных средств.

2. По просьбе банка-эмитента исполняющий банк может подтвердить безотзывный аккредитив путем принятия дополнительно к обязательству банка-эмитента обязательство провести платеж согласно условиям аккредитива.

Безотзывный аккредитив, подтвержденный исполняющим банком, не может быть изменен или аннулирован без согласия исполняющего банка.

Статья 1096. Выполнение аккредитива
1. Для выполнения аккредитива получатель денежных средств подает в исполняющий банк документы, которые предусмотрены условиями аккредитива, подтверждающие выполнение всех условий аккредитива.

В случае нарушения хотя бы одного из этих условий выполнение аккредитива не производится.

2. Если исполняющий банк отвечает отказом в принятии документов, которые по внешним признакам не отвечают условиям аккредитива, он должен немедленно сообщить об этом получателю денежных средств и банк-эмитент с определением причин отказа.

3. Если банк-эмитент, получив принятые исполняющим банком документы, считает, что они не отвечают по внешним признакам условиям аккредитива, он имеет право отказаться от их принятия и требовать от исполняющего банка сумму, уплаченную получателю денежных средств с нарушением условий аккредитива.

Статья 1097. Ответственность банка, который выполняет аккредитив
1. В случае необоснованного отказа в выплате или неправильной выплаты денежных средств по аккредитиву вследствие нарушения исполняющим банком условий аккредитива исполняющий банк несет ответственность перед банком-эмитентом.

В случае нарушения исполняющим банком условий покрытого аккредитива или подтвержденного им безотзывного аккредитива ответственность перед плательщиком может быть по решению суда возложена на исполняющий банк.

Статья 1098. Закрытие аккредитива
1. Аккредитив закрывается в случае:

истечения срока действия аккредитива;
отказа получателя денежных средств от использования аккредитива до истечения срока его действия, если это предусмотрено условиями аккредитива;
полный или частичный отзыв аккредитива плательщиком, если такой отзыв предусмотрен условиями аккредитива.
О закрытии аккредитива исполняющий банк уведомляет банк-эмитент.

2. Исполняющий банк одновременно с закрытием аккредитива немедленно возвращает банку-эмитенту неиспользованную сумму покрытого аккредитива. Банк-эмитент должен зачислить возвращенные суммы на счет плательщика.

Параграф 4. Расчеты по инкассовым поручениям

Статья 1099. Общие положения о расчетах инкассовыми поручениями
1. В случае расчетов инкассовыми поручениями (инкассо) банк (банк-эмитент) по доверенности клиента осуществляет за счет клиента действия относительно получения от плательщика платежа и (или) акцепта платежа.

2. Банк-эмитент, который получил инкассовое поручение, имеет право привлекать для его выполнения другой банк (исполняющий банк).

Случаи применения и порядок осуществления расчетов инкассовыми поручениями устанавливаются законом, банковскими правилами и обычаями делового оборота.

Статья 1100. Выполнение инкассового поручения
1. В случае отсутствия любого документа или несоответствия документов по внешним признакам инкассовому поручению исполняющий банк должен немедленно уведомить об этом клиента. В случае неустранения указанных недостатков банк возвращает документы без выполнения.

2. Документы подаются плательщику в той форме, в которой они получены, за исключением банковских отметок и надписей, необходимых для оформления инкассовой операции.

3. Документы, которые подлежат оплате при их подаче, исполняющий банк обязан подать в платеж немедленно с получением инкассового поручения.

Если документы подлежат оплате в другой срок, исполняющий банк должен для получения акцепта плательщика подать документы для акцепта одновременно с получением инкассового поручения, а требование платежа может осуществить не позднее чем в день наступления срока платежа, определенного в документе.

4. Частичные платежи могут быть приняты в случаях, если это установлено банковскими правилами, или при наличии в инкассовом поручении специального разрешения.

5. Полученные (инкассированные) суммы немедленно передаются исполняющим банком в распоряжение банка-эмитента, который должен зачислить эти суммы на счет клиента. Исполняющий банк имеет право отсчитать из инкассированных сумм надлежащую ему плату и возмещение затрат и (или) расходов.

Статья 1101. Сообщение о проведенных операциях
1. Если платеж и (или) акцепт не были получены, исполняющий банк должен немедленно уведомить банк-эмитент о причинах неплатежа или отказа от акцепта. Банк-эмитент должен немедленно уведомить об этом клиента, спросив у него указания относительно дальнейших действий.

В случае неполучения указаний относительно дальнейших действий в срок, установленный банковскими правилами, а если он не установлен, - в разумный срок, исполняющий банк имеет право возвратить документы банку-эмитенту.

Параграф 5. Расчеты с применением расчетных чеков

Статья 1102. Общие положения о расчетах с применением расчетных чеков
1. Расчетным чеком (чеком) является документ, который содержит ничем не обусловленное письменное распоряжение собственника счета (чекодателя) банка перевести указанную в чеке денежную сумму получателю (чекодержателю).

2. Плательщиком по чеку может быть лишь банк, в котором чекодатель имеет денежные средства на счету, которыми он может распоряжаться.

3. Отзыв чека до истечения срока для его подачи не допускается.

4. Выдача чека не погашает денежного обязательства, на выполнение которого он выдан.

5. Порядок и условия использования чеков устанавливаются этим Кодексом, законом и банковскими правилами.

6. Чек может содержать все реквизиты, предусмотренные банковскими правилами. Чек, в котором отсутствует любой из реквизитов или в который внесены исправления, является недействительным.

7. Форма чека и порядок его заполнения устанавливаются законом и банковскими правилами.

Статья 1103. Оплата чека
1. Чек оплачивается за счет денежных средств чекодателя. Порядок и условия бронирования денежных средств на счету для расчетов с применением чеков устанавливаются банковскими правилами.

2. Чек подлежит оплате плательщиком по чеку при условии представления его к оплате в срок, установленный банковскими правилами.

3. Плательщик по чеку должен убедиться всеми возможными способами в подлинности чека, а также в том, что предъявитель чека является уполномоченным лицом.

4. Убытки, причиненные в связи с оплатой подделанного, похищенного или утраченного чека, возлагаются на плательщика по чеку или чекодателя - в зависимости от того, по чьей вине они были причинены.

Статья 1104. Инкассация чека
1. Подача чека в банк чекодержателя на инкассо для получения платежа считается подачей чека к платежу.

Оплата чека ведется в порядке, установленном статьей 1100 Гражданского кодекса Украины.

2. Зачисление средств инкассированным чеком на счет чекодержателя ведется после получения платежа от плательщика, если другое не предусмотрено договором между чекодержателем и банком.

Статья 1105. Сообщение о неуплате чека
1. Чекодержатель должен уведомить чекодателя о неплатеже на протяжении двух рабочих дней, следующих за днем совершения протеста или равнозначного акта.

2. Лицо, которое не прислало сообщения в указанный срок, не теряет своих прав. Оно возмещает убытки, которые могут произойти вследствие неуведомления о неуплате чека. Размер возмещенных убытков не может превышать суммы чека.

Статья 1106. Последствия неуплаты чека
1. В случае отказа плательщика в оплате чека чекодержатель имеет право предъявить иск в суд. Чекодержатель имеет право требовать кроме оплаты суммы чека возмещения своих затрат на получение оплаты, а также процентов.

2. К требованиям чекодержателя об оплате чека применяется исковая давность в один год.
"""
GKU_g_75 = """ 
Глава 75 - Гражданского кодекса
Распоряжение имущественными правами интеллектуальной собственности

Статья 1107. Виды договоров относительно распоряжения имущественными правами интеллектуальной собственности
1. Распоряжение имущественными правами интеллектуальной собственности осуществляется на основании таких договоров:

лицензия на использование объекта права интеллектуальной собственности;
лицензионный договор;
договор о создании по заказу и использования объекта права интеллектуальной собственности;
договор о передаче исключительных имущественных прав интеллектуальной собственности;
другой договор относительно распоряжения имущественными правами интеллектуальной собственности.
2. Договор относительно распоряжения имущественными правами интеллектуальной собственности составляется в письменной форме.

В случае несоблюдения письменной формы договора относительно распоряжения имущественными правами интеллектуальной собственности такой договор является ничтожным.

Законом могут быть установлены случаи, в которых договор относительно распоряжения имущественными правами интеллектуальной собственности может составляться устно.

Статья 1108. Лицензия на использование объекта права интеллектуальной собственности
1. Лицо, имеющее исключительное право разрешать использование объекта права интеллектуальной собственности (лицензиар), может предоставить другому лицу (лицензиату) письменное полномочие, которое предоставляет ему право на использование этого объекта в определенной ограниченной сфере (лицензия на использование объекта права интеллектуальной собственности).

2. Лицензия на использование объекта права интеллектуальной собственности может быть оформлена как отдельный документ или быть составной частью лицензионного договора.

3. Лицензия на использование объекта права интеллектуальной собственности может быть исключительной, единичной, неисключительной, а также другого вида, который не противоречит закону.

Исключительная лицензия выдается лишь одному лицензиату и выключает возможность использования лицензиаром объекта права интеллектуальной собственности в сфере, которая ограничена этой лицензией, и выдачу им другим лицам лицензий на использование этого объекта в указанной сфере.

Единичная лицензия выдается лишь одному лицензиату и исключает возможность выдачи лицензиаром другим лицам лицензий на использование объекта права интеллектуальной собственности в сфере, ограниченной этой лицензией, но не исключает возможности использования лицензиаром этого объекта в указанной сфере.

Неисключительная лицензия не исключает возможности использования лицензиаром объекта права интеллектуальной собственности в сфере, ограниченной этой лицензией, и выдачи им другим лицам лицензий на использование этого объекта в указанной сфере.

4. По согласию лицензиара, предоставленному в письменной форме, лицензиат может выдать письменное полномочие на использование объекта права интеллектуальной собственности другому лицу (сублицензию).

Статья 1109. Лицензионный договор
1. По лицензионному договору одна сторона (лицензиар) предоставляет второй стороне (лицензиату) разрешение на использование объекта права интеллектуальной собственности (лицензию) на условиях, определенных по взаимному согласию сторон с учетом требований Гражданского кодекса Украины и другого закона.

2. В случаях, предусмотренных лицензионным договором, может быть заключен сублицензионный договор, за которым лицензиат предоставляет другому лицу (сублицензиату) сублицензию на использование объекта права интеллектуальной собственности. В этом случае ответственность перед лицензиаром за действия сублицензиата несет лицензиат, если другое не установлено лицензионным договором.

3. В лицензионном договоре определяются вид лицензии, сфера использования объекта права интеллектуальной собственности (конкретные права, которые предоставляются по договору, способы использования указанного объекта, территория и срок, на которые предоставляются права, и т.п.), размер, порядок и сроки выплаты платы за использование объекта права интеллектуальной собственности, а также другие условия, которые стороны считают целесообразным включить в договор.

4. Считается, что по лицензионному договору предоставляется неисключительная лицензия, если другое не установлено лицензионным договором.

5. Предметом лицензионного договора не могут быть права на использование объекта права интеллектуальной собственности, которые на момент заключения договора не были действующими.

6. Права на использование объекта права интеллектуальной собственности и способы его использования, которые не определены в лицензионном договоре, считаются не предоставленными лицензиату.

7. В случае отсутствия в лицензионном договоре условия о территории, на которую распространяются предоставленные права на использование объекта права интеллектуальной собственности, действие лицензии распространяется на территорию Украины.

8. Если в лицензионном договоре об издании или другом воспроизведении произведения вознаграждение определяется в виде фиксированной денежной суммы, то в договоре может быть установлен максимальный тираж произведения.

9. Условия лицензионного договора, которые противоречат положениям Гражданского кодекса Украины, являются ничтожными.

Статья 1110. Срок лицензионного договора
1. Лицензионный договор заключается на срок, установленный договором, который должен истекать не более позднее истечения срока действия исключительного имущественного права на определенный в договоре объект права интеллектуальной собственности.

2. Лицензиар может отказаться от лицензионного договора в случае нарушения лицензиатом установленного договором срока начала использования объекта права интеллектуальной собственности. Лицензиар или лицензиат могут отказаться от лицензионного договора в случае нарушения второй стороной других условий договора.

3. В случае отсутствия в лицензионном договоре условия о сроке договора он считается заключенным на срок, который остался до истечения срока действия исключительного имущественного права на определенный в договоре объект права интеллектуальной собственности, но не более чем на пять лет. Если за шесть месяцев до истечения указанного пятилетнего срока ни одна из сторон не сообщит письменно другой стороне об отказе от договора, договор считается продленным на неопределенное время. В этом случае любая из сторон может в любое время отказаться от договора, письменно сообщив об этом другой стороне за шесть месяцев до разрыва договора, если больший срок для сообщения не установлен по договоренности сторон.

Статья 1111. Типовой лицензионный договор
1. Уполномоченные ведомства или творческие союзы могут утверждать типовые лицензионные договора.

2. Лицензионный договор может содержать условия, не предусмотренные типовым лицензионным договором. Условия лицензионного договора, заключенного с создателем объекта права интеллектуальной собственности, которые ухудшают его положение сравнительно с положением, предусмотренным законом или типовым договором, являются ничтожными и заменяются условиями, установленными типовым договором или законом.

Статья 1112. Договор о создании по заказу и использование объекта права интеллектуальной собственности
1. По договору о создании по заказу и использование объекта права интеллектуальной собственности одна сторона (творец - писатель, художник и т.п.) обязуется создать объект права интеллектуальной собственности согласно требованиям второй стороны (заказчика) и в установленный срок.

2. Договор о создании по заказу и использовании объекта права интеллектуальной собственности должен определять способы и условия использования этого объекта заказчиком.

3. Оригинал произведения изобразительного искусства, созданного по заказу, переходит в собственность заказчика. При этом имущественные права интеллектуальной собственности на это произведение остаются за его автором, если другое не установлено договором.

4. Условия договора о создании по заказу и использовании объекта права интеллектуальной собственности, которые ограничивают право творца этого объекта на создание других объектов, являются ничтожными.

Статья 1113. Договор о передаче исключительных имущественных прав интеллектуальной собственности
1. По договору о передаче исключительных имущественных прав интеллектуальной собственности одна сторона (лицо, которое имеет исключительные имущественные права) передает второй стороне частично или в полном составе эти права согласно закону и на определенных договором условиях.

2. Заключение договора о передаче исключительных имущественных прав интеллектуальной собственности не влияет на лицензионные договора, которые были заключены ранее.

3. Условия договора о передаче исключительных имущественных прав интеллектуальной собственности, которые ухудшают положение творца соответствующего объекта или его наследников сравнительно с положениями, предусмотренными Гражданским кодексом Украины и другим законом, а также ограничивают право творца на создание других объектов, являются ничтожными.

Статья 1114. Государственная регистрация договоров относительно распоряжения имущественными правами интеллектуальной собственности
1. Лицензия на использование объекта права интеллектуальной собственности и договора, определенные статьями 1109, 1112 и 1113 Гражданского кодекса Украины, не подлежат обязательной государственной регистрации.

Их государственная регистрация осуществляется по требованию лицензиара или лицензиата в порядке, установленном законом.

Отсутствие государственной регистрации не влияет на действие прав, предоставленных по лицензией или другим договором, и других прав на соответствующий объект права интеллектуальной собственности, в частности на право лицензиата на обращение в суд за защитой своего права.

2. Факт передачи исключительных имущественных прав интеллектуальной собственности, которые согласно Гражданскому кодексу Украины или другого закона являются действующими после их государственной регистрации, подлежит государственной регистрации.
"""
GKU_g_76 = """ 
Глава 76 - Гражданского кодекса
Коммерческая концессия

Статья 1115. Договор коммерческой концессии
1. По договору коммерческой концессии одна сторона (правообладатель) обязуется предоставить другой стороне (пользователю) за плату право пользования в соответствии с ее требованиями комплексом принадлежащих этой стороне прав с целью изготовления и (или) продажи определенного вида товара и (или) оказания услуг.

Отношения, связанные с предоставлением права пользования комплексом прав, регулируются Гражданским кодексом Украины  и другим законом.

Статья 1116. Предмет договора коммерческой концессии
1. Предметом договора коммерческой концессии является право на использование объектов права интеллектуальной собственности (торговых марок, промышленных образцов, изобретений, произведений, коммерческих тайн и т.п.), коммерческого опыта и деловой репутации.

2. Договором коммерческой концессии может быть предусмотрено использования предмета договора с указанием или без указания территории использования относительно определенной сферы гражданского оборота.

Статья 1117. Стороны в договоре коммерческой концессии
1. Сторонами в договоре коммерческой концессии могут быть физические и юридические лица, которые являются субъектами предпринимательской деятельности.

Статья 1118. Форма договора коммерческой концессии и его государственная регистрация
1. Договор коммерческой концессии заключается в письменной форме. В случае несоблюдения письменной формы договора концессии такой договор является ничтожным.

2. Договор коммерческой концессии подлежит государственной регистрации органом, осуществившим государственную регистрацию правообладателя.

3. Если правообладатель зарегистрирован в иностранном государстве, регистрация договора коммерческой концессии осуществляется органом, осуществившим государственную регистрацию пользователя.

4. В отношениях с третьими лицами стороны договора коммерческой концессии имеют право ссылаться на договор коммерческой концессии лишь с момента его государственной регистрации.

Статья 1119. Договор коммерческой субконцессии
1. В случаях, предусмотренных договором коммерческой концессии, пользователь может заключить договор коммерческой субконцессии, по которому он предоставляет другому лицу (субпользователю) право пользования предоставленным ему правообладателем комплексом прав или частью комплекса прав на условиях, согласованных с правообладателем или определенных договором коммерческой концессии.

2. К договору коммерческой субконцессии применяются положения о договоре коммерческой концессии, установленные настоящим Кодексом или другим законом, если иное не вытекает из особенностей субконцессии.

3. Пользователь и субпользователь отвечают перед правообладателем за причиненный ему ущерб солидарно.

4. Признание недействительным договора коммерческой концессии имеет следствием недействительность договора коммерческой субконцессии.

Статья 1120. Обязанности правообладателя
1. Правообладатель обязан передать пользователю техническую и коммерческую документацию и предоставить другую информацию, необходимую для осуществления прав, предоставленных ему по договору коммерческой концессии, а также проинформировать пользователя и его работников по вопросам, связанным с осуществлением этих прав.

2. Правообладатель обязан, если иное не установлено договором коммерческой концессии:

обеспечить государственную регистрацию договора;
предоставлять пользователю постоянное техническое и консультативное содействие, включая содействие в обучении и повышении квалификации работников;
контролировать качество товаров (работ, услуг), которые производятся (выполняются, предоставляются) пользователем на основании договора коммерческой концессии.
Статья 1121. Обязанности пользователя
1. С учетом характера и особенностей деятельности, осуществляемой пользователем по договору коммерческой концессии, пользователь обязан:

использовать торговую марку и другие обозначения правообладателя определенным в договоре способом;
обеспечить соответствие качества товаров (работ, услуг), которые производятся (выполняются, предоставляются) в соответствии с договором коммерческой концессии, качеству аналогичных товаров (работ, услуг), которые производятся (выполняются, предоставляются) правообладателем;
соблюдать инструкции и указания правообладателя, направленные на обеспечение соответствия характера, способов и условий использования комплекса предоставленных прав использованию этих прав правообладателем;
предоставлять покупателям (заказчикам) дополнительные услуги, на которые они могли бы рассчитывать, приобретая (заказывая) товары (работы, услуги) непосредственно у правообладателя;
информировать покупателей (заказчиков) наиболее очевидным для них способом об использовании им товарного знака и других обозначений правообладателя по договору коммерческой концессии;
не разглашать секреты производства правообладателя, другую полученную от него конфиденциальную информацию.
Статья 1122. Особые условия договора коммерческой концессии
1. В договоре коммерческой концессии могут быть предусмотрены особые условия, в частности:

обязанность правообладателя не предоставлять другим лицам аналогичные комплексы прав для их использования на закрепленной за пользователем территории либо воздерживаться от собственной аналогичной деятельности на этой территории;
обязанность пользователя не конкурировать с правообладателем на территории, на которую распространяется действие договора, относительно предпринимательской деятельности, которую осуществляет пользователь использованием предоставленных правообладателем прав;
обязанность пользователя не получать аналогичные права от конкурентов (потенциальных конкурентов) правообладателя;
обязанность пользователя согласовывать с правообладателем место расположения помещений для продажи товаров (выполнения работ, предоставления услуг), предусмотренных договором, а также их внутреннее и внешнее оформление.
2. Условие договора, согласно которого правообладатель имеет право определять цену товара (работ, услуг), предусмотренного договором или устанавливать верхнюю или нижнюю границу этой цены, является ничтожным.

3. Условие договора, согласно которого пользователь имеет право продавать товары (выполнять работы, оказывать услуги) исключительно определенной категории покупателей (заказчиков) или исключительно покупателям (заказчикам), имеющим место нахождения (место жительства) на территории, определенной в договоре.

Статья 1123. Ответственность правообладателя по требованиям, которые предъявляются к пользователю
1. Правообладатель несет субсидиарную ответственность по требованиям, предъявляемым к пользователю в связи с несоответствием качества товаров (работ, услуг), проданных (выполненных, оказанных) пользователем.

По требованиям, предъявляемым к пользователю как производителя продукции (товаров) правообладателя, правообладатель отвечает солидарно с пользователем.

Статья 1124. Право пользователя на заключение договора коммерческой концессии на новый срок
1. Пользователь, который надлежащим образом исполнял свои обязанности, имеет право на заключение договора коммерческой концессии на новый срок на тех же условиях.

2. Законом могут быть установлены условия, при которых правообладатель может отказаться от заключения договора концессии на новый срок.

Статья 1125. Изменение договора коммерческой концессии
1. Договор коммерческой концессии может быть изменен в соответствии с положениями главы 53 Гражданского кодекса Украины.

В отношениях с третьими лицами стороны в договоре коммерческой концессии имеют право ссылаться на изменение договора лишь с момента государственной регистрации этого изменения в соответствии со статьей 1118 Гражданского кодекса Украины, если не докажут, что третье лицо знало или должно было знать об изменении договора ранее.

Статья 1126. Прекращение договора коммерческой концессии
1. Каждая из сторон в договоре коммерческой концессии, срок которого не установлен, имеет право в любое время отказаться от договора, уведомив об этом другую сторону не менее чем за шесть месяцев, если более продолжительный срок не установлен договором.

2. Расторжение договора коммерческой концессии подлежит государственной регистрации в соответствии со статьей 1118 Гражданского кодекса Украины.

3. Договор коммерческой концессии прекращается в случае:

прекращения права правообладателя на торговую марку или другое обозначение, определенное в договоре, без его замены аналогичным правом;
объявления правообладателя или пользователя несостоятельным (банкротом).
Статья 1127. Сохранение действия договора коммерческой концессии при изменении сторон
1. Переход исключительного права на объект права интеллектуальной собственности, определенный в договоре коммерческой концессии, от правообладателя к другому лицу не является основанием для изменения или расторжения договора коммерческой концессии.

2. В случае смерти правообладателя его права и обязанности по договору коммерческой концессии переходят к наследнику при условии, что он зарегистрирован или в течение шести месяцев со дня открытия наследства зарегистрируется как субъект предпринимательской деятельности или передаст свои права и обязанности лицу, имеющему право заниматься предпринимательской деятельностью.

Осуществление прав и исполнение обязанностей умершего, до перехода их в соответствии с настоящей частью к наследнику или иному лицу осуществляется лицом, которое управляет наследством и назначается в соответствии со статьей 1285 Гражданского кодекса Украины.

Статья 1128. Последствия изменения торговой марки или другого обозначения правообладателя
1. В случае изменения торговой марки или другого обозначения правообладателя, права на использование которых входят в комплекс прав, предоставленных пользователю по договору коммерческой концессии, этот договор сохраняет действие относительно нового обозначения правообладателя, если пользователь не требует расторжения договора и возмещения убытков.

В случае продолжения действия договора пользователь имеет право требовать соответствующего уменьшения надлежащей правообладателю платы.

Статья 1129. Последствия прекращения права пользования которое предоставлено по договору коммерческой концессии
1. Если в период действия договора коммерческой концессии прекратилось право, пользование которым предоставлено по этому договору, действие договора не прекращается, кроме тех его положений, касающихся права, которое прекратилось, а пользователь имеет право требовать соответствующего уменьшения надлежащей правообладателю платы, если иное не установлено договором.

В случае прекращения права правообладателя на торговую марку или другое обозначение наступают последствия, предусмотренные частью третьей статьи 1126 или статьей 1128 Гражданского кодекса Украины.
"""
GKU_g_77 = """ 
Глава 77 - Гражданского кодекса
Совместная деятельность

Параграф 1. Общие положения о совместной деятельности

Статья 1130. Договор о совместной деятельности
1. По договору о совместной деятельности стороны (участники) обязуются совместно действовать без образования юридического лица для достижения определенной цели, не противоречащей закону.

2. Совместная деятельность может осуществляться на основе объединения вкладов участников (простое общество) или без объединения вкладов участников.

Статья 1131. Форма и условия договора о совместной деятельности
1. Договор о совместной деятельности заключается в письменной форме.

2. Условия договора о совместной деятельности, в том числе координация совместных действий участников или ведение их общих дел, правовой статус выделенного для совместной деятельности имущества, покрытия расходов и убытков участников, их участие в результатах совместных действий и другие условия определяются по договоренности сторон, если иное не установлено законом об отдельных видах совместной деятельности.

Параграф 2. Простое товарищество

Статья 1132. Договор простого товарищества
1. По договору простого товарищества стороны (участники) обязуются объединить свои вклады и совместно действовать с целью получения прибыли или достижения иной цели.

Статья 1133. Вклады участников
1. Вкладом участника считается все то, что он вносит в совместную деятельность (общее имущество), в том числе денежные средства, иное имущество, профессиональные и иные знания, навыки и умения, а также деловая репутация и деловые связи.

2. Вклады участников считаются равными по стоимости, если иное не вытекает из договора простого товарищества или фактических обстоятельств. Денежная оценка вклада участника производится по согласованию между участниками.

Статья 1134. Общее имущество участников
1. Внесенное участниками имущество, которым они владели на правах собственности, а также произведенная в результате совместной деятельности продукция и полученные от такой деятельности плоды и доходы находятся в общей долевой собственности участников, если иное не установлено договором простого товарищества или законом.

Внесенное участниками имущество, которым они владели на основаниях иных, чем право собственности, используется в интересах всех учасникив и является их общим имуществом.

2. Ведение бухгалтерского учета общего имущества участников может быть поручено ими одному из участников.

3. Пользование общим имуществом участников осуществляется по их общему согласию, а в случае недостижения согласия - в порядке, устанавлеваемым по решению суда.

4. Обязанности участников по содержанию общего имущества и порядок возмещения расходов, связанных с выполнением этих обязанностей, устанавливаются договором простого товарищества.

Статья 1135. Ведение общих дел участников
1. При ведении общих дел каждый участник имеет право действовать от имени всех участников, если договором простого товарищества не установлено, что ведение дел осуществляется отдельными учасниками или совместно всеми участниками договора простого товарищества.

При совместном ведении дел для совершения каждой сделки требуется согласие всех участников.

2. В отношениях с третьими лицами полномочия участника совершать сделки от имени всех участников удостоверяется доверенностью, выданной ему другими участниками, или договором простого общества.

3. В отношениях с третьими лицами участники не могут ссылаться на ограничение прав участника, совершившего сделку, по ведению общих дел участников, кроме случаев, когда они докажут, что на момент совершения сделки третье лицо знало или могло знать о наличии таких ограничений.

4. Участник, совершивший от имени всех участников сделку, в отношении которого его право на ведение общих дел участников было ограничено, или совершил в интересах всех участников сделку от своего имени, может требовать возмещения произведенных им за свой счет расходов, если совершение этой сделки было необходимо в интересах всех участников. Участники, которым в результате таких сделок были нанесены убытки, вправе требовать их возмещения.

5. Решение относительно общих дел участников принимаются участниками по общему согласию, если иное не установлено договором простого общества.

Статья 1136. Право участника на информацию
1. Каждый участник договора простого товарищества вправе знакомиться со всеми документами по ведению общих дел участников. Отказ от этого права или его ограничение, в том числе по согласованию участников, ничтожны.

Статья 1137. Общие расходы и убытки участников
1. Порядок возмещения расходов и убытков, связанных с совместной деятельностью участников, определяется по договоренности между ними. При отсутствии такой договоренности каждый участник несет расходы и убытки пропорционально стоимости его вклада в совместное имущество.

Условие, по которому участник полностью освобождается от участия в возмещении общих расходов или убытков, ничтожно.

Статья 1138. Ответственность участников по общим обязательствам
1. Если договор простого товарищества не связан с осуществлением его участниками предпринимательской деятельности, каждый участник отвечает по общим договорным обязательствам всем своим имуществом пропорционально стоимости его вклада в общее имущество. По общим обязательствам, которые возникли не из договора, учасники отвечают солидарно.

2. Если договор простого товарищества связан с осуществлением его участниками предпринимательской деятельности, участники отвечают солидарно по всем общим обязательствам независимо от оснований возникновения.

Статья 1139. Распределение прибыли
1. Прибыль, полученная участниками договора простого товарищества в результате их совместной деятельности, распределяется пропорционально стоимости вкладов участников в общее имущество, если иное не установлено договором простого товарищества или другой договоренностью участников.

Условие о лишении или отказе участника от права на часть прибыли ничтожно.

Статья 1140. Выделение доли участника по требованию его кредитора
1. Кредитор участника договора простого товарищества вправе предъявить требование о выделении доли участника в общем имуществе в соответствии с положениями Гражданского кодекса Украины.

Статья 1141. Прекращение договора простого товарищества
1. Договор простого товарищества прекращается в случае:

признания участника недееспособным, безвестно отсутствующим, ограниченно дееспособным, если соглашением его участников не предусмотрено сохранение договора относительно иных учасников;
объявления участника банкротом, если соглашением его участников не предусмотрено сохранение договора относительно других учасников;
смерти физического лица - участника или ликвидации юридического лица - участника договора простого товарищества, если соглашением его участников не предусмотрено сохранение договора относительно других участников или замещения участника, который умер (ликвидированного юридического лица), его наследниками (правопреемниками);
отказа участника от дальнейшего участия в договоре простого товарищества или расторжения договора по требованию одного из участников, если соглашением его участников не предусмотрено сохранение договора относительно других участников;
истечения срока договора простого товарищества;
выделения доли участника по требованию его кредитора, если соглашением его участников не предусмотрено сохранение договора относительно других участников;
достижение цели общества или наступления обстоятельств, когда достижение цели общества стало невозможным.
2. При прекращении договора простого товарищества вещи, переданные в общее владение и (или) пользование участников, возвращаются участникам, которые их предоставили, без вознаграждения, если иное предусмотрено договоренностью сторон.

Раздел имущества, находящегося в общей собственности участников, и общих прав требования, которые возникли у них, осуществляется в порядке, установленном Гражданским кодексом Украины.

Участник, внесший в общую собственность вещь, определенную индивидуальными признаками, имеет право в случае прекращения договора простого товарищества требовать в судебном порядке возврата ему этой вещи при условии соблюдения интересов других участников и кредиторов.

3. С момента прекращения договора простого товарищества его участники несут солидарную ответственность по невыполненным совместным обязательствам в отношении третьих лиц.

Статья 1142. Отказ участника от дальнейшего участия в договоре простого товарищества и расторжения договора
1. Участник может сделать заявление об отказе от дальнейшего участия в бессрочном договоре простого товарищества не позднее, чем за три месяца до выхода из договора.

Условие об ограничении права на отказ от бессрочного договора простого товарищества является ничтожным.

2. Участник договора простого товарищества, заключенного на определенный срок, или договора, в котором достижение цели определены как отменительное условие, имеет право требовать расторжения договора в отношениях с другими участниками по уважительной причине с возмещением другим участникам реальных убытков, причиненных расторжением договора.

Статья 1143. Ответственность участника, в отношении которого договор простого товарищества прекращен
1. Если договор простого товарищества не был прекращен по заявлению участника об отказе от дальнейшего в нем участия или в случае расторжения договора по требованию одного из участников, участник, участие которого в договоре прекратилось, отвечает перед третьими лицами по общим обязательствам, возникшим в период его участи в договоре простого товарищества как участника договора
"""
GKU_g_78 = """ 
Глава 78 - Гражданского кодекса
Подраздел 2 - Внедоговорные обязательства

Публичное обещание вознаграждения

Параграф 1. Публичное обещание вознаграждения без объявления конкурса

Статья 1144. Право на публичное обещание вознаграждения без объявления конкурса
1. Лицо имеет право публично пообещать вознаграждение (награду) за передачу ему соответствующего результата (передача информации, нахождение вещи, нахождение физического лица и т.д.).

2. Обещание вознаграждения является публичным, если оно освещено в средствах массовой информации или иным образом неопределенному кругу лиц.

3. В извещении о публичном обещании вознаграждения должны быть определены задачи, срок и место его исполнения, форма и размер вознаграждения.

Статья 1145. Содержание задания
1. В случае публичного обещания вознаграждения задача, которую предстоит выполнить, может касаться разового действия или неограниченного количества действий одного вида, которые могут совершаться различными лицами.

Статья 1146. Срок (дата) выполнения задачи
1. В случае публичного обещания вознаграждения для выполнения задания может быть установлен срок (дата). Если срок (дата) выполнения задачи не установлен, оно считается действующим в течение разумного периода времени согласно содержанию задачи.

Статья 1147. Изменение условий публичного обещания вознаграждения
1. Лицо, которое публично обещало вознаграждение, имеет право изменить задачи и условия предоставления вознаграждения.

2. Лицо, приступившее к выполнению задания, имеет право требовать возмещения убытков, причиненных ему в связи с изменением задания.

3. Если в связи с изменением условий предоставления вознаграждения выполнения задания потеряло интерес для лица, которое приступило к его выполнению до изменения условий, это лицо имеет право на возмещение понесенных им расходов.

Статья 1148. Правовые последствия выполнения задания
1. При выполнении задания и передачи его результата лицо, публично обещавшее вознаграждение (награду), обязано выплатить его.

2. Если задача касается разового действия, вознаграждение выплачивается лицу, которое выполнило задание первым.

Если такое задание было выполнено несколькими лицами одновременно, вознаграждение распределяется между ними поровну.

Статья 1149. Прекращение обязательства в связи с публичным обещанием вознаграждения
1. Обязательство в связи с публичным обещанием вознаграждения прекращается в случае:

окончания срока для передачи результата;
передачи результата лицом, первым выполнившим задание.
2. Лицо, которое публично обещало вознаграждение, имеет право публично объявить о прекращении задания.

В этом случае лицо, которое понесло реальные затраты на подготовку к выполнению задания, имеет право на их возмещение.

Параграф 2. Публичное обещание награды по результатам конкурса

Статья 1150. Право на объявление конкурса
1. Конкурс (соревнование) имеет право объявить физическое или юридическое лицо (учредитель конкурса).

2. Конкурс объявляется публично через средства массовой информации. Объявление о конкурсе может быть сделано другим образом.

3. Учредитель конкурса имеет право пригласить к участию в нем персональных участников (закрытый конкурс).

Статья 1151. Условия конкурса
1. Основатель конкурса сообщает о его условиях одновременно с объявлением о конкурсе или персонально каждому, кто изъявил желание участвовать в нем.

2. Предметом конкурса может быть результат интеллектуальной, творческой деятельности, совершения определенных действий, выполнение работы и т.д.

3. По результатам конкурса выдается награда (премия). Количество призовых мест, вид награды (сумма премии) за каждое призовое место т.д. определяются в условиях конкурса.

Условиями конкурса может быть обусловлено предоставление победителю только морального поощрения.

4. Условиями конкурса должен быть предусмотрен срок подачи произведений на конкурс или выполнения определенного действия.

5. Предмет конкурса, награда (премия), которая должна быть выплачена победителю, являются существенными условиями объявления конкурса.

Статья 1152. Изменение условий конкурса
1. Учредитель конкурса вправе изменить его условия до начала конкурса. Изменение условий конкурса после его начала не допускается. Об изменении условий конкурса должно быть объявлено в том же порядке, в котором был объявлен конкурс.

2. Если в связи с изменением условий конкурса участие в нем для лица потеряло интерес или стало невозможным, это лицо имеет право на возмещение учредителем расходов, понесенных им для подготовки к участию в конкурсе.

Статья 1153. Отказ от проведения конкурса
1. Учредитель конкурса имеет право отказаться от его проведения, если проведение конкурса стало невозможным при обстоятельствах, которые от него не зависят.

В случае отказа учредителя от проведения конкурса по иным основаниям участник конкурса имеет право на возмещение расходов, которые были им понесены для подготовки к участию в конкурсе.

Статья 1154. Победитель конкурса
1. Победителем конкурса признается лицо, которое достигло наилучшего результата.

2. Победитель конкурса определяется в порядке, установленном учредителем конкурса. Результаты конкурса объявляются в том же порядке, в котором он был объявлен.

3. Результаты конкурса могут быть обжалованы заинтересованным лицом в суде.

Статья 1155. Особенности оценки результатов интеллектуальной, творческой деятельности, которые поданы на конкурс
1. По результатам оценки результатов интеллектуальной, творческой деятельности, представленных на конкурс, основатель конкурса (конкурсная комиссия, жюри) может принять решение о:

присуждении всех призовых мест и наград (премий), которые были определены условиями конкурса;
присуждении отдельных призовых мест, если их было установлено несколько, и наград (премий);
отказ в присуждении призовых мест, если ни одна из работ, представленных на конкурс, не соответствует его требованиям;
присуждение поощрительного приза и (или) награды (премии).
Статья 1156. Права победителя конкурса
1. Победитель конкурса имеет право требовать от его основателя выполнения своего обязательства в сроки, установленные условиями конкурса.

2. Если предметом конкурса был результат интеллектуальной, творческой деятельности, основатель конкурса имеет право дальнейшего их использования только с согласия победителя конкурса.

3. Учредитель конкурса имеет преимущественное право перед другими лицами на заключение с победителем конкурса договора на право использования предмета конкурса.

Статья 1157. Возврат участнику конкурса вещи, представленной на конкурс
1. Представление участником конкурса вещи на конкурс не прекращает его право собственности на эту вещь.

Условие конкурса, по которому основатель конкурса не возвращает его участнику вещь, представленную на конкурс, ничтожны.

2. Основатель конкурса может оставить у себя вещь, представленную на конкурс, только с согласия участника конкурса. Если участник конкурса в течение месяца со дня объявления его результатов не предъявил требование о возврате ему вещи, поданной на конкурс, считается, что основатель конкурса имеет право дальнейшего владения ею.

Участник конкурса имеет право в любое время предъявить требование о возврате ему вещи, поданной на конкурс.

3. Если вещь, представленная на конкурс, не была подарена основателю конкурса или куплена им, он может приобрести право собственности на нее в соответствии со статьей 344 Гражданского кодекса Украины (приобретаемая давность).
"""
GKU_g_79 = """ 
Глава 79 - Гражданского кодекса Украины
Совершение действий в имущественных интересах другого лица без его поручения

Статья 1158. Право на совершение действий в имущественных интересах другого лица без его поручения
1. Если имущественным интересам другого лица угрожает опасность наступления невыгодных для него имущественных последствий, лицо имеет право без доверенности совершить действия, направленные на их предупреждение, устранение или уменьшение.

2. Лицо, совершившее действия в имущественных интересах другого лица
без его поручения, обязано при первой возможности уведомить его о своих действиях. Если эти действия будут одобрены другим лицом, в дальнейшем к отношениям сторон применяются положения о соответствующем договоре.

3. Если лицо, начавшее действия в имущественных интересах другого лица без его поручения, не имеет возможности сообщить о своих действиях этому лицу, оно обязано принять все зависящие от него меры по предупреждению, устранению или уменьшению невыгодных имущественных последствий для другого лица. Лицо, которое совершает действия в имущественных интересах другого лица без его поручения, обязано взять на себя все обязанности, связанные с совершением этих действий, в частности обязанности относительно совершенных сделок.

Статья 1159. Предоставление отчета о совершении действий в имущественных интересах другого лица без его поручения
1. Лицо, совершившее действия в интересах другого лица без его поручения, обязано немедленно по окончании этих действий предоставить лицу, в имущественных интересах которого были совершены действия, отчет об этих действиях и передать ему все, что при этом было получено.

Статья 1160. Возмещение расходов, понесенных лицом в связи с совершением им действий в имущественных интересах другого лица без его поручения
1. Лицо, совершившее действия в имущественных интересах другого лица без его поручения, вправе требовать от этого лица возмещения фактически произведенных расходов, если они были оправданы обстоятельствами, при которых были совершены действия.

2. Если лицо, совершившее действия в имущественных интересах другого лица без его поручения, при первой возможности не сообщило этому лицу о своих действиях, оно не имеет права требовать возмещения произведенных расходов.
"""
GKU_g_80 = """ 
Глава 80 - Гражданского кодекса Украины
Спасение здоровья и жизни физического лица, имущества физического или юридического лица

Статья 1161. Обязательства, возникающие вследствие спасения здоровья и жизни физического лица
1. Ущерб, нанесенный лицу, без соответствующих полномочий спасавшего здоровье и жизнь физического лица от реальной угрозы для него, возмещается государством в полном объеме.

Статья 1162. Обязательства, возникающие в связи со спасением имущества другого лица
1. Вред, причиненный увечьем, иным повреждением здоровья или смертью физического лица, которое без соответствующих полномочий спасало от реальной угрозы имущество другого лица, имеющего существенную ценность, возмещается государством в полном объеме.

2. Ущерб, нанесенный имуществу лица, без соответствующих полномочий спасавшего от реальной угрозы имущество другого лица, которое имеет существенную ценность, возмещается собственником (владельцем) этого имущества с учетом его материального положения.

Вред возмещается с учетом имущественного положения собственника (владельца) имущества, которому причинен вред.

Размер возмещения вреда не может превышать стоимости спасавшегося имущества
"""
GKU_g_81 = """ 
Глава 81 - Гражданского кодекса
Создание угрозы жизни, здоровью, имуществу физического лица или имуществу юридического лица

Статья 1163. Устранение угрозы жизни, здоровью, имуществу физического лица или имуществу юридического лица
1. Физическое лицо, жизни, здоровью или имуществу которого угрожает опасность, а также юридическое лицо, имуществу которого угрожает опасность, имеют право требовать ее устранения от того, кто ее создает.

Статья 1164. Последствия неустранения угрозы жизни, здоровью, имуществу физического лица или имуществу юридического лица
1. В случае неустранения угрозы жизни, здоровью, имуществу физического лица или имуществу юридического лица заинтересованное лицо имеет право требовать:

принятия неотложных мер по устранению угрозы;
возмещения причиненного вреда;
запрещения деятельности, создающей угрозу.
Статья 1165. Возмещение вреда, причиненного неустранения угрозы жизни, здоровью, имуществу физического лица или имуществу юридического лица
1. Ущерб, нанесенный вследствие неустранения угрозы жизни, здоровью, имуществу физического лица или имуществу юридического лица, возмещается в соответствии с Гражданским кодексом Украины.
"""
GKU_g_82 = """ 
Глава 82 - Гражданского кодекса
Возмещение ущерба

Параграф 1. Общие положения о возмещении вреда

Статья 1166. Общие основания ответственности за причиненный имущественный вред
1. Имущественный ущерб, причиненный неправомерными решениями, действиями или бездеятельностью личным неимущественным правам физического или юридического лица, а также вред, причиненный имуществу физического или юридического лица, возмещается в полном объеме лицом, которое его нанесло.

2. Лицо, которое нанесло ущерб, освобождается от его возмещения, если оно докажет, что вред причинен не по его вине.

3. Вред, причиненный увечьем, иным повреждением здоровья или смертью физического лица вследствие непреодолимой силы, возмещается в случаях, установленных законом.

4. Вред, причиненный правомерными действиями, возмещается в случаях, установленных Гражданским кодексом Украины и другим законом.

Статья 1167. Основания ответственности за причиненный моральный вред
1. Моральный вред, причиненный физическому или юридическому лицу неправомерными решениями, действиями или бездействием, возмещается лицом, которое его нанесло, при наличии его вины, кроме случаев, установленных частью второй настоящей статьи.

2. Моральный вред возмещается независимо от вины органа государственной власти, органа власти АР Крым, органа местного самоуправления, физического или юридического лица, его нанесшего:

если ущерб причинен увечьем, иным повреждением здоровья или смертью физического лица вследствие действия источника повышенной опасности;
если ущерб причинен физическому лицу вследствие его незаконного осуждения, незаконного привлечения к уголовной ответственности, незаконного применения в качестве меры пресечения содержания под стражей или подписки о невыезде, незаконного задержания, незаконного наложения административного взыскания в виде ареста или исправительных работ;
в иных случаях, установленных законом.
Статья 1168. Возмещение морального вреда увечьем, иным повреждением здоровья или смертью физического лица
1. Моральный вред, причиненный увечьем или иным повреждением здоровья, может быть возмещен единовременно или путем осуществления ежемесячных платежей.

2. Моральный вред, причиненный смертью физического лица, возмещается его супругу (супруге), родителям (усыновителям), детям (усыновленным), а также лицам, которые проживали с ним одной семьей.

Статья 1169. Возмещение вреда, причиненного лицом в случае осуществление им права на самозащиту
1. Ущерб, нанесенный лицом при осуществлении им права на самозащиту от противоправных посягательств, в том числе в состоянии необходимой обороны, если при этом не были превышены ее пределы, не возмещается.

2. Если в случае совершения лицом права на самозащиту оно нанесло вред другому лицу, этот ущерб должен быть возмещен лицом, которое его нанесло. Если такой ущерб причинен способами самозащиты, которые не запрещены законом и не противоречат моральным основам общества, оно возмещается лицом, совершившим противоправное действие.

Статья 1170. Возмещение вреда, причиненного принятием закона о прекращении права собственности на определенное имущество
1. В случае принятия закона, прекращающего право собственности на определенное имущество, ущерб, причиненный владельцу такого имущества, возмещается государством в полном объеме.

Статья 1171. Возмещение вреда, причиненного в состоянии крайней необходимости
1. Вред, причиненный лицу в связи с совершением действий, направленных на устранение опасности, угрожавшей гражданским правам или интересам другого физического или юридического лица, если эта опасность при данных обстоятельствах не могла быть устранена иными средствами (крайняя необходимость), возмещается лицом, которое его нанесло.

Лицо, которое возместило ущерб, имеет право предъявить обратное требование к лицу, в интересах которого оно действовало.

2. Учитывая обстоятельства, при которых был нанесен ущерб в состоянии крайней необходимости, суд может возложить обязанность ее возмещения на лицо, в интересах которого действовало лицо, которое нанесло вред, или обязать каждого из них возместить ущерб в определенной доле или освободить их от возмещения вреда частично или в полном объеме.

Статья 1172. Возмещение юридическим или физическим лицом вреда, причиненного их работником или другим лицом
1. Юридическое или физическое лицо возмещает вред, причиненный их работником при исполнении им своих трудовых (служебных) обязанностей.

2. Заказчик возмещает вред, причиненный другому лицу подрядчиком, если он действовал по заданию заказчика.

3. Предпринимательские общества, кооперативы возмещают вред, причиненный их участником (членом) во время осуществления им предпринимательской или иной деятельности от имени общества или кооператива.

Статья 1173. Возмещение вреда, причиненного органом государственной власти, органом власти АР Крым или органом местного самоуправления
1. Вред, причиненный физическому или юридическому лицу незаконными решениями, действием или бездействием органа государственной власти, органа власти АР Крым или органа местного самоуправления при осуществлении ими своих полномочий, возмещается государством, АР Крым или органом местного самоуправления независимо от вины этих органов.

2. Особенности возмещения вреда, причиненного в результате вывода неплатежеспособного банка с рынка / ликвидации банка на основании противоправных (незаконных) индивидуальных актов Национального банка Украины, Фонда гарантирования вкладов физических лиц, Министерства финансов Украины, Национальной комиссии по ценным бумагам и фондовому рынку, решений Кабинета министров Украины лицам, которые на дату принятия таких индивидуальных актов или решений, соответственно, имели статус участников такого банка, устанавливаются Законом Украины "О банках и банковской деятельности" и Законом Украины "О системе гарантирования вкладов физических лиц".

Статья 1174. Возмещение вреда, причиненного служебным или должностным лицом органа государственной власти, органа власти АР Крым или органа местного самоуправления
1. Вред, причиненный физическому или юридическому лицу незаконными решениями, действиями или бездействием должностного или служебного лица органа государственной власти, органа власти АР Крым или органа местного самоуправления при осуществлении им своих полномочий, возмещается государством, АР Крым или органом местного самоуправления независимо от вины этого лица.

Статья 1175. Возмещение вреда, причиненного органом государственной власти, органом власти АР Крым или органом местного самоуправления в сфере нормотворческой деятельности
1. Вред, причиненный физическому или юридическому лицу в результате принятия органом государственной власти, органом власти АР Крым или органом местного самоуправления нормативно-правового акта, который был признан незаконным и отменен, возмещается государством, АР Крым или органом местного самоуправления независимо от вины должностных и должностных лиц этих органов.

Статья 1176. Возмещение вреда, причиненного незаконными решениями, действиями или бездействием органа дознания, предварительного (досудебного) следствия, прокуратуры или суда
1. Вред, причиненный физическому лицу вследствие его незаконного осуждения, незаконного привлечения к уголовной ответственности, незаконного применения в качестве меры пресечения содержания под стражей или подписки о невыезде, незаконного задержания, незаконного наложения административного взыскания в виде ареста или исправительных работ, возмещается государством в полном объеме независимо от вины должностных и служебных лиц органа дознания, предварительного (досудебного) следствия, прокуратуры или суда.

2. Право на возмещение вреда, причиненного физическому лицу незаконными действиями органов дознания, предварительного следствия, прокуратуры или суда, возникает в случаях, предусмотренных законом.

3. Если уголовное дело закрыто на основании закона об амнистии или акта о помиловании, право на возмещение вреда не возникает.

4. Физическое лицо, которое в процессе дознания, предварительного (досудебного) следствия или судебного разбирательства путем самооговора препятствовало выяснению истины и этим способствовало незаконному осуждению, незаконному привлечению к уголовной ответственности, незаконному применению в качестве меры пресечения содержания под стражей или подписки о невыезде, незаконному задержанию, незаконному наложению административного взыскания в виде ареста или исправительных работ, не имеет права на возмещение вреда.

5. Вред, причиненный физическому или юридическому лицу вследствие вынесения судом незаконного решения по гражданскому делу, возмещается государством в полном объеме в случае установления в действиях судьи (судей), которые повлияли на вынесение незаконного решения, состава преступления по обвинительным приговором суда, вступившим законную силу.

6. Вред, причиненный физическому или юридическому лицу вследствие другого незаконного действия или бездействия или незаконного решения органа дознания, предварительного (досудебного) следствия, прокуратуры или суда, возмещается на общих основаниях.

7. Порядок возмещения вреда, причиненного незаконными решениями, действиями или бездеятельностью органов дознания, предварительного (досудебного) следствия, прокуратуры или суда, устанавливается законом. (Статья 1176 с изменениями, внесенными Законом N 3165-IV (3165-15) от 01.12.2005)

Статья 1177. Возмещение (компенсация) вреда физическому лицу, пострадавшему от уголовного преступления
1. Вред, причиненный физическому лицу, пострадавшему от уголовного преступления, возмещается в соответствии с законом.

2. Ущерб, причиненный потерпевшему в результате уголовного преступления, компенсируется ему за счет Государственного бюджета Украины в случаях и порядке, предусмотренных законом

Статья 1178. Возмещение вреда, причиненного малолетним лицом
1. Вред, причиненный малолетним лицом (не достигшим четырнадцати лет), возмещается его родителями (усыновителями) или опекуном или другим физическим лицом, которое на правовых основаниях осуществляет воспитание малолетнего лица, - если они не докажут, что вред не является следствием недобросовестного осуществления или уклонения ими от осуществление воспитания и надзора за малолетним лицом.

2. Если малолетнее лицо нанесло ущерб во время пребывания под надзором учебного заведения, учреждения здравоохранения или иного заведения, который обязан осуществлять надзор за ней, а также под наблюдением лица, осуществляющего надзор за малолетним лицом на основании договора, эти учреждения и лицо обязаны возместить вред, если они не докажут, что вред был причинен не по их вине.

3. Если малолетнее лицо находилось в заведении, которое по закону осуществляет относительно него функции опекуна, это заведение обязано возместить ущерб, нанесенный им, если не докажет, что ущерб был причинен не по его вине.

4. Если малолетнее лицо нанесло ущерб как по вине родителей (усыновителей) или опекуна, так и по вине учреждений или лица, обязаного осуществлять надзор за ней, родители (усыновители), опекун, такие заведения и лицо обязаны возместить вред в доле, которая определена по договоренности между ними или по решению суда.

5. Обязанность лиц, определенных частью первой этой статьи, возместить вред, причиненный малолетним лицом, не прекращается в случае достижения им совершеннолетия. После достижения совершеннолетия лицо может быть обязано судом частично или в полном объеме возместить вред, причиненный им в возрасте до четырнадцати лет жизни или здоровью потерпевшего, если оно имеет достаточные для этого средства, а лица, определенные частью первой этой статьи, являются неплатежеспособными или умершими.

Статья 1179. Возмещение вреда, причиненного несовершеннолетним лицом
1. Несовершеннолетнее лицо (в возрасте от четырнадцати до восемнадцати лет) отвечает за причиненный им ущерб самостоятельно на общих основаниях.

2. В случае отсутствия у несовершеннолетнего лица имущества, достаточного для возмещения причиненного им вреда, этот вред возмещается в доле, которой не хватает, или в полном объеме его родителями (усыновителями) или попечителем, если они не докажут, что вред был причинен не по их вине. Если несовершеннолетнее лицо находилось в заведении, которое по закону осуществляет относительно него функции опекуна, это заведение обязано возместить вред в части, которой не хватает, или в полном объеме, если ононе докажет, что ущерб был причинен не по его вине.

3. Обязанность родителей (усыновителей), опекуна, учреждения, который по закону осуществляет относительно несовершеннолетнего лица функции опекуна, возместить вред прекращается после достижения лицом, которое нанесло ущерб, совершеннолетия или когда он до достижения совершеннолетия станет собственником имущества, достаточного для возмещения вреда.

Статья 1180. Возмещение вреда, причиненного несовершеннолетним лицом после вступления в полную гражданскую дееспособность
1. Вред, причиненный несовершеннолетним лицом после вступления в полную гражданскую дееспособность, возмещается этим лицом самостоятельно на общих основаниях.

2. В случае отсутствия у несовершеннолетнего лица, которое приобрело полную гражданскую дееспособность, имущества, достаточного для возмещение причиненного им вреда, этот вред возмещается в доле, которой не хватает, или в полном объеме его родителями (усыновителями) или попечителем, если они дали согласие на вступление в полную гражданскую дееспособность и не докажут, что вред был причинен не по их вине. Обязанность этих лиц возместить вред прекращается с достижением лицом, которое нанесло ущерб, совершеннолетия.

Статья 1181. Возмещение вреда, причиненного несколькими малолетними лицами
1. Вред, причиненный совместными действиями нескольких малолетних лиц, возмещается их родителями (усыновителями), опекунами в доле, которая определяется по договоренности между ними или по решению суда.

2. Если в момент причинения вреда несколькими малолетними лицами один из них находился в учреждении, которое по закону осуществляет относительно него функции опекуна, это заведение возмещает причиненный вред в части, которая определяется по решению суда.

Статья 1182. Возмещение вреда, причиненного несколькими несовершеннолетними лицами
1. Вред, причиненный совместными действиями нескольких несовершеннолетних лиц, возмещается ими в доле, которая определяется по договоренности между ними или по решению суда.

2. Если в момент причинения вреда несколькими несовершеннолетними лицами один из них находился в учреждении, которое по закону осуществляет относительно него функции опекуна, это учреждение возмещает причиненный вред в части, которая определяется по решению суда.

Статья 1183. Возмещение вреда родителями, лишенными родительских прав
1. Родители обязаны возместить вред, причиненный ребенком, в отношении которого они были лишены родительских прав, в течение трех лет после лишения их родительских прав, если они не докажут, что этот вред не является следствием невыполнения ими своих родительских обязанностей.

Статья 1184. Возмещение вреда, причиненного недееспособным физическим лицом
1. Вред, причиненный недееспособным физическим лицом, возмещается опекуном или учреждением, которое обязано осуществлять надзор за ним, если он не докажет, что ущерб был причинен не по его вине. Обязанность этих лиц возместить вред, причиненный недееспособным физическим лицом, не прекращается в случае возобновления его гражданской дееспособности.

2. Если опекун недееспособного лица, которое нанесло ущерб, умер или у него отсутствует имущество, достаточное для возмещения ущерба, а само недееспособное лицо имеет такое имущество, суд может постановить решение о возмещении вреда, причиненного увечьем, другим повреждением здоровья или смертью потерпевшего, частично или в полном объеме за счет имущества этого недееспособного лица.

Статья 1185. Возмещение вреда, причиненного физическим лицом, гражданская дееспособность которого ограничена
1. Вред, причиненный физическим лицом, гражданская дееспособность которого ограничена, возмещается им на общих основаниях.

Статья 1186. Возмещение вреда, причиненного физическим лицом, которое не осознавало значения своих действий и (или) не могло руководить ими
1. Вред, причиненный физическим лицом, которое в момент ее задача не осознавала значение своих действий и (или) не могло руководить ими, не возмещается. С учетом материального положения потерпевшего и лица, которое нанесло ущерб, суд может постановить решение о возмещении им этого вреда частично или в полном объеме.

Если физическое лицо, которое нанесло ущерб, само довела себя до состояния, в котором оно не понимало значения своих действий и (или) не могло руководить ими в результате употребления им спиртных напитков, наркотических средств, токсических веществ и т.п., ущерб, причиненный им, возмещается на общих основаниях.

2. Если вред был причинен лицом, которое не осознавало значения своих действий и (или) не могло руководить ими в связи с психическим расстройством или слабоумием, суд может постановить решение о возмещении этого ущерба его супругом (супругой), родителями, совершеннолетними детьми, если они проживали вместе с этим лицом, знали о его психическом расстройстве или слабоумии, но не приняли мер по предотвращению ущерба.

Статья 1187. Возмещение вреда, причиненного источником повышенной опасности
1. Источником повышенной опасности является деятельность, связанная с использованием, хранением или содержанием транспортных средств, механизмов и оборудования, использованием, хранением химических, радиоактивных, взрыво-и огнеопасных и других веществ, содержанием диких зверей, служебных собак и собак бойцовских пород и т.п., что создает повышенную опасность для человека, который эту деятельность осуществляет, и других лиц.

2. Вред, причиненный источником повышенной опасности, возмещается лицом, которое на соответствующем правовом основании (право собственности, иное вещное право, договор подряда, аренды и т.п.) владеет транспортным средством, механизмом, другим объектом, использования, хранение или содержание которого создает повышенную опасность.

3. Лицо, неправомерно завладевшее транспортным средством, механизмом, другим объектом, нанесшее ущерб деятельностью по его использованию, хранению или содержанию, обязано возместить его на общих основаниях.

4. Если неправомерному завладению другим лицом транспортным средством, механизмом, другим объектом способствовала халатность ее владельца (владельца), вред, причиненный деятельностью по его использованию, хранению или содержанию, возмещается ими совместно, в доле, которая определяется по решению суда с учетом обстоятельств, имеющих существенное значение.

5. Лицо, которое осуществляет деятельность, являеющуюся источником повышенной опасности, отвечает за причиненный вред, если оно не докажет, что ущерб был причинен вследствие непреодолимой силы или умысла пострадавшего.

Статья 1188. Возмещение вреда, причиненного взаимодействием нескольких источников повышенной опасности
1. Ущерб, нанесенный вследствие взаимодействия нескольких источников повышенной опасности, возмещается на общих основаниях, а именно:

ущерб, причиненный одному лицу по вине другого лица, возмещается виновным лицом;
при наличии вины только лица, которому причинен вред, он ему не возмещается;
при наличии вины всех лиц, деятельностью которых был нанесен вред, размер возмещения определяется в соответствующей доле в зависимости от обстоятельств, имиющих существенное значение.
2. Если в результате взаимодействия источников повышенной опасности был нанесен ущерб другим лицам, лица, совместно нанесли ущерб, обязаны его возместить независимо от их вины.

Статья 1189. Возмещение ядерного ущерба
1. Особенности возмещения ядерного ущерба устанавливаются законом.

Статья 1190. Возмещение вреда, причиненного совместно несколькими лицами
1. Лица, совместными действиями или бездеятельностью которых был нанесен ущерб, несут солидарную ответственность перед потерпевшим.

2. По заявлению потерпевшего суд может определить ответственность лиц, совместно нанесших вред, в доле в соответствии со степенью их вины.

Статья 1191. Право обратного требования к виновному лицу
1. Лицо, которое возместило ущерб, причиненный другим лицом, имеет право обратного требования (регресса) к виновному лицу в размере выплаченного возмещения, если иной размер не установлен законом.

2. Государство, АР Крым, территориальные общины, юридические лица имеют право обратного требования к физическому лицу, виновному в совершении преступления в размере средств, израсходованных на лечение лица, которое потерпело от этого преступления.

3. Государство, возместив вред, причиненный должностным, служебным лицом органу, который осуществляет оперативно-разыскную деятельность, досудебное расследование, прокуратуры или суда, имеет право обратного требования к этому лицу только в случае установления в его действиях состава уголовного преступления по обвинительному приговору суда в отношении него, вступившего в законную силу.

4. Родители (усыновители), опекун или попечитель, а также учреждение или лицо, обязаны осуществлять надзор за малолетним или несовершеннолетним лицом, возместили ущерб, нанесенный малолетним или несовершеннолетним лицом или физическим лицом, признанным недееспособным, не имеют права обратного требования к этому лицу.

Статья 1192. Способы возмещения вреда, причиненного имуществу потерпевшего
1. Если иное не установлено законом, с учетом обстоятельств дела суд по выбору потерпевшего может обязать лицо, причинившее вред имуществу, возместить его в натуре (передать вещь того же рода и такого же качества, починить поврежденную вещь и т.п.) или возместить причиненные убытки в полном объеме.

Размер убытков, подлежащих возмещению пострадавшему, определяется в соответствии с реальной стоимости утраченного имущества на момент рассмотрения дела или выполнения работ, необходимых для восстановления поврежденной вещи.

Статья 1193. Учет вины потерпевшего и материального положения физического лица, которое нанесло ущерб
1. Ущерб, нанесенный пострадавшему вследствие его умысла, не возмещается.

2. Если грубая неосторожность потерпевшего содействовала возникновению или увеличению вреда, то в зависимости от степени вины потерпевшего (а в случае вины лица, которое нанесло ущерб, - также в зависимости от степени его вины) размер возмещения уменьшается, если иное не установлено законом.

3. Вина потерпевшего не учитывается в случае возмещения дополнительных расходов, предусмотренных частью первой статьи 1195 Гражданского кодекса Украины, в случае возмещения вреда, причиненного смертью кормильца и в случае возмещения расходов на погребение.

4. Суд может уменьшить размер возмещения вреда, причиненного физическим лицом, в зависимости от его материального положения, кроме случаев, когда вред нанесен совершением преступления.

Статья 1194. Возмещение вреда лицом, застраховавшим свою гражданскую ответственность
1. Лицо, застраховавшее свою гражданскую ответственность, в случае недостаточности страховой выплаты (страхового возмещения) для полного возмещения причиненного им вреда обязано оплатить потерпевшему разницу между фактическим размером вреда и страховой выплатой (страховым возмещением).

Параграф 2. Возмещение вреда, причиненного увечьем, другим повреждением здоровья или смертью

Статья 1195. Возмещение вреда, причиненного увечьем или иным повреждением здоровья
1. Физическое или юридическое лицо, которое нанесло ущерб увечьем или иным повреждением здоровья физическому лицу, обязано возместить потерпевшему заработок (доход), утраченный им вследствие потери или уменьшения профессиональной или общей трудоспособности, а также возместить дополнительные расходы, вызванные необходимостью усиленного питания, санаторно-курортного лечения, приобретения лекарств, протезирования, постороннего ухода и т.д.

2. В случае увечья или иного повреждения здоровья физического лица, которое в момент причинения вреда не работало, размер возмещения определяется исходя из размера минимальной заработной платы.

3. Вред, причиненный физическому лицу увечьем или иным повреждением здоровья, возмещается без учета пенсии, назначенной в связи с потерей здоровья, или пенсии, которую оно получало до этого, а также других доходов.

4. Законом или договором может быть увеличен объем и размер возмещения вреда, причиненного потерпевшему увечьем или иным повреждением здоровья.

Статья 1196. Возмещение вреда, причиненного физическому лицу во время выполнения им договорных обязательств
1. Вред, причиненный увечьем, иным повреждением здоровья или смертью физического лица во время выполнения им договорных обязательств (договор перевозки и т.п.), подлежит возмещению на основаниях, установленных статьями 1166 и 1187 Гражданского кодекса Украины.

Статья 1197. Определение заработка (дохода), утраченного вследствие увечья или иного повреждения здоровья физического лица, работающего по трудовому договору
1. Размер потерянного физическим лицом вследствие увечья или другого повреждения здоровья заработка (дохода), подлежащего возмещению, определяется в процентах от среднего месячного заработка (дохода), который потерпевший имел до увечья или иного повреждения здоровья, с учетом степени потери пострадавшим профессиональной трудоспособности, а при ее отсутствии - общей трудоспособности.

Среднемесячный заработок (доход) исчисляется по желанию потерпевшего за двенадцать или за три последних календарных месяца работы, предшествовавших повреждению здоровья или потере трудоспособности вследствие увечья или иного повреждения здоровья. Если среднемесячный заработок (доход) потерпевшего меньше пятикратного размера минимальной заработной платы, размер утраченного заработка (дохода) исчисляется исходя из пятикратного размера минимальной заработной платы.

2. Для определения размера возмещения в случае профессионального заболевания может приниматься во внимание по желанию потерпевшего среднемесячный заработок (доход) за двенадцать или за три последних календарных месяца перед прекращением работы, что было вызвано увечьем или иным повреждением здоровья.

3. В утраченный заработок(доход) включаются все виды оплаты труда по трудовому договору по месту основной работы и по совместительству, из которых платится налог на доходы граждан, в суммах, начисленных до вычета налога.

В утраченный заработок(доход) не включаются единовременные выплаты, компенсация за неиспользованный отпуск, выходное пособие, пособие по беременности и родам и т.д.

Если потерпевший на момент нанесении ему вреда не работал, его среднемесячный заработок (доход) исчисляется, по его желанию, исходя из его заработка до увольнения или обычного размера заработной платы работника его квалификации в этой местности.

4. Если заработок (доход) потерпевшего до его увечья или другого повреждения здоровья изменился, что улучшило его материальное положение (повышение заработной платы по должности, перевод на вишеоплачиваемую работу, принятия на работу после окончания образования), при определении среднемесячного заработка (дохода) учитывается только заработок (доход), который он получил или должен был получить после соответствующего изменения.

Статья 1198. Определение дохода, утраченного вследствие увечья или другого повреждения здоровья физического лица-предпринимателя
1. Размер дохода физического лица-предпринимателя, утраченного физическим лицом вследствие увечья или иного повреждения здоровья, подлежащего возмещению, определяется из его годового дохода, полученного в предыдущем хозяйственном году, поделенного на двенадцать. Если это лицо получало доход менее двенадцати месяцев, размер его утраченного дохода определяется путем определения совокупной суммы дохода за соответствующее количество месяцев.

2. Размер дохода от предпринимательской деятельности, утраченного физическим лицом-предпринимателем вследствие увечья или иного повреждения здоровья, определяется на основании данных налогового органа.

3. Размер дохода, потерянного физическим лицом-предпринимателем вследствие увечья или иного повреждения здоровья, вычисляется исходя из размера дохода, который потерпевший имел до увечья или другого повреждения здоровья, в суммах, начисленных до вычета налогов.

4. Размер дохода, потерянного физическим лицом, самостоятельно обеспечивающего себя работой (адвокатом, лицом, занятым творческой деятельностью, и другими), определяется в порядке, установленном частями первой - третьей настоящей статьи.

Статья 1199. Возмещение вреда, причиненного увечьем или иным повреждением здоровья малолетнего или несовершеннолетнего лица
1. В случае увечья или иного повреждения здоровья малолетнего лица физическое или юридическое лицо, которое нанесло этот ущерб, обязано возместить расходы на его лечение, протезирование, постоянный уход, усиленное питание и т.п.

По достижении потерпевшим четырнадцати лет (учащимся - восемнадцати лет) юридическое или физическое лицо, которое нанесло ущерб, обязано возместить потерпевшему также вред, связанный с утратой или уменьшением его трудоспособности, исходя из размера установленной законом минимальной заработной платы.

2. Если на момент повреждения здоровья несовершеннолетнее лицо имело заработок, вред должен быть возмещен ему исходя из размера его заработка, но не ниже установленного законом размера минимальной заработной платы.

3. После начала трудовой деятельности в соответствии с полученной квалификации потерпевший имеет право требовать увеличения размера возмещение вреда, связанного с уменьшением его профессиональной трудоспособности вследствие увечья или иного повреждения здоровья, исходя из размера заработной платы работников его квалификации, но не ниже установленного законом размера минимальной заработной платы.

4. Если пострадавший не имеет профессиональной квалификации и после достижения совершеннолетия продолжает оставаться нетрудоспособным вследствие увечья или иного повреждения здоровья, причиненного ему до совершеннолетия, он имеет право требовать возмещения ущерба в объеме не ниже установленного законом размера минимальной заработной платы.

Статья 1200. Возмещение вреда, причиненного смертью потерпевшего
1. В случае смерти потерпевшего право на возмещение ущерба имеют нетрудоспособные лица, которые были на его иждивении или имели на день его смерти право на получение от него содержания, а также ребенок потерпевшего, родившийся после его смерти.

Вред возмещается:

ребенку до достижения им восемнадцати лет (учащемуся, студенту - до окончания обучения, но не более чем до достижения им двадцати трех лет);
мужу, жене, родителям (усыновителям), достигшим пенсионного возраста, установленного законом, - пожизненно;
лицам с инвалидностью - на срок их инвалидности;
одному из родителей (усыновителей) или второго из супругов или другому члену семьи независимо от возраста и трудоспособности, если они не работают и присматривают за: детьми, братьями, сестрами, внуками умершего, - до достижения ими четырнадцати лет;
другим нетрудоспособным лицам, которые были на иждивении потерпевшего, - в течение пяти лет после его смерти.
2. Лицам, определенным в пунктах 1-5 части первой этой статьи, вред возмещается в размере среднемесячного заработка (дохода) потерпевшего за вычетом доли, которая приходилась на него самого и трудоспособных лиц, которые находились на его иждивении, но не имеют права на возмещение вреда. К состав доходов потерпевшего также включаются пенсия, суммы, принадлежавшие ему по договору пожизненного содержания (ухода), и другие подобные выплаты, которые он получал.

3. Лицам, потерявшим кормильца, вред возмещается в полном объеме без учета пенсии, предназначенной им вследствие потери кормильца, и других доходов.

4. Размер возмещения, вычисленный для каждого из лиц, имеющих право на возмещение вреда, причиненного смертью кормильца, не подлежит дальнейшему пересчету, кроме таких случаев: рождение ребенка, зачатого при жизни и родившегося после смерти кормильца; назначения (прекращения) выплаты возмещения лицам, осуществляющим уход за детьми, братьями, сестрами, внуками умершего.

Размер возмещения может быть увеличен законом.

Статья 1201. Возмещение расходов на погребение
1. Лицо, которое нанесло ущерб смертью потерпевшего, обязано возместить лицу, понесшему необходимые расходы на погребение и на сооружение надгробного памятника, эти расходы.

Пособие на погребение, полученное физическим лицом, сделавшим эти расходы, к сумме возмещения вреда не засчитывается.

Статья 1202. Порядок возмещения вреда
1. Возмещение вреда, причиненного увечьем, иным повреждением здоровья или смертью потерпевшего, производится ежемесячными платежами.

При наличии обстоятельств, имеющих существенное значение, и с учетом материального положения физического лица, которое нанесло ущерб, сумма возмещения может быть выплачена единовременно, но не более чем за три года вперед.

2. Взыскание дополнительных расходов, предусмотренных частью первой статьи 1195 Гражданского кодекса Украины, может быть осуществлено заранее в пределах сроков, установленных на основе заключения соответствующей врачебной экспертизы, а также в случае необходимости предварительной оплаты услуг и имущества (приобретение путевки, оплата проезда, оплата специальных транспортных средств и т.п.).

Статья 1203. Увеличение размера возмещения вреда по требованию пострадавшего в случае изменения состояния его трудоспособности
1. Потерпевший имеет право на увеличение размера возмещения вреда, если его работоспособность снизилась по сравнению с той, которая была у него на момент решения вопроса о возмещении вреда.

Статья 1204. Уменьшение размера возмещения вреда по требованию лица, которое нанесло ущерб
1. Лицо, на которое возложена обязанность возместить ущерб, причиненный увечьем или иным повреждением здоровья потерпевшего, имеет право требовать уменьшения размера возмещения вреда, если трудоспособность потерпевшего возросла по сравнению с той, которая была у него на момент решения вопроса о возмещении вреда.

Статья 1205. Возмещение вреда в случае прекращения юридического лица, обязанного возместить вред
1. В случае прекращения юридического лица, обязанного возместить вред, причиненный увечьем, иным повреждением здоровья или смертью, и установление ее правопреемников выплата ежемесячных платежей возлагается на его правопреемников.

В этом случае требования об увеличении размера возмещения вреда предъявляются к его правопреемникам.

2. В случае ликвидации юридического лица платежи, причитающиеся потерпевшему или лицам, определенным статьей 1200 Гражданского кодекса Украины, должны быть капитализированы для выплаты их потерпевшему или этим лицам в порядке, установленном законом или другим нормативно-правовым актом.

В случае отсутствия у ликвидируемого юридического лица, средств для капитализации платежей, подлежащих уплате, обязанность по их капитализации возлагается на ликвидационную комиссию на основании решения суда по иску потерпевшего.

Статья 1206. Возмещение расходов на лечение лица, потерпевшего от преступления
1. Лицо, совершившее преступление, обязано возместить расходы учреждению здравоохранения на лечение пострадавшего от этого преступления, кроме случая причинения вреда при превышении пределов необходимой обороны или в состоянии сильного душевного волнения, возникло внезапно вследствие насилия или тяжкого оскорбления со стороны пострадавшего.

2. Если преступление совершено малолетним или несовершеннолетним лицом, расходы на лечение потерпевшего возмещаются лицами, определенными статьями 1178 и 1179 Гражданского кодекса Украины.

3. Если лечение проводилось учреждением здравоохранения, находящимся в государственной собственности, в собственности АР Крым или территориальной общины, средства на возмещение расходов на лечение засчитываются в соответствующий бюджет

Статья 1207. Обязанность государства возместить вред, причиненный увечьем, иным повреждением здоровья или смертью вследствие преступления
1. Вред, причиненный увечьем, иным повреждением здоровья или смертью вследствие преступления, возмещается потерпевшему или лицам, определенным статьей 1200 Гражданского кодекса Украины, государством, если не установлено лицо, совершившее преступление, или если оно является неплатежеспособным.

2. Условия и порядок возмещения государством вреда, причиненного увечьем, иным повреждением здоровья или смертью, устанавливаются законом.

Статья 1208. Увеличение размера возмещения вреда в связи с повышением стоимости жизни и увеличением размера минимальной заработной платы
1. По заявлению потерпевшего в случае повышения стоимости жизни размер возмещения вреда, причиненного увечьем, иным повреждением здоровья или смертью, подлежит индексации на основании решения суда.

2. По заявлению потерпевшего в случае увеличения размера минимальной заработной платы размер возмещения вреда, причиненного увечьем, иным повреждением здоровья или смертью, подлежит соответствующему увеличению на основании решения суда.

Параграф 3. Возмещение вреда, причиненного вследствие недостатков товаров, работ (услуг)

Статья 1209. Основания возмещения вреда, причиненного из-за недостатков товаров, работ (услуг)
1. Продавец, изготовитель товара, исполнитель работ (услуг) обязан возместить вред, причиненный физическому или юридическому лицу вследствие конструктивных, технологических, рецептурных и других недостатков товаров, работ (услуг), а также недостоверной или недостаточной информации о них.

Возмещение вреда не зависит от их вины, а также от того, находился ли потерпевший с ними в договорных отношениях.

2. Продавец, изготовитель товара, исполнитель работ (услуг) освобождаются от возмещения вреда, если они докажут, что вред возник вследствие непреодолимой силы или нарушения потерпевшим правил пользования или хранения товара (результатов работ, услуг).

Статья 1210. Лица, обязанные возмещать вред, причиненный вследствие недостатков товаров, работ (услуг)
1. Вред, причиненный вследствие недостатков товаров, подлежит возмещению, по выбору потерпевшего, продавцом или изготовителем товара.

2. Вред, причиненный вследствие недостатков работ (услуг), подлежит возмещению их исполнителем.

3. Вред, причиненный вследствие непредоставления полной или достоверной информации относительно свойств и правил пользования товаром, подлежит возмещению в соответствии с частью первой настоящей статьи.

Статья 1211. Сроки возмещения вреда, причиненного вследствие недостатков товаров, работ (услуг)
1. Вред, причиненный вследствие недостатков товаров, работ (услуг), подлежит возмещению, если он нанесен течение установленных сроков годности товара, работы (услуги), а если они не установлены, - в течение десяти лет со дня изготовления товара, выполнения работы (оказанию услуги).

2. Вред, причиненный вследствие недостатков товаров, работ (услуг), подлежит возмещению также если:

в нарушение требований закона не установлен срок годности товара, работы (услуги);
лицо не было предупреждено о необходимых действиях по истечении срока годности и о возможных последствиях в случае невыполнения этих действий.
"""
GKU_g_83 = """ 
Глава 83 - Гражданского кодекса
Приобретение, хранение имущества без достаточных правовых оснований

Статья 1212. Общие положения об обязательствах в связи с приобретением, хранением имущества без достаточного правового основания
1. Лицо, которое приобрело имущество или сохранило его у себя за счет другого лица (потерпевшего) без достаточного правового основания (безосновательно приобретенное имущество), обязано возвратить потерпевшему это имущество. Лицо обязано вернуть имущество и в том случае, когда основание, по которому оно было приобретено, со временем исчерпалось.

2. Положения настоящей главы применяются независимо от того, безосновательное приобретение или сохранение имущества было результатом поведения приобретателя имущества, потерпевшего, других лиц или следствием события.

3. Положения настоящей главы применяются также к требованиям о:

возвращении исполненного по недействительной сделке;
истребовании имущества собственником из чужого незаконного владения;
возвращение выполненного одной из сторон по обязательству;
возмещение вреда лицом, которое незаконно приобрело имущество или сохранило его у себя за счет другого лица.
Статья 1213. Возвращение в натуре безосновательно приобретенного имущества
1. Приобретатель обязан возвратить потерпевшему безосновательно приобретенное имущество в натуре.

2. В случае невозможности возвратить в натуре пострадавшему безосновательно приобретенное имущество возмещается его стоимость, которая определяется на момент рассмотрения судом дела о возврате имущества.

Статья 1214. Возмещение доходов от безосновательно приобретенного имущества и расходов на его содержание
1. Лицо, которое приобрело имущество или сохранило его у себя без достаточного правового основания, обязано возместить все доходы, которые оно получило или могло получить от этого имущества со времени, когда это лицо узнало или могло узнать о владении этим имуществом без достаточного правового основания. С этого времени оно отвечает также за допущенное им ухудшение имущества.

Лицо, которое приобрело имущество или сохранило его у себя без достаточного правового основания, имеет право требовать возмещения предпринятых им необходимых затрат на имущество со времени, с которого оно обязано возвратить доходы.

2. В случае безосновательного получения или сохранения денег начисляются проценты за пользование ими (статья 536 Гражданского кодекса Украины).

Статья 1215. Безосновательно приобретенное имущество, которое не подлежит возвращению
1. Не подлежит возврату безосновательно приобретенные:

заработная плата и платежи, которые приравниваются к ней, пенсии, пособия, стипендии, возмещение вреда, причиненного увечьем, иным повреждением здоровья или смертью, алименты и другие денежные суммы, предоставленные физическому лицу в качестве средства к существованию, если их выплата произведена физическим или юридическим лицом добровольно, при отсутствии расчетной ошибки с его стороны и недобросовестности со стороны приобретателя;
иное имущество, если это установлено законом.
"""
GKU_g_84 = """ 
Книга шестая ГК Украины - Наследование
Глава 84 - Гражданского Кодекса
Общие положения о наследовании

Статья 1216. Понятие наследования
1. Наследованием является переход прав и обязанностей (наследства) от физического лица, которое умерло (наследодателя) к другим лицам (наследникам).

Статья 1217. Виды наследования
1. Наследование осуществляется по завещанию или по закону.

Статья 1218. Состав наследства
1. В состав наследства входят все права и обязанности, принадлежавшие наследодателю на момент открытия наследства и не прекратившиеся вследствие его смерти.

Статья 1219. Права и обязанности лица, не входящие в состав наследства
1. Не входят в состав наследства права и обязанности, неразрывно связанные с личностью наследодателя, в частности:

личные неимущественные права;
право на участие в обществах и право членства в объединениях граждан, если иное не установлено законом или их учредительными документами;
право на возмещение вреда, причиненного увечьем или иным повреждением здоровья;
права на алименты, пенсию, помощь или другие выплаты, установлены законом;
права и обязанности лица как кредитора или должника, предусмотренные статьей 608 настоящего Кодекса.
Статья 1220. Открытие наследства
1. Наследство открывается вследствие смерти лица или объявления его умершим.

2. Временем открытия наследства является день смерти лица или день, с которого оно объявляется умершим (часть третья статьи 46 этого Кодекса).

3. Если в течение одних суток умерли лица, которые могли быть наследником одна после другой, наследство открывается одновременно и отдельно по каждому из них.

4. Если несколько лиц, которые могли быть наследником одна после другой, умерли во время общей для них опасности (стихийного бедствия, аварии, катастрофы и т.п.), предполагается, что они умерли одновременно. В этом случае наследство открывается одновременно и отдельно по каждому из этих лиц.

Статья 1221. Место открытия наследства
1. Местом открытия наследства является последнее место жительства наследодателя.

2. Если место жительства наследодателя неизвестн, местом открытия наследства является местонахождение недвижимого имущества или основной его части, а при отсутствии недвижимого имущества - местонахождения основной части движимого имущества.

3. В особенных случаях место открытия наследства устанавливается законом.

Статья 1222. Наследники
1. Наследниками по завещанию и по закону могут быть физические лица, которые являются живыми на момент открытия наследства, а также лица, которые были зачаты при жизни наследодателя и родившиеся живыми после открытия наследства.

2. Наследниками по завещанию могут быть юридические лица и другие участники гражданских отношений (статья 2 Гражданского кодекса Украины).

Статья 1223. Право на наследование
1. Право на наследование имеют лица, определенные в завещании.

2. В случае отсутствия завещания, признания его недействительным, непринятия наследства или отказа от его принятия наследниками по завещанию, а также в случае неохвата завещанием всего наследства право на наследование по закону получают лица, определенные в статьях 1261-1265 Гражданского кодекса Украины.

3. Право на наследование возникает в день открытия наследства.

Статья 1224. Устранение от права на наследование
1. Не имеют права на наследование лица, которые преднамеренно лишили жизни наследодателя или кого-либо из возможных наследников или совершили покушение на их жизнь.

Положение абзаца первого этой части не применяется к лицам, совершившего такое покушение, если наследодатель, зная об этом, все же назначил их своим наследником по завещанию.

2. Не имеют права на наследование лица, которые преднамеренно препятствовали наследодателю составить завещание, внести в него изменения или отменить завещание и этим оказывали содействие возникновению права на наследование у них самих или у других лиц или способствовали увеличению их доли в наследстве.

3. Не имеют права на наследование по закону родители после ребенка, в отношении которого они были лишены родительских прав и их права не были возобновлены на время открытия наследства.

Не имеют права на наследование по закону родители (усыновители) и совершеннолетние дети (усыновленные), а также другие лица, которые уклонялись от выполнения обязанности по содержанию наследодателя, если это обстоятельство установлено судом.

4. Не имеют права на наследование по закону один после другого лица, брак между которыми является недействительным или признан по решению суда.

Если брак признан недействительным после смерти одного из супругов, то по второму из супругов, который его пережил и не знал и не мог знать о препятствиях к заключению брака, суд может признать право на наследование доли умершего супруга, в имуществе, которое было приобретено ими за время этого брака.

5. По решению суда лицо может быть устранено от права на наследование по закону, если будет установлено, что оно уклонялось от предоставления помощи наследодателю, который из-за преклонного возраста, тяжелой болезни или увечья был в беспомощном состоянии.

6. Положения настоящей статьи распространяются на всех наследников, в том числе и на тех, кто имеет право на обязательную долю в наследстве, а также на лиц, в пользу которых сделан завещательный отказ.

Статья 1225. Наследование права на земельный участок
1. Право собственности на земельный участок переходит к наследникам на общих основаниях, с сохранением его целевого назначения.

2. К наследникам жилого дома, других зданий и сооружений переходит право собственности или право пользования земельным участком, на котором они размещены.

3. К наследникам жилого дома, других зданий и сооружений переходит право собственности или право пользования земельным участком, который необходим для их обслуживания, если другой его размер не определен завещанием.

Статья 1226. Наследование доли в праве общей совместной собственности
1. Доля в праве общей совместной собственности наследуется на общих основаниях.

2. Субъект права общей совместной собственности вправе завещать свою долю в праве общей совместной собственности до ее определения и выделения в натуре.

Статья 1227. Право на получение сумм заработной платы, пенсии, стипендии, алиментов, других социальных выплат, принадлежавшие наследодателю
1. Сумы заработной платы, пенсии, стипендии, алиментов, пособий в связи с временной нетрудоспособностью, возмещений в связи с увечьем или иным повреждением здоровья, других социальных выплат, которые принадлежали наследодателю, но не были им получены при жизни, передаются членам его семьи, а в случае их отсутствия - входят в состав наследства.

Статья 1228. Наследование права на вклад в банке (финансовой учреждении)
1. Вкладчик имеет право распорядиться правом на вклад в банке (финансовом учреждении) на случай своей смерти, составив завещание или сделав соответствующее распоряжение банку (финансовому учреждению).

2. Право на вклад входит в состав наследства независимо от способа распоряжения им.

3. Завещание, составленное после того, как было сделано распоряжение банку (финансовому учреждению), полностью или частично отменяет его, если в завещании изменено лицо, к которому должно перейти право на вклад, или если завещание касается всего имущества наследодателя.

Статья 1229. Наследование права на получение страховых выплат (страхового возмещения)
1. Страховые выплаты (страховое возмещение) наследуются на общих основаниях.

2. Если страхователь в договоре личного страхования назначил лицо, к которому должно перейти право на получение страховой выплаты в случае его смерти, это право не входит в состав наследства.

Статья 1230. Наследование права на возмещение убытков, морального ущерба и уплаты неустойки
1. К наследнику переходит право на возмещение убытков, причиненных наследодателю в договорных обязательствах.

2. К наследнику переходит право на взыскание неустойки (штрафа, пени) в связи с невыполнением должником наследодателя своих договорных обязанностей, которые были присуждены судом наследодателю при его жизни.

3. К наследнику переходит право на возмещение морального вреда, которое было присуждено судом наследодателю при его жизни.

Статья 1231. Наследование обязанности возместить имущественный вред (убытки) и моральный вред, который был нанесен наследодателем
1. К наследнику переходит обязанность возместить имущественный вред (ущерб), который был нанесен наследодателем.

2. К наследнику переходит обязанность возмещения морального вреда, причиненного наследодателем, которое было присуждено судом с наследодателя при его жизни.

3. К наследнику переходит обязанность уплатить неустойку (штраф, пеню), которая была присуждена судом кредитору с наследодателя при жизни наследодателя.

4. Имущественный и моральный вред, который был нанесен наследодателем, возмещается наследниками в пределах стоимости движимого или недвижимого имущества, которое было получено ими по наследству.

5. По иску наследника суд может уменьшить размер неустойки (штрафа, пени), размер возмещения имущественного вреда (ущерба) и морального вреда, если они являются непомерно большими по сравнению со стоимостью движимого или недвижимого имущества, которое было получено им в наследство.

Статья 1232. Обязанность наследников возместить затраты на содержание, уход, лечение и погребение наследодателя
1. Наследники обязаны возместить разумные расходы, которые были сделаны одним из них или другим лицом на содержание, уход, лечение и погребение наследодателя.

2. Расходы на содержание, уход, лечение наследодателя могут быть взысканы не более чем за три года до его смерти.

Статья 1232-1. Наследование прав и обязанностей по договору аренды жилья с выкупом
1. К наследникам переходят все права и обязанности по договору аренды жилья с правом выкупа, которые имел наследодатель.

2. Отказ наследников от договора аренды жилья с правом выкупа осуществляется в порядке, установленном статьей 1273 Гражданского кодекса Украины.

3. Досрочное прекращение договора аренды жилья с правом выкупа по инициативе наследников осуществляется в порядке, определенном законом.
"""
GKU_g_85 = """ 
Глава 85 - Гражданского кодекса
Наследование по завещанию

Статья 1233. Понятие завещания
1. Завещанием является личное распоряжение физического лица на случай своей смерти.

Статья 1234. Право на завещание
1. Право на завещание имеет физическое лицо с полной гражданской дееспособностью.

2. Право на завещание осуществляется лично. Совершение завещания через представителя не допускается.

Статья 1235. Право завещателя на назначение наследников
1. Завещатель может назначить своими наследниками одно или несколько физических лиц, независимо от наличия у него с этими лицами семейных, родственных отношений, а также других участников гражданских отношений.

2. Завещатель может без указания причин лишить права на наследование любое лицо из числа наследников по закону. В этом случае это лицо не может получить право на наследование.

3. Завещатель не может лишить права на наследование лиц, которые имеют право на обязательную долю в наследстве. Действие завещания в отношении лиц, имеющих право на обязательную долю в наследстве, устанавливается на время открытия наследства.

4. В случае смерти лица, которое было лишено права на наследование, до смерти завещателя, лишение его права на наследование теряет силу. Дети (внуки) этого лица имеют право на наследование на общих основаниях.

Статья 1236. Право завещателя на определение объема наследства, наследуемого по завещанию
1. Завещатель вправе охватить завещанием права и обязанности, которые ему принадлежат на момент составления завещания, а также те права и обязанности, которые могут ему принадлежать в будущем.

2. Завещатель имеет право составить завещание относительно всего наследства или его части.

3. Если завещатель распределил между наследниками в завещании только свои права, к наследникам, которых он назначил, переходит и часть его обязанностей, которая пропорциональна полученным ими правам.

4. Действие завещания относительно состава наследства устанавливается на момент открытия наследства.

Статья 1237. Право завещателя на завещательный отказ
1. Завещатель имеет право сделать в завещании завещательный отказ.

2. Отказополучателями могут быть лица, которые входят, а также те, которые не входят в число наследников по закону.

Статья 1238. Предмет завещательного отказа
1. Предметом завещательного отказа может быть передача отказополучателю в собственность или по другому вещному праву имущественного права или вещи, входящей или не входящей в состав наследства.

2. На наследника, к которому переходит жилой дом, квартира или другое движимое или недвижимое имущество, завещатель вправе возложить обязанность предоставить другому лицу право пользования ими. Право пользования жилым домом, квартирой или другим движимым или недвижимым имуществом сохраняет действие в случае последующего изменения их владельца.

Право пользования жилым домом, квартирой или другим движимым или недвижимым имуществом, полученное по завещательному отказу, является таким, что не отчуждается, не передается и не переходит к наследникам отказополучателя.

Право пользования жилым домом, квартирой или другим зданием, предоставленное отказополучателю, не является основанием для проживания в них членов его семьи, если в завещании не указано другое.

3. Наследник, на которого завещателем возложен завещательный отказ, обязан выполнить его только в пределах реальной стоимости имущества, которое перешло к нему, за вычетом доли долгов наследодателя, приходящихся на это имущество.

4. Отказополучатель имеет право требования к наследнику со времени открытия наследства.

Статья 1239. Утрата силы завещательного отказа
1. Завещательный отказ утрачивает силу в случае смерти отказополучателя, произошедшей до открытия наследства.

Статья 1240. Право завещателя на возложение на наследника других обязанностей
1. Завещатель может обязать наследника к совершению определенных действий неимущественного характера, в частности относительно распоряжения личными бумагами, определения места и формы осуществления ритуала захоронения.

2. Завещатель может обязать наследника к совершению определенных действий, направленных на достижение общественно полезной цели.

Статья 1241. Право на обязательную долю в наследстве
1. Малолетние, несовершеннолетние, совершеннолетние нетрудоспособные дети наследодателя, неработоспособная вдова (вдовец) и нетрудоспособные родители наследуют независимо от содержания завещания, половину доли, которая принадлежала бы каждому из них в случае наследования по закону (обязательная доля).

Размер обязательной доли в наследстве может быть уменьшен судом с учетом отношений между этими наследниками и наследодателем, а также других обстоятельств, имеющих существенное значение.

2. К обязательной доле в наследстве засчитывается стоимость вещей обычной домашней обстановки и обихода, стоимость завещательного отказа, установленного в пользу лица, имеющего право на обязательную долю, а также стоимость других вещей и имущественных прав, которые перешли к нему как к наследнику.

3. Любые ограничения и обременения, установленные в завещании для наследника, имеющего право на обязательную долю в наследстве, действительны только для той части наследства, которая превышает его обязательную долю.

Статья 1242. Завещание с условием
1. Завещатель может обусловить возникновение права на наследование у лица, которое назначено в завещании, наличием определенного условия, как связанного, так и не связанного с его поведением (наличие других наследников, проживание в определенном месте, рождение ребенка, получение образования и т.п.).

Условие, определенное в завещании, должно существовать на момент открытия наследства.

2. Условие, определенное в завещании, является ничтожным, если оно противоречит закону или моральным принципам общества.

3. Лицо, назначенное в завещании, не имеет права требовать признания условия недействительным на том основании, что оно не знала о нем, или если наступление условия от него не зависело.

Статья 1243. Завещание супругов
1. Супруги имеют право составить общее завещание относительно имущества, принадлежащего им на праве общей совместной собственности.

2. В случае составления общего завещания доля в праве общей совместной собственности после смерти одного из супругов переходит ко второму из супругов, который его пережил. В случае смерти последнего право на наследование имеют лица, определенные супругами в завещании.

3. При жизни жены и мужа каждый из них имеет право отказаться от совместного завещания. Такой отказ подлежит нотариальному удостоверению.

4. В случае смерти одного из супругов нотариус накладывает запрет отчуждения имущества, указанного в завещании супругов.

Статья 1244. Подназначение наследника
1. Завещатель имеет право назначить другого наследника на случай, если наследник, указанный в завещании, умрет до открытия наследства, не примет его или откажется от его принятия будет отстранен от права на наследование, а также в случае отсутствия условий, определенных в завещании (статья 1242 Гражданского кодекса Украины).

2. Подназначенным наследником может быть любое лицо, определенное в статье 1222 Гражданского кодекса Украины.

Статья 1245. Наследование части наследства, которое не охвачено завещанием
1. Часть наследства, не охваченая завещанием, наследуется наследниками по закону на общих основаниях. В число этих наследников входят также наследники по закону, которым другая часть наследства была передана по завещанию.

Статья 1246. Установление сервитута в завещании
1. Наследодатель имеет право установить в завещании сервитут относительно земельного участка, других природных ресурсов или иного недвижимого имущества для удовлетворения потребностей других лиц.

Статья 1247. Общие требования к форме завещания
1. Завещание составляется в письменной форме, с указанием места и времени его составления.

2. Завещание должно быть лично подписано завещателем.

Если лицо не может лично подписать завещание, оно подписывается в соответствии с частью четвертой статьи 207 Гражданского кодекса Украины.

3. Завещание должно быть заверено нотариусом или другими должностными, служебными лицами, определенными в статьях 1251-1252 Гражданского кодекса Украины.

4. Завещания, удостоверенные лицами, указанными в части третьей настоящей статьи, подлежат государственной регистрации в Наследственном реестре в порядке, утвержденном Кабинетом Министров Украины

Статья 1248. Удостоверение завещания нотариусом
1. Нотариус удостоверяет завещание, которое написано завещателем собственноручно или с помощью общепринятых технических средств.

2. Нотариус может по просьбе лица записать завещание с его слов собственноручно или с помощью общепринятых технических средств.

В этом случае завещание должно быть вслух прочитано завещателем и подписано им.

Если завещатель в силу физических недостатков не может сам прочитать завещание, удостоверение завещания должно происходить при свидетелях (статья 1253 Гражданского кодекса Украины).

Статья 1249. Удостоверение нотариусом секретных завещаний
1. Секретным является завещание, которое заверяется нотариусом без ознакомления с его содержанием.

2. Лицо, которое составило секретное завещание, подает его в заклеенном конверте нотариусу. На конверте должна быть подпись завещателя.

Нотариус ставит на конверте свою удостоверяемую надпись, скрепляет печатью и в присутствии завещателя помещает его в другой конверт и опечатывает.

Статья 1250. Объявление нотариусом секретного завещания
1. Получив информацию об открытии наследства, нотариус назначает день объявления содержания завещания. О дне объявления завещания он извещает членов семьи и родственников наследодателя, если их место жительства ему известно, или делает об этом уведомление в печатных средствах массовой информации.

2. В присутствии заинтересованных лиц и двух свидетелей нотариус открывает конверт, в котором хранилось завещание, и объявляет его содержание.

3. Об оглашении завещания составляется протокол, который подписывают нотариус и свидетели. В протоколе записывается весь смысл завещания;

Статья 1251. Удостоверение завещания должностным лицом органа местного самоуправления
1. Если в населенном пункте нет нотариуса, завещание, кроме секретного, может быть удостоверен уполномоченным на это должностным лицом соответствующего органа местного самоуправления.

Статья 1252. Удостоверение завещания другим должностным, служебным лицом
1. Завещание лица, находящегося на лечении в больнице, госпитале, другом стационарном учреждении здравоохранения, а также лица, проживающего в доме престарелых и лиц с инвалидностью, может быть удостоверено главным врачом, его заместителем по медицинской части или дежурным врачом этой больницы, госпиталя, другого стационарного учреждения здравоохранения, а также начальником госпиталя, директором или главным врачом дома для престарелых и лиц с инвалидностью.

2. Завещание лица, находящегося во время плавания на морском, речном судне, которое ходит под флагом Украины, может быть удостоверено капитаном этого судна.

3. Завещание лица, находящегося в поисковой или иной экспедиции, может быть заверено начальником этой экспедиции.

4. Завещание военнослужащего, а в пунктах дислокации воинских частей, соединений, учреждений, военно-учебных заведений, где нет нотариуса или органа, совершающего нотариальные действия, также завещание работника, члена его семьи и члена семьи военнослужащего может быть удостоверен командиром (начальником) этой части, соединения, учреждения или заведения.

5. Завещание лица, содержащегося в учреждении исполнения наказаний, может быть удостоверено начальником такого учреждения.

6. Завещание лица, содержащегося в следственном изоляторе, может быть удостоверено начальником следственного изолятора.

7. Завещания лиц, указанных в частях первой - шестой этой статьи, удостоверяются при свидетелях.

8. К завещаниям, удостоверенных должностными, служебными лицами, применяются положения статьи 1247 Гражданского кодекса Украины.

9. Завещания, удостоверенные должностными, служебными лицами, определенными в частях первой - шестой настоящей статьи, приравниваются к завещаниям, удостоверенным нотариусами.

Статья 1253. Удостоверение завещания при свидетелях
1. По желанию завещателя его завещание может быть удостоверено при свидетелях.

2. В случаях, установленных абзацем третьим части второй статьи 1248 и статьей 1252 Гражданского кодекса Украины, присутствие не менее двух свидетелей при удостоверении завещания является обязательным.

3. Свидетелями могут быть только лица с полной гражданской дееспособностью.

4. Свидетелями не могут быть:

нотариус или другое должностное, служебное лицо, которое удостоверяет завещание;
наследники по завещанию;
члены семьи и близкие родственники наследников по завещанию;
лица, которые не могут прочитать или подписать завещание.
5. Свидетели, при которых удостоверено завещание, зачитывают его вслух и ставят свои подписи на нем.

6. В текст завещания вносятся сведения о личности свидетелей.

Статья 1254. Право завещателя на отмену и изменение завещания
1. Завещатель имеет право в любое время отменить завещание.

2. Завещатель имеет право в любое время составить новое завещание. Завещание, которое было составлено позже, отменяет предыдущее завещание полностью или в той части, в которой оно ему противоречит.

3. Каждое новое завещание отменяет предыдущий и не восстанавливает завещания, которое завещатель составил перед ним.

4. Если новое завещание, составленное завещателем, было признано недействительным, действие предыдущего завещания не восстанавливается, кроме случаев, установленных статьями 225 и 231 настоящего Кодекса.

5. Завещатель имеет право в любое время внести в завещание изменения.

6. Отмена завещания, внесение в него изменений осуществляются завещателем лично.

7. Отмена завещания, внесение в него изменений осуществляются в порядке, установленном настоящим Кодексом для удостоверения завещания и подлежат государственной регистрации в Наследственном реестре в порядке, утвержденном Кабинетом Министров Украины.

Статья 1255. Тайна завещания
1. Нотариус, другое должностное, служебное лицо, которое удостоверяет завещание, свидетели, а также физическое лицо, которое подписывает завещание вместо завещателя, не вправе до открытия наследства разглашать сведения о факте составления завещания, его содержания, отмены или изменения завещания.

Статья 1256. Толкование завещания
1. Толкование завещания может быть осуществлено после открытия наследства самими наследниками.

2. В случае спора между наследниками толковании завещания осуществляется судом в соответствии со статьей 213 Гражданского кодекса Украины.

Статья 1257. Недействительность завещания
1. Завещание, составленное лицом, которое не имело на это права, а также завещание, составленное с нарушением требований относительно его формы и удостоверения, является ничтожным.

2. По иску заинтересованного лица суд признает завещание недействительным, если будет установлено, что волеизъявление завещателя не было свободным и не отвечало его воле.

3. Недействительность отдельного распоряжения, содержащегося в завещании, не имеет следствием недействительности другой его части.

4. В случае недействительности завещания наследник, который по этому завещанию был лишен права на наследование, получает право на наследование по закону на общих основаниях.
"""
GKU_g_86 = """ 
Глава 86 - Гражданского кодекса
Наследование по закону

Статья 1258. Очередность наследования по закону
1. Наследники по закону получают право на наследование поочередно.

2. Каждая следующая очередь наследников по закону получает право на наследование в случае отсутствия наследников предыдущей очереди, устранения их от права на наследование, непринятия ими наследства или отказа от его принятия, кроме случаев, установленных статьей 1259 Гражданского кодекса Украины.

Статья 1259. Изменение очередности получения права на наследование
1. Очередность получения наследниками по закону права на наследование может быть изменена нотариально удостоверенным договором заинтересованных наследников, заключенным после открытия наследства. Этот договор не может нарушить прав наследника, который не принимает в нем участия, а также наследника, имеющего право на обязательную долю в наследстве.

2. Физическое лицо, которое является наследником по закону следующих очередей, может по решению суда получить право на наследование вместе с наследниками той очереди, которая имеет право на наследование, при условии, что оно в течение длительного времени занимался, материально обеспечивало, оказывало другую помощь наследодателю, который из-за преклонного возраста, тяжелой болезни или увечья был в беспомощном состоянии.

Статья 1260. Наследование усыновленными и усыновителями
1. В случае наследования по закону усыновленный и его потомки, с одной стороны, и усыновитель и его родственники - с другой, приравниваются к родственникам по происхождению.

2. Усыновленный и его потомки не наследуют по закону после смерти родителей усыновленного, других его родственников по происхождению по восходящей линии.

Родители усыновленного и другие его родственники по происхождению по восходящей линии не наследуют по закону после смерти усыновленного и его потомков.

3. Если по решению суда об усыновлении сохранена правовая связь между усыновленным и его бабушкой, дедом, братом и сестрой по происхождению, то в случае смерти его бабушки, деда по происхождению усыновленный имеет право на наследование по праву представления, а в случае смерти его брата, сестры по происхождению - имеет право на наследование как наследник второй очереди.

В случае смерти усыновленного его бабушка, дедушка, брат, сестра по происхождению, с которыми была сохранена правовая связь, наследуют на общих основаниях.

Статья 1261. Первая очередь наследников по закону
1. В первую очередь право на наследование по закону имеют дети наследодателя, в том числе зачатые при жизни наследодателя и родившиеся после его смерти, тот из супругов, который его пережил, и родители.

Статья 1262. Вторая очередь наследников по закону
1. Во вторую очередь право на наследование по закону имеют родные братья и сестры наследодателя, его бабушка и дед, как со стороны отца, так и со стороны матери.

Статья 1263. Третья очередь наследников по закону
1. В третью очередь право на наследование по закону имеют родные дядя и тетя наследодателя.

Статья 1264. Четвертая очередь наследников по закону
1. В четвертую очередь право на наследование по закону имеют лица, которые проживали с наследодателем одной семьей не менее пяти лет до времени открытия наследства.

Статья 1265. Пятая очередь наследников по закону
1. В пятую очередь право на наследование по закону имеют другие родственники наследодателя до шестой степени родства включительно, причем родственники более близкой степени родства отстраняют от права наследования родственников дальнейшей степени родства.

Степень родства определяется по числу рождений, которые отдаляют родственника от наследодателя. Рождение самого наследодателя не входит в это число.

2. В пятую очередь право на наследование по закону получают иждивенцы наследодателя, которые не были членами его семьи.

Иждивенцем считается несовершеннолетнее или неработоспособное лицо, которое не было членом семьи наследодателя, но не менее пяти лет получало от него материальную помощь, которая была для него единственным или основным источником средств к существованию.

Статья 1266. Наследование по праву представления
1. Внуки, правнуки наследодателя наследуют ту долю наследства, которая принадлежала бы по закону их матери, отцу, бабушке, деду, если бы они были живы на момент открытия наследства.

2. Прабабушка, прадед наследуют ту долю наследства, которая бы принадлежала по закону их детям (бабушке, деду наследодателя), если бы они были живы на момент открытия наследства.

3. Племянники наследодателя наследуют ту долю наследства, которая принадлежала бы по закону их матери, отцу (сестре, брату наследодателя), если бы они были живы на момент открытия наследства.

4. Двоюродные братья и сестры наследодателя наследуют ту долю наследства, которая принадлежала бы по закону их матери, отцу (тетке, дяде наследодателя), если бы они были живы на момент открытия наследия.

5. Если наследование по праву представления осуществляется несколькими лицами, доля их умершего родственника делится между ними поровну.

6. При наследовании по прямой нисходящей линии право представления действует без ограничения степени родства.

Статья 1267. Размер доли в наследстве наследников по закону
1. Доли в наследстве каждого из наследников по закону являются равными.

2. Наследники по устному соглашению между собой, если это касается движимого имущества, могут изменить размер доли в наследстве кого-то из них.

3. Наследники по письменному соглашению между собой, удостоверенным нотариусом, если это касается недвижимого имущества или транспортных средств, могут изменить размер доли в наследстве кого из них.
"""
GKU_g_87 = """ 
Глава 87 - Гражданского кодекса
Осуществление права на наследство

Статья 1268. Принятие наследства
1. Наследник по завещанию или по закону имеет право принять наследство или не принять его.

2. Не допускается принятие наследства с условием или с оговоркой.

3. Наследник, который постоянно проживал вместе с наследодателем на время открытия наследства, считается принявшим наследство, если в течение срока, установленного статьей 1270 Гражданского кодекса Украины, он не заявил об отказе от него.

4. Малолетнее, несовершеннолетнее, недееспособное лицо, а также лицо, гражданская дееспособность которого ограничена, считаются принявшими наследство, кроме случаев, установленных частями второй - четвертой статьи 1273 Гражданского кодекса Украины.

5. Независимо от времени принятия наследства оно принадлежит наследнику со времени открытия наследства.

Статья 1269. Подача заявления о принятии наследства
1. Наследник, который желает принять наследство, но на время открытия наследства не проживал постоянно с наследодателем, имеет подать нотариусу заявление о принятии наследства.

2. Заявление о принятии наследства подается наследником лично.

3. Лицо, которое достигло четырнадцати лет, имеет право подать заявление о принятии наследства без согласия своих родителей или попечителя.

4. Заявление о принятии наследства от имени малолетнего, недееспособного лица подают его родители (усыновители), опекун.

5. Лицо, которое подало заявление о принятии наследства, может отозвать его в течение срока, установленного для принятия наследства.

Статья 1270. Сроки для принятия наследства
1. Для принятия наследства устанавливается срок в шесть месяцев, который начинается со времени открытия наследства.

2. Если возникновение у лица права на наследование зависит от непринятия наследства или отказа от его принятия другими наследниками, срок для принятия им наследства устанавливается в три месяца с момента непринятия другими наследниками наследства или отказа от его принятия.

Если оставшийся срок, меньше трех месяцев, он продлевается до трех месяцев.

Статья 1271. Принятие завещательного отказа
1. Если в течение шести месяцев со времени открытия наследства отказополучатель не отказался от завещательного отказа, считается, что он его принял.

Статья 1272. Последствия пропуска срока для принятия наследства
1. Если наследник в течение срока, установленного статьей 1270 Гражданского кодекса Украины, не подал заявление о принятии наследства, он считается не принявшим его.

2. По письменному согласию наследников, принявших наследство, наследник, пропустивший срок для принятия наследства, может подать заявление о принятии наследства нотариусу по месту открытия наследия.

3. По иску наследника, пропустившего срок для принятия наследства по уважительной причине, суд может определить ему дополнительный срок, достаточный для подачи им заявления о принятии наследства.

Статья 1273. Право на отказ от принятия наследства
1. Наследник по завещанию или по закону может отказаться от принятия наследства в течение срока, установленного статьей 1270 настоящего Кодекса. Заявление об отказе от принятия наследства подается нотариусу по месту открытия наследства.

2. Физическое лицо, гражданская дееспособность которого ограничена, может отказаться от принятия наследства с согласия опекуна и органа опеки и попечительства.

3. Несовершеннолетнее лицо в возрасте от четырнадцати до восемнадцати лет может отказаться от принятия наследства по согласию родителей (усыновителей), опекуна и органа опеки и попечительства.

4. Родители (усыновители), опекун могут отказаться от принятия наследства, принадлежащего малолетнему, недееспособному лицу, только с разрешения органа опеки и попечительства.

5. Отказ от принятия наследства является безусловным и безоговорочным.

6. Отказ от принятия наследства может быть отозван в течение срока, установленного для его принятия.

Статья 1274. Право на отказ от принятия наследства в пользу другого лица
1. Наследник по завещанию имеет право отказаться от принятия наследства в пользу другого наследника по завещанию.

2. Наследник по закону имеет право отказаться от принятия наследства в пользу любого из наследников по закону независимо от очереди.

3. Охрана наследственного имущества продолжается до истечения срока, установленного для принятия наследства.

4. Расходы на охрану наследственного имущества возмещаются наследниками согласно их доли в наследстве.

Статья 1275. Правовые последствия отказа от принятия наследства
1. Если от принятия наследства отказался один из наследников по завещанию, часть наследства, которую он имел право принять, переходит к другим наследникам по завещанию и распределяется между ними поровну.

2. Если от принятия наследства отказался один из наследников по закону с той очереди, которая имеет право на наследование, часть наследства, которую он имел право принять, переходит к другим наследникам по закону той же очереди и распределяется между ними поровну.

3. Положения настоящей статьи не применяются, если наследник отказался от принятия наследства в пользу другого наследника, а также когда завещатель предназначил другого наследника.

4. Если на наследника по завещанию, который отказался от принятия наследства, был положен завещательный отказ, обязанность по завещательному отказу переходит к другим наследникам по завещанию, принявших наследство, и распределяется между ними поровну.

5. Отказ наследника по завещанию от принятия наследства не лишает его права на наследование по закону.

Статья 1276. Переход права на принятие наследства
1. Если наследник по завещанию или по закону умер после открытия наследства и не успел его принять, право на принятие причитающейся ему доли наследства, кроме права на принятие обязательной доли в наследстве, переходит к его наследникам (наследственная трансмиссия).

Право на принятие наследства в этом случае осуществляется на общих основаниях в течение оставшегося срока. Если оставшийся срок, меньше трех месяцев, он продлевается до трех месяцев.

Статья 1277. Выморочность наследства
1. В случае отсутствия наследников по завещанию и по закону, устранения их от права на наследование, непринятия ими наследства, а также отказа от его принятия орган местного самоуправления по месту открытия наследства, а если в состав наследства входит недвижимое имущество - по его местонахождению, обязан подать в суд заявление о признании наследства выморочным.

В случае если на объекте недвижимого имущества на момент открытия наследства находится движимое имущество, входящее в состав наследства, такое движимое имущество переходит в собственность территориальной общины, которой передано недвижимое имущество.

Заявление о признании наследства выморочным может также быть подано кредитором наследодателя, а если в состав наследства входят земельные участки сельскохозяйственного назначения - владельцами или пользователями смежных земельных участков. В таком случае суд привлекает к рассмотрению дела органы местного самоуправления по месту открытия наследства и / или по местонахождению недвижимого имущества, входящего в состав наследства.

Лица, имеющие право или обязаны подавать заявление о признании наследства выморочным, имеют право на получение информации из Наследственный реестр о заведенном наследственное дело и выдано свидетельство о праве на наследство.

2. Заявление о признании наследства выморочным подается по истечении одного года со времени открытия наследства.

3. Наследство, признанное судом выморочным, переходит в собственность территориальной общины по месту открытия наследства, а недвижимое имущество - по его местонахождению.

4. Территориальная община, которая стала владельцем выморочного имущества, обязана удовлетворить требования кредиторов наследодателя, заявленные в соответствии со статьей 1231 настоящего Кодекса. Если собственниками выморочного имущества стали несколько территориальных общин, требования кредиторов наследодателя удовлетворяются территориальными общинами пропорционально стоимости выморочного имущества, приобретенного в собственность каждой из них.

5. Наследство, не принятое наследниками, охраняется к признанию ее выморочным соответствии со статьей 1283 настоящего Кодекса.

Статья 1278. Разделение наследства между наследниками
1. Доли каждого наследника в наследстве являются равными, если наследодатель в завещании сам не распределил наследство между ними.

2. Каждый из наследников имеет право на выделение его доли в натуре.

Статья 1279. Преимущественное право отдельных наследников на выделение им наследственного имущества в натуре
1. Наследники, которые в течение не менее одного года до времени открытия наследства проживали вместе с наследодателем одной семьей, имеют преимущественное право перед другими наследниками на выделение им в натуре предметов обычной домашней обстановки и обихода в размере доли в наследстве, которая им принадлежит.

2. Наследники, которые вместе с наследодателем были совладельцами имущества, имеют преимущественное право перед другими наследниками на выделение им в натуре этого имущества, в пределах их доли в наследстве, если это не нарушает интересы других наследников, которые имеют важное значение.

Статья 1280. Перераспределение наследства
1. Если после истечения срока для принятия наследства и после распределения его между наследниками наследство приняли другие наследники (части вторая и третья статьи 1272 Гражданского кодекса Украины), она подлежит перераспределению между ними.

Такие наследники имеют право требовать передачи им в натуре части имущества, которое сохранилось, или уплаты денежной компенсации.

2. Если имущество, на которое претендует наследник, пропустивший срок для принятия наследства, перешло как выморочное к территориальной общины и сохранилось, наследник имеет право требовать его передачи в натуре. В случае его продажи наследник имеет право на денежную компенсацию.

Статья 1281. Предъявление кредитором наследодателя требований к наследникам
1. Наследники обязаны сообщить кредитору наследодателя об открытии наследства, если им известно о его долгах.

2. Кредитору наследодателя предстоит в течение шести месяцев со дня, когда он узнал или должен был узнать об открытии наследства, предъявить свои требования к наследникам, принявшим наследство, независимо от наступления срока требования.

3. Если кредитор наследодателя не знал и не мог знать об открытии наследства, он вправе предъявить свои требования к наследникам, принявшим наследство, в течение одного года от наступления срока требования.

4. Кредитор наследодателя, не предъявивший требования к наследникам, принявшим наследство, в сроки, установленные частями второй и третьей настоящей статьи, лишается права требования.

Статья 1282. Обязанность наследников удовлетворить требования кредитора
1. Наследники обязаны удовлетворить требования кредитора полностью, но в пределах стоимости имущества, полученного по наследству. Каждый из наследников обязан удовлетворить требования кредитора лично, в размере, который соответствует его доле в наследстве.

2. Требования кредитора наследники обязаны удовлетворить путем единовременного платежа, если в договоренности между наследниками и кредитором другое не установлено.

В случае отказа от одноразового платежа суд по иску кредитора налагает взыскание на имущество, которое было передано наследникам в натуре.

Статья 1283. Охрана наследственного имущества
1. Охрана наследственного имущества осуществляется в интересах наследников, отказополучателей и кредиторов наследодателя с целью сохранения его до принятия наследства наследниками или вступления в законную силу решения суда о признании наследства выморочным.

2. Нотариус или в сельских населенных пунктах - уполномоченное должностное лицо соответствующего органа местного самоуправления по месту открытия наследства по заявлению наследников или по сообщению предприятий, учреждений, организаций, граждан, или на основании решения суда об объявлении физического лица умершим или по своей собственной инициативе принимает меры к охране наследственного имущества.

3. Охрана наследственного имущества продолжается до истечения срока, установленного для принятия наследства или вступления в законную силу решения суда о признании наследства выморочным.

Лица или органы, принимают меры по охране наследственного имущества, вправе заключать договоры с третьими лицами, направленные на обеспечение охраны наследственного имущества.

4. Расходы на охрану наследственного имущества возмещаются наследниками согласно их доле в наследстве, а в случае признания наследства выморочным - органом местного самоуправления, от имени территориальной общины осуществляет право собственности по наследия, которое признано выморочным.

Статья 1284. Охрана наследственного имущества исполнителем завещания
1. Если наследование осуществляется не только по завещанию, но и по закону, исполнитель завещания, которого назначил наследодатель, принимает мероприятия по охране всего наследства.

2. Наследники по закону имеют право назначить другое лицо, которое будет принимать меры по охране части наследства, наследуемого по закону.

Статья 1285. Управление наследством
1. Если в составе наследства находится имущество, требующее содержания, ухода, совершения других фактических или юридических действий для поддержания его в надлежащем состоянии, нотариус, а в населенных пунктах, где нет нотариуса, - соответствующий орган местного самоуправления, в случае отсутствия наследников или исполнителя завещания заключают договор на управление наследством с другим лицом.

2. Лицо, которое управляет наследством, имеет право на совершение любых необходимых действий, направленных на сохранение наследства до появления наследников или до принятия наследства.

3. Лицо, которое управляет наследством, имеет право на оплату за выполнение своих полномочий.
"""
GKU_g_88 = """ 
Глава 88 - Гражданского кодекса
Выполнение завещания

Статья 1286. Право завещателя на назначение исполнителя собрания
1. Завещатель может поручить исполнение завещания физическому лицу с полной гражданской дееспособностью или юридическому лицу (исполнителю завещания).

2. Если завещание составлено в пользу нескольких лиц, выполнение завещания может быть поручено любому из них.

3. Если завещание составлено в пользу одного лица, выполнение завещания может быть возложено на лицо, которое не является наследником по завещанию.

Статья 1287. Назначение исполнителя завещания по инициативе наследников
1. Наследники имеют право предъявить иск об отстранении исполнителя завещания, назначенного завещателем, от выполнения им своих полномочий, если он не может обеспечить выполнение воли завещателя.

2. Если завещатель не назначил исполнителя завещания или если лицо, которое была им назначено, отказалось от исполнения завещания или было отстранено от исполнения завещания, наследники имеют право выбрать исполнителя из числа наследников или назначить исполнителем завещания другое лицо.

3. Если наследники не могут достичь согласия относительно назначения исполнителя завещания, он по требованию одного из них может быть назначен судом.

Статья 1288. Назначение исполнителя завещания нотариусом
1. Исполнитель завещания может быть назначен нотариусом по месту открытия наследства, если завещатель не назначил исполнителя завещания или если исполнитель завещания отказался от выполнения завещания или был отстранен от его выполнения и если этого требуют интересы наследников.

Статья 1289. Согласие лица на назначение его исполнителем завещания
1. Лицо может быть назначено исполнителем завещания просто по его согласию.

2. Согласие лица быть исполнителем завещания может быть выражено в тексте самого завещания или добавлено к нему.

3. Лицо может подать нотариусу по месту открытия наследства заявление о согласии быть исполнителем завещания после открытия наследства.

Стаття 1290. Полномочия исполнителя завещания
1. Исполнитель завещания обязан:

принять меры к охране наследственного имущества;
принять меры по уведомлению наследников, отказополучателей, кредиторов об открытии наследства;
требовать от должников наследодателя выполнения ими своих обязательств;
управлять наследством;
обеспечить получение каждым из наследников доли наследства, которое определено в завещании;
обеспечить получение доли в наследстве лицами, имеющими право на обязательную долю в наследстве.
2. Исполнитель завещания обязан обеспечить выполнение наследниками действий, к которым их обязывает завещание.

3. Полномочия исполнителя завещания удостоверяются документом, который выдается нотариусом по месту открытия наследства.

Статья 1291. Право исполнителя завещания на плату за выполнение своих полномочий
1. Завещатель вправе определить в завещании то имущество (в натуре или в деньгах), которое исполнитель завещания имеет право получить из состава наследства как плату за выполнение своих полномочий.

2. Если размер платы не определен завещателем, она может быть определена по договоренности между исполнителем завещания и наследниками, а в случае спора - судом.

3. Исполнитель завещания имеет право требовать от наследников возмещения тех расходов, которые были им предприняты для охраны наследства, управления им и исполнением завещания.

Статья 1292. Контроль за исполнением завещания
1. Наследники имеют право контролировать действия исполнителя завещания;

2. Если наследниками являются малолетние, несовершеннолетние, недееспособные лица или лица, гражданская дееспособность которых ограничена, контроль за выполнением завещания осуществляют родители (усыновители), опекуны, попечители, а также орган опеки и попечительства.

3. По требованию лиц, определенных частями первой и второй настоящей статьи, исполнитель завещания должен отчитываться о действиях, которые были им совершены для исполнения завещания.

4. После исполнения завещания исполнитель завещания подает наследникам или их законным представителям отчет о выполнении своих полномочий.

Статья 1293. Право на обжалование действий исполнителя завещания
1. Наследники, их законные представители, а также орган опеки и попечительства имеют право обжаловать в суде действия исполнителя завещания, если они не соответствуют настоящему кодексу, другим законам, нарушают интересы наследников.

2. К требованиям о признании неправомерными действий исполнителя завещания применяется исковая давность в один год.

Статья 1294. Срок действия полномочий исполнителя завещания
1. Полномочия исполнителя завещания продолжаются до полного осуществления воли наследодателя, выраженной в завещании.

2. Действие полномочий исполнителя завещания прекращается нотариусом по месту открытия наследства по согласованию с наследниками и отказополучателем.

3. После прекращения полномочий исполнитель завещания должен вернуть нотариусу документ, который был ему выдан (часть третьей статьи 1290 Гражданского кодекса Украины).

4. В случае невозвращения исполнителем завещания документа, подтверждающего его полномочия, наследники имеют право истребовать документ, а также требовать возмещения нанесенного им ущерба.

Статья 1295. Право исполнителя завещания на отказ от осуществления своих полномочий
1. Исполнитель завещания, независимо от того, кем он был назначен, имеет право отказаться от осуществления своих полномочий.

2. Исполнитель завещания обязан немедленно уведомить наследников, а также других лиц, в отношении которых он должен был совершить определенные действия, об отказе от осуществления своих полномочий.

3. Исполнитель завещания не может отказаться от осуществления своих полномочий в случае необходимости совершения неотложных действий, промедление с которыми грозит нанесением ущерба наследникам.

4. Исполнитель завещания отвечает перед наследниками за убытки, которые были им причинены в связи с невыполнением требований, установленных в частях второй и третьей настоящей статьи.
"""
GKU_g_89 = """ 
Глава 89 - Гражданского кодекса
Оформление права на наследство

Статья 1296. Право наследника на получение свидетельства о право на наследство
1. Наследник, принявший наследство, может получить свидетельство о праве на наследство.

2. Если наследство приняло несколько наследников, свидетельство о праве на наследство выдается каждому из них с определением имени и долей в наследстве других наследников.

3. Отсутствие свидетельства о праве на наследство не лишает наследника права на наследство.

Статья 1297. Обязанность наследника обратиться за свидетельством о праве на наследство на недвижимое имущество
1. Наследник, принявший наследство, в составе которого есть недвижимое имущество, обязан обратиться к нотариусу за выдачей ему свидетельства о праве на наследство на недвижимое имущество.

2. Если наследство приняло несколько наследников, свидетельство о праве на наследство выдается на имя каждого из них, с указанием имени и доли в наследстве других наследников.

Статья 1298. Срок выдачи свидетельства о праве на наследство
1. Свидетельство о праве на наследство выдается наследникам по истечении шести месяцев со времени открытия наследства.

2. Если завещание составлено в пользу зачатого, но еще не рожденного ребенка, выдача свидетельства о праве на наследство и распределение наследства между всеми наследниками может состояться только после рождения ребенка.

Положение абзаца первого этой части применяется также относительно ребенка, зачатого при жизни наследодателя, но родившегося после его смерти, в случае наследования по закону.

3. До окончания срока принятия наследства нотариус может выдать наследнику разрешение на получение части вклада наследодателя в банке (финансовом учреждении), если это вызвано обстоятельствами, имеющими важное значение.

Статья 1299. Исключена
Статья 1300. Внесение изменений в свидетельство о праве на наследство
1. С согласия всех наследников, принявших наследство, нотариус по месту открытия наследства может внести изменения в свидетельстве о праве на наследство.

2. По требованию одного из наследников по решению суда могут быть внесены изменения в свидетельстве о праве на наследство.

3. В случаях, установленных частями первой и второй настоящей статьи, нотариус выдает наследникам новые свидетельства о праве на наследство.

Статья 1301. Признание недействительным свидетельства о праве на наследство
1. Свидетельство о праве на наследство признается недействительным по решению суда, если будет установлено, что лицо, которому оно выдано, не имело права на наследование, а также в других случаях, установленных законом.
"""
GKU_g_90 = """ 
Глава 90 - Гражданского кодекса
Наследственный договор

Статья 1302. Понятие наследственного договора
1. По наследственному договору одна сторона (приобретатель) обязуется выполнять распоряжения другой стороны (отчуждателя) и в случае его смерти приобретает право собственности на имущество отчуждателя.

Статья 1303. Стороны в наследственном договоре
1. Отчуждателем в наследственном договоре могут быть супруги, один из супругов или иное лицо.

2. Приобретателем в наследственном договоре может быть физическое или юридическое лицо.

Статья 1304. Форма наследственного договора
1. Наследственный договор составляется в письменной форме и подлежит нотариальному удостоверению а также государственной регистрации в Наследственном реестре в порядке, утвержденном Кабинетом Министров Украины.

Статья 1305. Обязанности приобретателя в наследственном договоре
1. Приобретатель в наследственном договоре может быть обязан совершить определенное действие имущественного или неимущественного характера до открытия наследства или после его открытия.

Статья 1306. Особенности наследственного договора с участием супругов
1. Предметом наследственного договора может быть имущество, принадлежащее супругам на праве общей совместной собственности, а также имущество, являющееся личной собственностью любого из супругов.

2. Наследственным договором может быть установлено, что в случае смерти одного из супругов наследство переходит к другому, а в случае смерти другого супруга его имущество переходит к приобретателю по договору.

Статья 1307. Обеспечение выполнения наследственного договора
1. На имущество, определенное в наследственном договоре, нотариус, удостоверяющий этот договор, налагает запрет отчуждения.

2. Завещание, которое отчуждатель составил относительно имущества, указанного в наследственном договоре, является ничтожным.

3. Отчуждатель вправе назначить лицо, которое будет осуществлять контроль за выполнением наследственного договора после его смерти.

При отсутствии такого лица контроль за выполнением наследственного договора осуществляет нотариус по месту открытия наследства.

Статья 1308. Расторжение наследственного договора
1. Завещание может быть расторгнуто судом по требованию отчуждателя в случае невыполнения приобретателем его распоряжений.

2. Завещание может быть расторгнуто судом по требованию приобретателя в случае невозможности выполнения им распоряжений отчуждателя.
"""